[{
  "corequisites": [],
  "course_name": "EXTERNAL REPORTING I",
  "course_number": "ACTG 317",
  "credits": "4",
  "description": "Examines the theory and practice of financial accounting, the processing and controls phases of the accounting system, and reporting to external parties. Emphasis is placed on the accounting cycle and financial statement structure and content. The emphasis on the accounting cycle includes the processing and tracing of transaction data from source documents to financial statements.",
  "prerequisites": [["BA 211", "BA 211H", "BA 211Z", "BA 211H"], ["BA 213", "BA 213H", "BA 213Z", "BA 213H"]]
}, {
  "corequisites": [],
  "course_name": "EXTERNAL REPORTING II",
  "course_number": "ACTG 318",
  "credits": "4",
  "description": "Continuation from ACTG 317 and the theory and practice of financial accounting and the reporting to external parties. Covers financial reporting objectives to provide information that is useful in investment and credit decisions, in assessing cash flow prospects, and about company resources and claims to those resources.",
  "prerequisites": [["ACTG 317"]]
}, {
  "corequisites": [],
  "course_name": "EXTERNAL REPORTING III",
  "course_number": "ACTG 319",
  "credits": "4",
  "description": "Continuation from ACTG 318 and the theory and practice of financial accounting and the reporting to external parties. Covers financial reporting objectives to provide information that is useful in investment and credit decisions, in assessing cash flow prospects, and about company resources and claims to those resources.",
  "prerequisites": [["ACTG 318"]]
}, {
  "corequisites": [],
  "course_name": "COST MANAGEMENT I",
  "course_number": "ACTG 321",
  "credits": "4",
  "description": "Reinforces and builds on the language and concepts of management accounting. Emphasizes different models for product costing and examines their effects on profit planning, budgeting, motivation, and control.",
  "prerequisites": [["ACTG 317"]]
}, {
  "corequisites": [],
  "course_name": "ACCOUNTING ANALYTICS",
  "course_number": "ACTG 379",
  "credits": "4",
  "description": "Covers the analysis of data as it pertains to accounting professionals. The focuses include analytic techniques for decision making and the examination of “big data” involving accounting information. Hands-on experiences will develop skills with select software tools used in data analytics for accounting professionals.",
  "prerequisites": [["ACTG 318"], ["BA 370", "BA 370H"]]
}, {
  "corequisites": [],
  "course_name": "READING & CONFERENCE",
  "course_number": "ACTG 405",
  "credits": "1-6",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "ACTG 407",
  "credits": "1-12",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "ACTG 410",
  "credits": "1-12",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED ACCOUNTING",
  "course_number": "ACTG 417",
  "credits": "4",
  "description": "Explores advanced financial accounting theory and practice, building on the External Reporting course series ACTG 317/ACTG 318/ACTG 319. Focuses on topics including corporate combinations, consolidated financial statements, and other emerging accounting issues.",
  "prerequisites": [["ACTG 319"]]
}, {
  "corequisites": [],
  "course_name": "IT AUDITING",
  "course_number": "ACTG 420",
  "credits": "4",
  "description": "Explores key information systems issues such as planning, acquisition, delivery, and monitoring from a risk and control perspective. Covers the use of IT audit standards, guidelines, and frameworks and build data analysis tool skills.",
  "prerequisites": [["ACTG 317"], ["BA 370", "BA 370H", "BIS 371", "BA 371", "BIS 471", "BA 479"]]
}, {
  "corequisites": [],
  "course_name": "TAXATION I",
  "course_number": "ACTG 424",
  "credits": "4",
  "description": "Covers concepts related to business taxation and focuses primarily on 1) basic income tax law as it relates to businesses, 2) the role of income taxes in decision making processes, and 3) basic income tax research. Intended to assist students in preparation to become a professional, and thus contains components designed to aid in the development of technical, analytical, problem-solving and communication skills.",
  "prerequisites": [["ACTG 319"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED TAXATION",
  "course_number": "ACTG 425",
  "credits": "4",
  "description": "Examines federal tax system as it applies to corporations, partnerships, and estates and trusts. Emphasizes on understanding tax planning for business owners and refining the ability to research tax issues.",
  "prerequisites": [["ACTG 319"]]
}, {
  "corequisites": [],
  "course_name": "ASSURANCE AND ATTESTATION SERVICES",
  "course_number": "ACTG 427",
  "credits": "4",
  "description": "Assertions of enterprises gain credibility when examined by an independent third party. Assurance and attestation provide credibility. Coverage includes ethics, risk, materiality, internal control, evidence and reporting.",
  "prerequisites": [["ACTG 319"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED AUDIT ANALYTICS",
  "course_number": "ACTG 428",
  "credits": "4",
  "description": "An advanced course covering audit theory, current audit practice and auditor professional skills. Includes in-class activities, readings, presentations, research and group discussions of relevant advanced audit topics. Understand the use and future of data analytics in the audit profession. Theory, current audit practice and auditor professional skills.",
  "prerequisites": [["ACTG 427"]]
}, {
  "corequisites": [],
  "course_name": "FINANCIAL STATEMENT ANALYSIS",
  "course_number": "ACTG 442",
  "credits": "4",
  "description": "Develops the understanding and skill to use financial statements for investment decisions, credit decisions, performance analysis, and forecasting. Three main topic areas: analysis overview, accounting analysis, and financial analysis.",
  "prerequisites": [["FIN 342", "BA 240", "BA 240H", "BA 360", "BA 360H"], ["ACTG 317"]]
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS IN ACCOUNTING",
  "course_number": "ACTG 499",
  "credits": "1-6",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "IT AUDITING",
  "course_number": "ACTG 520",
  "credits": "4",
  "description": "Explores key information systems issues such as planning, acquisition, delivery, and monitoring from a risk and control perspective. Covers the use of IT audit standards, guidelines, and frameworks and build data analysis tool skills.",
  "prerequisites": []
}]