[{
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "AEC 004",
  "credits": "0",
  "description": "Provides basic personal and professional skills that can be used within and outside of a work setting. Through practice, this experience guides students in building and maintaining positive professional relationships, networking/mentoring relationships, and enhances students’ understanding of the connection between theory and practice in their respective disciplines.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DISCOVERING AGRICULTURAL AND RESOURCE ECONOMICS",
  "course_number": "AEC 121",
  "credits": "1",
  "description": "Explore issues, opportunities, and challenges in the dynamic and diverse employment field of agricultural and resource economics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO CLIMATE CHANGE ECONOMICS AND POLICY",
  "course_number": "AEC 122",
  "credits": "3",
  "description": "Examines the role of economics and policy to mitigate greenhouse gas (GHG) emissions and adapt to climate change. Explores the challenges in global policy cooperation, the unequal distribution of economic damages across space and time, and the uncertainties inherent in every climate policy decision. Analyzes strategies to GHG mitigate emissions, including market-based solutions like cap and trade, along with adaptation policy options related to sea-level rise, natural disasters, agriculture, forests and human migration. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AEC 199",
  "credits": "1-4",
  "description": "Targeted courses that focus on specific topics in agricultural and resource economics. Topics may vary from term to term and from year to year. May be repeated for credit when topics differ.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AGRICULTURAL AND FOOD MANAGEMENT",
  "course_number": "AEC 211",
  "credits": "4",
  "description": "Economic and business principles applied to the management of firms in agricultural and food industries, including farms, ranches and nurseries, agricultural input suppliers, packers, shippers, processors and food manufacturers and distributors; firm-level goal setting, information management and financial analysis.",
  "prerequisites": ["AEC 250", "AEC 250H", "AEC 251", "ECON 201", "ECON 201H"]
}, {
  "corequisites": [],
  "course_name": "AGRICULTURAL AND FOOD MARKETING",
  "course_number": "AEC 221",
  "credits": "3",
  "description": "Organization and functions of agricultural and food markets both domestic and international; market channels and supply chains for various agricultural commodities and food products; role of agribusiness, cooperatives, and government in marketing decisions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GLOBAL POVERTY AND SUSTAINABLE DEVELOPMENT",
  "course_number": "AEC 243",
  "credits": "3",
  "description": "Students are introduced to the challenges of eradicating extreme poverty and achieving sustainable economic development in the world. Topics include: the measurement of poverty and inequality; analysis of food security and agricultural development; the role of health and education in economic development; credit markets; risk and insurance; climate change and biodiversity; gender equality; rural-urban and international migration; population growth and development; institutions and economic performance; the political economy of development.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO ENVIRONMENTAL ECONOMICS AND POLICY",
  "course_number": "AEC 250",
  "credits": "4",
  "description": "Examines how economic forces and social institutions contribute to environmental degradation and help build management solutions. Explains key economic concepts for valuing environmental resources and evaluating the trade-offs of alternative management approaches from private markets to regulation. Applies the concepts and theories to topical environmental issues such as water pollution and conserving biodiversity.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO ENVIRONMENTAL ECONOMICS AND POLICY",
  "course_number": "AEC 250H",
  "credits": "4",
  "description": "Examines how economic forces and social institutions contribute to environmental degradation and help build management solutions. Explains key economic concepts for valuing environmental resources and evaluating the trade-offs of alternative management approaches from private markets to regulation. Applies the concepts and theories to topical environmental issues such as water pollution and conserving biodiversity.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO AGRICULTURAL AND FOOD ECONOMICS",
  "course_number": "AEC 251",
  "credits": "4",
  "description": "Examines the unique challenges of agricultural and food systems and their economic consequences. Applies rational choice theory, models of supply and demand, and models of market structure, with particular attention on price formation for agricultural and food products. Analyzes how market interdependencies, government policy, the behavior of firms, and market structure within agricultural and food systems affects performance of the U.S. agri-food system.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ENVIRONMENTAL LAW",
  "course_number": "AEC 253",
  "credits": "POLICY",
  "description": "A general introduction to federal environmental law and policy in the U.S. Familiarizes students with basic legal institutions and concepts of the American legal system, outlines the transition of environmental policy from its common law roots to its modern administrative law form, and gives an overview of the major federal environmental statutes. Relationships among legal theory and process and economic principles are emphasized.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AEC 299",
  "credits": "1-4",
  "description": "Targeted courses that focus on specific topics in agricultural and resource economics. Topics may vary from term to term and from year to year. May be repeated for credit when topics differ.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERMEDIATE APPLIED ECONOMICS I: PRODUCERS AND CONSUMERS",
  "course_number": "AEC 311",
  "credits": "4",
  "description": "An examination of the theories of consumer behavior and demand, production cost, the firm, supply, and competitive and monopoly market structures.",
  "prerequisites": ["AEC 250", "AEC 250H", "AEC 251", "ECON 201", "ECON 201H", "MTH 241", "MTH 251", "MTH 251H"]
}, {
  "corequisites": [],
  "course_name": "INTERMEDIATE APPLIED ECONOMICS II: MARKETS",
  "course_number": "AEC 313",
  "credits": "WELFARE",
  "description": "Complementing the private-decision focus in AEC 311, the present course focuses on the intermediate microeconomic theory of social welfare and public decision-making. Topics include exchange, monopoly, game theory, social welfare, externalities, public goods and choice, asymmetric information, uncertainty, and cost-benefit analysis. Substantial attention will be given to the implications of these theories for real-world problems, especially regarding resource and environmental issues.",
  "prerequisites": ["MTH 241", "AEC 311", "ECON 311"]
}, {
  "corequisites": [],
  "course_name": "*NATURAL RESOURCE ECONOMICS AND POLICY",
  "course_number": "AEC 351",
  "credits": "3",
  "description": "Application of principles of economics to identify the causes, consequences, and ways of dealing with natural resource problems, including problems associated with fisheries, forests, water resources, and land. Conceptual topics and policy applications. Emphasis is on developing students' skill in applying an economic way of thinking about natural resource management.",
  "prerequisites": ["AEC 250", "AEC 250H", "ECON 201", "ECON 201H"]
}, {
  "corequisites": [],
  "course_name": "*ENVIRONMENTAL ECONOMICS AND POLICY",
  "course_number": "AEC 352",
  "credits": "3",
  "description": "Provides an overview of the interrelationships between economic activity, the environment, and public policy. Through case studies, discussion groups, readings, and group activities, students learn how economists define and analyze environmental problems and the types of policies they advocate for managing environmental quality. CROSSLISTED as AEC 352/ECON 352.",
  "prerequisites": ["AEC 250", "AEC 250H", "ECON 201", "ECON 201H"]
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO COASTAL AND MARINE RESOURCE ECONOMICS",
  "course_number": "AEC 353",
  "credits": "3",
  "description": "Introduces tools of economic analysis for understanding coastal and marine resource management. Surveys a selection of current topics in the field, emphasizing innovation in production and stewardship, institutions, and sustainability.",
  "prerequisites": ["MTH 111", "MTH 111Z", "AEC 250", "AEC 250H", "ECON 201", "ECON 201H"]
}, {
  "corequisites": [],
  "course_name": "AGRICULTURAL COOPERATIVES",
  "course_number": "AEC 372",
  "credits": "3",
  "description": "An introduction to and in-depth examination of the agricultural cooperative. Students will gain a working knowledge of the concepts, principles, and terminology of agricultural cooperatives through reference materials, lectures, presentations by guest speakers and a cooperatives tour. Students will consider the strengths and weaknesses of the agricultural cooperative as well as the unique management and operational challenges inherent to this form of business operation.",
  "prerequisites": ["AEC 211"]
}, {
  "corequisites": [],
  "course_name": "AGRICULTURAL LAW",
  "course_number": "AEC 388",
  "credits": "4",
  "description": "Application of legal principles to business decision making in farming, ranching, and the agricultural support industry. Consideration of the obligations arising out of contract, tort, property, water, public land, and natural resource law.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AEC 399",
  "credits": "1-4",
  "description": "Targeted courses that focus on specific topics in agricultural and resource economics. Topics may vary from term to term and from year to year. May be repeated for credit when topics differ.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AEC 399H",
  "credits": "1-4",
  "description": "Targeted courses that focus on specific topics in agricultural and resource economics. Topics may vary from term to term and from year to year. May be repeated for credit when topics differ.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "AEC 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "AEC 402",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "AEC 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "AEC 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "AEC 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AEC 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AEC 407H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "AEC 408",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "AEC 410",
  "credits": "1-6",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO FOOD SYSTEMS: LOCAL TO GLOBAL",
  "course_number": "AEC 411",
  "credits": "3",
  "description": "Critically examines the operation and outcomes of food systems using a systems thinking framework to analyze food supply chains, including inputs such as natural processes, technology, labor, education and public policy. Emphasizes the causal connections between food system activities and how they give rise to a wide range of environmental and social challenges, from climate change to food insecurity. Evaluates and recommends public and private policy to improve food system outcomes. Emphasizes analysis based on scale, historical changes, social and cultural perspectives, and emerging alternative food system practices including organic production.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECONOMICS OF RURAL POVERTY AND THE U.S. SOCIAL SAFETY NET",
  "course_number": "AEC 421",
  "credits": "4",
  "description": "Introduces students to the geography of poverty in the United States and the “social safety net” that the U.S. has constructed to reduce poverty and its negative effects. The course focuses on the geography of the social safety net, the operation and administration of the safety net, and how recent changes in the social safety net may have disadvantaged rural people and places.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL LAW",
  "course_number": "AEC 432",
  "credits": "4",
  "description": "Legal relationships arising out of rights to air, water, and land. The impact of federal and state regulation on pollution control and on the production, use, and disposal of hazardous materials.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^BENEFIT-COST ANALYSIS",
  "course_number": "AEC 434",
  "credits": "4",
  "description": "Develops the fundamental tools for Benefit-Cost Analysis, a technique for evaluating a project or investment by comparing the economic benefits with the economic costs of the activity. Examines the tricky topic of how to measure the benefits of non-market such as good health and higher environmental quality. The methods introduced here apply to a wide variety of situations. Explores the broad issues of how to think about uncertainty and risk, how to discount future costs and benefits, to value lives saved, and other challenging topics.",
  "prerequisites": ["AEC 311", "ECON 411"]
}, {
  "corequisites": [],
  "course_name": "THE ECONOMICS OF BUSINESS ORGANIZATION IN THE FOOD SYSTEM",
  "course_number": "AEC 440",
  "credits": "4",
  "description": "Application of economic analysis to questions related to the choice of an appropriate form of business organization for a wide variety of food system enterprises. Topics include costs of contracting, costs of ownership, enterprise scope and scale, and the dynamics of business ownership and structure. Particular emphasis is given to entrepreneurial enterprises and cooperative businesses in the food system.",
  "prerequisites": ["AEC 311", "ECON 311"]
}, {
  "corequisites": [],
  "course_name": "AGRICULTURAL BUSINESS MANAGEMENT",
  "course_number": "AEC 442",
  "credits": "4",
  "description": "Application of economic, financial, and strategic management principles to agricultural business with a focus on a case-study framework for analysis and business decision making for alternative business management strategies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMODITY FUTURES AND OPTIONS MARKETS",
  "course_number": "AEC 444",
  "credits": "4",
  "description": "Provides an overview of the basic concepts needed to use commodity futures and options markets to successfully manage price risk. To address the increasingly global economy in which commodity transactions occur, the course also includes financial futures such as interest rates and currencies. Specific topics covered include contract standardization, speculation and hedging, opening and closing of positions, and basis, i.e. the relationship between cash and futures markets, input-output hedges, and spreads. Students also gain hands-on experience through a trading simulation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO APPLIED ECONOMETRICS",
  "course_number": "AEC 446",
  "credits": "4",
  "description": "Introduces students to applied econometrics: the use of statistical techniques to estimate and test economic relationships. Topics include multiple regression models, multicollinearity, and simultaneous equations. The applications and labs will focus on econometric analysis of real world problems pertaining to issues in environmental, food, and resource economics and policy.",
  "prerequisites": ["AEC 311", "ST 351", "ST 351H"]
}, {
  "corequisites": [],
  "course_name": "AGRICULTURAL PRICE AND MARKET ANALYSIS",
  "course_number": "AEC 447",
  "credits": "4",
  "description": "Price determination for food and agricultural commodities; development of quantitative economic models that explain and predict prices and other market outcomes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED TOPICS IN ENVIRONMENTAL AND RESOURCE ECONOMICS",
  "course_number": "AEC 448",
  "credits": "3",
  "description": "Reviews core concepts of economic efficiency and market failures and then focuses on the economics of environmental regulation. Develops an appreciation for the structure of key concepts that underlie the economic approach to environmental issues and applications to policy and regulations. Builds skills in assessing regulatory policies from the perspective of economics.",
  "prerequisites": ["AEC 311", "AEC 352"]
}, {
  "corequisites": [],
  "course_name": "PROGRAM EVALUATION",
  "course_number": "AEC 455",
  "credits": "3",
  "description": "Explores the leading methods for evaluating the impact of public programs and policies, specifically focusing on causal inference and empirical applications. Methods covered include randomized experiments as well as techniques to estimate impacts using observational data sources common in health, education and development settings.",
  "prerequisites": ["ST 352", "AEC 446", "ECON 424"]
}, {
  "corequisites": [],
  "course_name": "SUSTAINABLE AGRICULTURAL DEVELOPMENT",
  "course_number": "AEC 456",
  "credits": "3",
  "description": "Provides a non-technical, accessible primer on sustainable agricultural development and its relationship to sustainable development. Uses economic principles and tradeoff analysis to evaluate the sustainability of agricultural development pathways at the global and national scales, and agricultural systems at the agroecosystem and farm-household scales. Reviews the sustainability challenges facing agriculture in the developing, transitional and industrialized worlds. Examines demand-side and supply-side strategies and policies to improve agricultural sustainability, including product certification and labeling, investment in private and public R&D, and farm-level taxes and subsidies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^AGRICULTURAL AND FOOD POLICY ISSUES",
  "course_number": "AEC 461",
  "credits": "4",
  "description": "Principles of agricultural and food policy formulation; agricultural price and income policies in relation to land use, water, and food policies; interrelationships among U.S. and foreign agriculture and trade policies.",
  "prerequisites": ["AEC 311", "ECON 311"]
}, {
  "corequisites": [],
  "course_name": "AGRICULTURAL AND FOOD FINANCIAL MANAGEMENT",
  "course_number": "AEC 465",
  "credits": "4",
  "description": "Explores fundamental financial concepts in the context of agriculture and food businesses, including analysis of financial ratios, the use of leverage, compounding and discounting, capital budgeting, and risk management. Emphasizes the application of these concepts and tools to management decisions.",
  "prerequisites": ["AEC 211", "BA 211", "BA 211H", "BA 211Z", "BA 211HZ", "BA 315"]
}, {
  "corequisites": [],
  "course_name": "AGRICULTURAL AND FOOD MARKETING MANAGEMENT",
  "course_number": "AEC 466",
  "credits": "4",
  "description": "Principles, trends, issues, barriers, policies, strategies and decisions involved in domestic and international marketing of perishable and storable agricultural commodities and food products from the point of production to the point of consumption. Topics include firm-level marketing concepts, the integration of marketing with firms’ overall strategic management goals, as well as comparative studies across multiple outlets for agricultural and food products, to include local, regional, and global markets.",
  "prerequisites": ["AEC 221", "AEC 250", "AEC 250H", "AEC 251", "ECON 201", "ECON 201H"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AEC 499",
  "credits": "1-16",
  "description": "Various topics in agricultural and resource economics of special and current interest not covered in other courses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "AEC 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "AEC 502",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "AEC 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "AEC 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL PROJECTS",
  "course_number": "AEC 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AEC 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "AEC 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO FOOD SYSTEMS: LOCAL TO GLOBAL",
  "course_number": "AEC 511",
  "credits": "3",
  "description": "Critically examines the operation and outcomes of food systems using a systems thinking framework to analyze food supply chains, including inputs such as natural processes, technology, labor, education and public policy. Emphasizes the causal connections between food system activities and how they give rise to a wide range of environmental and social challenges, from climate change to food insecurity. Evaluates and recommends public and private policy to improve food system outcomes. Emphasizes analysis based on scale, historical changes, social and cultural perspectives, and emerging alternative food system practices including organic production.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MICROECONOMIC THEORY I",
  "course_number": "AEC 512",
  "credits": "4",
  "description": "Fundamental topics in microeconomic theory. Topics include utility maximization and consumer demand, profit maximization and the theory of the firm, and labor and capital markets.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MICROECONOMIC THEORY II",
  "course_number": "AEC 513",
  "credits": "4",
  "description": "Emphasizes principles for microeconomic theory at the master's level. Builds upon the foundations covered in AEC 512, and extends the theory and principles to cover uncertainty, game theory, competitive market equilibrium and welfare analysis, imperfect competition, and market failures. Primary emphasis is on understanding microeconomic theory and the underlying assumptions, and how it is applied to real world settings.",
  "prerequisites": ["AEC 512"]
}, {
  "corequisites": [],
  "course_name": "BEHAVIORAL AND EXPERIMENTAL ECONOMICS",
  "course_number": "AEC 516",
  "credits": "3",
  "description": "Introduces the concepts of behavioral economics, which tackles situations that are inconsistent with the standard rational behavior model on both individual and market level, and experimental methods, which focuses on controlled identification, illustration and study of various socio-economics principles and market mechanisms. Demonstrates how concepts and tools can be used in a variety of settings, including provision of environmental services, health and social policy design, marketing and product design. Consists of a theoretical component, based on current readings and guest lectures by researchers in the field, and a practical component, focused on evaluation, design and creation of research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECONOMICS OF RURAL POVERTY AND THE U.S. SOCIAL SAFETY NET",
  "course_number": "AEC 521",
  "credits": "4",
  "description": "Introduces students to the geography of poverty in the United States and the “social safety net” that the U.S. has constructed to reduce poverty and its negative effects. The course focuses on the geography of the social safety net, the operation and administration of the safety net, and how recent changes in the social safety net may have disadvantaged rural people and places.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED ECONOMETRICS",
  "course_number": "AEC 525",
  "credits": "4",
  "description": "General principles of applied econometric research are emphasized, including model building, data analysis, hypothesis testing, and evaluation and interpretation of results. A variety of estimators are applied to real data, including least squares, panel data, simultaneous equations, discrete choice, and limited dependent variable models.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL LAW",
  "course_number": "AEC 532",
  "credits": "4",
  "description": "Legal relationships arising out of rights to air, water, and rights to air, water, and land. The impact of federal and state regulation on pollution control and on the production, use, and disposal of hazardous materials.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL AND RESOURCE ECONOMICS",
  "course_number": "AEC 534",
  "credits": "3",
  "description": "Environmental problems and misuse of natural resources are caused by humans’ behavior, and thus must be solved by changing behavior. Explores the ways economics is central to understanding the incentive behind the causes, consequences, and potential for effective solutions to environmental and resource problems involving air, water, fish, forests, climate change, and biodiversity. Builds on microeconomics principles to include theories of market failures, externalities, common-pool resources, and institutions, as well as growth and sustainability. Equips students with tools for non-market valuation and for critical evaluation of environmental policies’ benefits and costs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE ECONOMICS OF BUSINESS ORGANIZATION IN THE FOOD SYSTEM",
  "course_number": "AEC 540",
  "credits": "4",
  "description": "Application of economic analysis to questions related to the choice of an appropriate form of business organization for a wide variety of food system enterprises. Topics include costs of contracting, costs of ownership, enterprise scope and scale, and the dynamics of business ownership and structure. Particular emphasis is given to entrepreneurial enterprises and cooperative businesses in the food system.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMODITY FUTURES AND OPTIONS MARKETS",
  "course_number": "AEC 544",
  "credits": "4",
  "description": "Provides an overview of the basic concepts needed to use commodity futures and options markets to successfully manage price risk. To address the increasingly global economy in which commodity transactions occur, the course also includes financial futures such as interest rates and currencies. Specific topics covered include contract standardization, speculation and hedging, opening and closing of positions, and basis, i.e. the relationship between cash and futures markets, input-output hedges, and spreads. Students also gain hands-on experience through a trading simulation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO APPLIED ECONOMETRICS",
  "course_number": "AEC 546",
  "credits": "4",
  "description": "Introduces students to applied econometrics: the use of statistical techniques to estimate and test economic relationships. Topics include multiple regression models, multicollinearity, and simultaneous equations. The applications and labs will focus on econometric analysis of real world problems pertaining to issues in environmental, food, and resource economics and policy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED TOPICS IN ENVIRONMENTAL AND RESOURCE ECONOMICS",
  "course_number": "AEC 548",
  "credits": "3",
  "description": "Reviews core concepts of economic efficiency and market failures and then focuses on the economics of environmental regulation. Develops an appreciation for the structure of key concepts that underlie the economic approach to environmental issues and applications to policy and regulations. Builds skills in assessing regulatory policies from the perspective of economics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL AND NATURAL RESOURCE ECONOMICS",
  "course_number": "AEC 550",
  "credits": "4",
  "description": "Presents concepts, theories, and methods used in the economic analysis of environmental and natural resource issues. The emphasis is on the economics of environmental policies and the development of decision rules regarding the efficient use of natural resources.",
  "prerequisites": ["AEC 512"]
}, {
  "corequisites": [],
  "course_name": "APPLICATIONS OF ENVIRONMENTAL AND NATURAL RESOURCE ECONOMICS",
  "course_number": "AEC 551",
  "credits": "4",
  "description": "Applies and expands upon concepts, theories, and methods in environmental and natural resource economics introduced in AEC 550. Topics include non-market valuation, discounting, and benefit-cost analysis, as well as the role and importance of institutions, appropriate research methods, and the philosophical basis for normative judgments in economics.",
  "prerequisites": ["AEC 550"]
}, {
  "corequisites": [],
  "course_name": "PROGRAM EVALUATION",
  "course_number": "AEC 555",
  "credits": "3",
  "description": "Explores the leading methods for evaluating the impact of public programs and policies, specifically focusing on causal inference and empirical applications. Methods covered include randomized experiments as well as techniques to estimate impacts using observational data sources common in health, education and development settings.",
  "prerequisites": ["ECON 524", "PPOL 522"]
}, {
  "corequisites": [],
  "course_name": "SUSTAINABLE AGRICULTURAL DEVELOPMENT",
  "course_number": "AEC 556",
  "credits": "3",
  "description": "Provides a non-technical, accessible primer on sustainable agricultural development and its relationship to sustainable development. Uses economic principles and tradeoff analysis to evaluate the sustainability of agricultural development pathways at the global and national scales, and agricultural systems at the agroecosystem and farm-household scales. Reviews the sustainability challenges facing agriculture in the developing, transitional and industrialized worlds. Examines demand-side and supply-side strategies and policies to improve agricultural sustainability, including product certification and labeling, investment in private and public R&D, and farm-level taxes and subsidies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AGRICULTURAL AND FOOD FINANCIAL MANAGEMENT",
  "course_number": "AEC 565",
  "credits": "4",
  "description": "Explores fundamental financial concepts in the context of agriculture and food businesses, including analysis of financial ratios, the use of leverage, compounding and discounting, capital budgeting, and risk management. Emphasizes the application of these concepts and tools to management decisions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AGRICULTURAL AND FOOD MARKETING MANAGEMENT",
  "course_number": "AEC 566",
  "credits": "4",
  "description": "Principles, trends, issues, barriers, policies, strategies and decisions involved in domestic and international marketing of perishable and storable agricultural commodities and food products from the point of production to the point of consumption. Topics include firm-level marketing concepts, the integration of marketing with firms’ overall strategic management goals, as well as comparative studies across multiple outlets for agricultural and food products, to include local, regional, and global markets.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AEC 599",
  "credits": "0-16",
  "description": "Various topics in applied economics of special and current not covered in other courses. May be repeated for credit when topics differ.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "AEC 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "AEC 602",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "AEC 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "AEC 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL PROJECTS",
  "course_number": "AEC 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AEC 607",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "AEC 608",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED MICROECONOMIC THEORY I",
  "course_number": "AEC 611",
  "credits": "4",
  "description": "A rigorous development of the theory of consumption and production, with emphasis on duality.",
  "prerequisites": ["AEC 512", "AEC 513"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED MICROECONOMIC THEORY II",
  "course_number": "AEC 612",
  "credits": "4",
  "description": "A rigorous extension of the theory of the consumer and firm to aggregate and heterogeneous populations, decision making under uncertainty, and related game theory concepts.",
  "prerequisites": ["AEC 611"]
}, {
  "corequisites": [],
  "course_name": "BEHAVIORAL AND EXPERIMENTAL ECONOMICS",
  "course_number": "AEC 616",
  "credits": "3",
  "description": "Introduces the concepts of behavioral economics, which tackles situations that are inconsistent with the standard rational behavior model on both individual and market level, and experimental methods, which focuses on controlled identification, illustration and study of various socio-economics principles and market mechanisms. Demonstrates how concepts and tools can be used in a variety of settings, including provision of environmental services, health and social policy design, marketing and product design. Consists of a theoretical component, based on current readings and guest lectures by researchers in the field, and a practical component, focused on evaluation, design and creation of research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED ECONOMETRICS I",
  "course_number": "AEC 624",
  "credits": "4",
  "description": "Emphasizes the basic theory underlying the main types of estimators used in econometrics, as well as their application in empirical research. Topics including derivation, properties, and application of method of moments, maximum likelihood, ordinary and generalized least squares, and instrumental variables estimators, statistical inference and hypothesis testing, and model building and specification analysis. Provides the necessary foundation for estimation techniques covered in AEC 625 and AEC 626.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED ECONOMETRICS II",
  "course_number": "AEC 625",
  "credits": "4",
  "description": "Explores estimation techniques used in modern applied economic analysis, with an emphasis on research design. Topics include regression discontinuity design, linear panel data models, difference-in-differences, matching, synthetic control, systems estimation, and inference.",
  "prerequisites": ["AEC 624"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED ECONOMETRICS III",
  "course_number": "AEC 626",
  "credits": "4",
  "description": "Develops non-linear econometric methods and applications, including M-estimators, non- linear least-squares, discrete choice, limited dependent variables, quantile regression, and machine learning. Focuses on an applied orientation, emphasizing problems of data measurement, model selection, and model specification encountered in practical applications of econometrics.",
  "prerequisites": ["AEC 625"]
}, {
  "corequisites": [],
  "course_name": "COMPUTATIONAL ECONOMICS",
  "course_number": "AEC 627",
  "credits": "4",
  "description": "Covers the numerical analysis of static optimization models and stochastic dynamic models in resource and development economics, emphasizing formulation, solution, and simulation of dynamic optimization, rational expectations, and arbitrage pricing models.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SUSTAINABLE DEVELOPMENT",
  "course_number": "AEC 640",
  "credits": "3",
  "description": "Surveys research on the quantitative economic analysis of sustainable development, with an emphasis on integrated assessment methods and models and their application to agriculture and rural development policy, agricultural technology impact assessment, and climate change impact assessment.",
  "prerequisites": ["AEC 611", "AEC 612", "AEC 625"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED TOPICS IN DEVELOPMENT ECONOMICS",
  "course_number": "AEC 643",
  "credits": "3",
  "description": "Introduces students to key issues in the economics of development along with the quantitative methods required to conduct advanced research in these topics. Topics include: the measurement of poverty and inequality, the analysis of health and education policies, the role of land, labor, credit and insurance markets in economic development, technology adoption, agrarian contracts, gender issues, and the political economy of development.",
  "prerequisites": ["AEC 612", "AEC 626"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED NATURAL RESOURCE ECONOMICS",
  "course_number": "AEC 651",
  "credits": "3",
  "description": "Contemporary economic theory of dynamic natural resource allocation is introduced. Assignments focus on analytical and numerical methods for solving dynamic optimization problems in resource and environmental management. Lecture and readings emphasize current research trends in the field and relevant advances in quantitative methodology.",
  "prerequisites": ["AEC 611"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED ENVIRONMENTAL ECONOMICS",
  "course_number": "AEC 652",
  "credits": "3",
  "description": "Interrelationships of natural resource use and the environment; applied welfare and benefit-cost analysis; externalities and pollution abatement; non-market valuation of resources; property rights; legal and social constraints; policy approaches.",
  "prerequisites": ["AEC 513", "AEC 525"]
}, {
  "corequisites": [],
  "course_name": "EMPIRICAL ENVIRONMENTAL AND RESOURCE ECONOMICS",
  "course_number": "AEC 653",
  "credits": "3",
  "description": "Introduces empirical methods at the current frontiers of research in environmental and resource economics. General topics may include the identification of non-market values, revealed and stated preference methods, environmental policy evaluation, equilibrium sorting models, and climate econometrics.",
  "prerequisites": ["AEC 513", "AEC 525"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AEC 699",
  "credits": "1-16",
  "description": "Various topics in applied economics of special and current interest not covered in other courses.",
  "prerequisites": []
}]