[{
  "corequisites": [],
  "course_name": "INTRODUCTION TO AGRICULTURAL EDUCATION",
  "course_number": "AED 235",
  "credits": "2",
  "description": "Introduces students to the field of agricultural education. Explore the historical foundations and career pathways in non-formal and school-based agricultural education. Topics will include school-based agricultural education, non-formal and extension education, and agricultural literacy. Develop career skills and a plan to pursue a future career in agricultural education.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EARLY FIELD EXPERIENCE",
  "course_number": "AED 313",
  "credits": "4",
  "description": "Explores the agricultural education profession through this advanced form of early field experience. Observes a formal or non-formal agricultural education program and assists with instructional and non-instructional activities. Gains a better understanding of the day-to-day activities involved in facilitating an agricultural education program, whether formal (school-based) or non-formal (4-H, Extension, etc.).",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PLANNING AND DELIVERING NON-FORMAL AGRICULTURAL EDUCATION",
  "course_number": "AED 325",
  "credits": "3",
  "description": "This course uses adult learning theory and practice, including planning non-formal agricultural education programs for youth and adults, methods of instructional delivery, effective use of instructional technology, marketing agricultural education programs, and evaluation of agricultural education outcomes. Microteaching (practice teaching presentations) and group presentations required as part of laboratory assignments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AED 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AED 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "AED 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "AED 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "AED 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AED 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "AED 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "AED 509",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL INTERNSHIP: AGRICULTURE EDUCATION",
  "course_number": "AED 510",
  "credits": "1-40",
  "description": "A field experience in which the intern will integrate academic study with classroom teaching experience to learn specific competencies relating to functioning well in the context of the classroom and the school, and demonstrate this competency through the assessment of work by supervisors and by evidence collected and presented in work samples.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EXTENSION COURSE IN TEACHER EDUCATION/PEDAGOGY",
  "course_number": "AED 518",
  "credits": "1-3",
  "description": "Enables present and prospective teachers of agriculture to continue their professional development on pedagogical topics of current importance.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROGRAM ORGANIZATION AND MANAGEMENT",
  "course_number": "AED 552",
  "credits": "3",
  "description": "Explores the foundations of vocational education, essential learning skills, advisory committees, and development of a vocational education philosophy. Students will study the elements of educational reform as they apply to specific service areas. Resource analysis, student organizations, and school-to-work transitions will also be studied.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED INSTRUCTIONAL STRATEGIES",
  "course_number": "AED 553",
  "credits": "3",
  "description": "Helps students in the identification and development of goals, objectives and units. The course includes the development and application of subject area instructional strategies/models, including applied math, writing, communication skills, measurement and evaluation of achievement, and delivery of instruction to at-risk students. Safety is a primary focus.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MICRO-TEACHING",
  "course_number": "AED 554",
  "credits": "3",
  "description": "Planning, presenting and evaluating lessons in a micro-teaching lab. It includes application of content pedagogy strategies, subject matter principles and media technology. Lessons presented on safety.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LABORATORY PEDAGOGY",
  "course_number": "AED 555",
  "credits": "3",
  "description": "Applications of efficient planning, organizing, and teaching skills within the laboratory setting and utilization of laboratory facilities to optimize learning experiences. Laboratory facilities could include a shop, greenhouse, land laboratories/outdoors, agriscience labs, aquaculture, computer lab, field trips, etc.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LINK RESEARCH",
  "course_number": "AED 556",
  "credits": "TEACHING",
  "description": "Links research to teaching. Students will work with cooperating teachers to identify and apply research to teaching.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ISSUES AND TRENDS IN CURRICULUM AND INSTRUCTION",
  "course_number": "AED 557",
  "credits": "3",
  "description": "Emphasizes trends related to subject matter curriculum issues unique to agricultural education at the secondary level.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "IMPROVING AGRICULTURAL SCIENCE AND TECHNOLOGY PROGRAMS",
  "course_number": "AED 558",
  "credits": "3",
  "description": "Provides impetus toward evaluation and improvement of local programs of agricultural science and technology (AST), such that they better reflect community, regional, and national needs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMUNICATING AGRICULTURAL AND LIFE SCIENCES TO THE PUBLIC",
  "course_number": "AED 580",
  "credits": "3",
  "description": "Focuses on communicating with the public about research-based science in agricultural and life sciences for the purposes of education, influencing public policy, promoting positive agricultural practices and creating change. Explores various communication outlets and media and how they are appropriate for different messages.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AED 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DISSERTATION",
  "course_number": "AED 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSTRUMENTATION AND DATA COLLECTION IN SOCIAL SCIENCE",
  "course_number": "AED 640",
  "credits": "3",
  "description": "Addresses the selection, development, and analysis of various types of quantitative instruments and procedures for collecting research data. The course has a quantitative focus and is oriented toward social science research.",
  "prerequisites": []
}]