[{
  "corequisites": [],
  "course_name": "INFORMATION TECHNOLOGY IN AGRICULTURE",
  "course_number": "AG 111",
  "credits": "3",
  "description": "Using information technology in agriculture and agribusiness; practical experience with computer programs applicable to all agricultural disciplines.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "AG 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ORIENTATION TO THE AGRICULTURAL SCIENCES MAJOR",
  "course_number": "AG 200",
  "credits": "2",
  "description": "Exploration of Agricultural Sciences major and career opportunities.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO EXTENSION AND ENGAGEMENT",
  "course_number": "AG 230",
  "credits": "3",
  "description": "For students interested in pursuing a career with the OSU Extension Service. An introduction to the OSU Extension Service mission, philosophy, history, organization, structure, administration, program areas, Extension program development, Extension teaching and delivery methods, and the involvement and use of volunteers.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ECOSYSTEM SCIENCE OF PACIFIC NW INDIANS",
  "course_number": "AG 301",
  "credits": "3",
  "description": "Designed and presented in partnership with Pacific Northwest Indians and Alaska Natives, focusing on natural ecosystems, differing views, power relationships, policymaking, and gender roles.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*NATIVE AMERICAN AGRICULTURE",
  "course_number": "AG 311",
  "credits": "3",
  "description": "Explores Native North American agriculture and land management--prehistory of important domesticates such as maize, historic change, and contemporary issues including modern stereotypes, women in agriculture, cultural survival, and both the physical and spiritual significance of these crops in Native American communities and around the globe past and present.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*WOMEN IN AGRICULTURE",
  "course_number": "AG 321",
  "credits": "3",
  "description": "Explores and celebrates women in agricultural sciences in Oregon, in the U.S., and from around the world. Examines a spectrum of topics related to women in agriculture locally to globally: women’s roles in agricultural communities, women’s roles in agricultural production and food security, women-driven agricultural development, gender roles in agriculture in rural areas and women's agency and challenges. Provides a broad picture of women’s contributions to agricultural practices and research, throughout history and in contemporary societies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCEMENT & CONSUMPTION OF AGRICULTURAL MEDIA",
  "course_number": "AG 350",
  "credits": "3",
  "description": "Discusses how evolving technology has changed the ways agricultural communicators reach the public and share about scientific advancements, products, and issues in agriculture and natural resources. Explores how the convergence of multiple forms of media – newspaper, video, radio, and photojournalism – on the internet is impacting how agricultural communicators provide information on various topics. Analyzes the field of agricultural communications and the impact technological advancements have had on content choices, media selection, and audience engagement within the field.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*COMMUNICATING GLOBAL AGRICULTURE & NATURAL RESOURCES ISSUES",
  "course_number": "AG 351",
  "credits": "3",
  "description": "Examines the interdependence between agriculture and natural resources on a global scale. Explores the best options to advance the agriculture industry to provide food for a growing population while conserving natural resources. Investigates how to best communicate their findings in a manner that is consumable and appealing to the general public.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FARM IMPLEMENTS",
  "course_number": "AG 391",
  "credits": "3",
  "description": "Power farming implements including operation, maintenance, adjustments, calibration and use are covered.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "AG 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDIES",
  "course_number": "AG 402",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "AG 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "AG 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL PROBLEMS",
  "course_number": "AG 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AG 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "AG 409",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "AG 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AG SAFETY AND HEALTH",
  "course_number": "AG 412",
  "credits": "3",
  "description": "An examination of various hazards associated with agriculture. Control strategies will be explored and prevention methods identified. Hazards examined include machinery, livestock, controlled spaces, pesticides, and other items common to the agricultural workplace.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^WRITING IN AGRICULTURE",
  "course_number": "AG 421",
  "credits": "3",
  "description": "Students will synthesize their knowledge in various areas of agricultural sciences and analyze how current issues impact the agriculture industry, explore careers in agriculture, and develop their written communication skills. Students will share their ideas and demonstrate their learning primarily in writing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DEVELOPMENTS IN AGRICULTURAL MECHANICS",
  "course_number": "AG 425",
  "credits": "3",
  "description": "Emphasis on the development of instructional units for agricultural instruction programs. Wide applications to agricultural mechanization and biotechnology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL PRESENTATIONS IN AGRICULTURE",
  "course_number": "AG 435",
  "credits": "3",
  "description": "Students will learn to effectively create and deliver professional presentations relevant to careers in agriculture and natural resources. This includes developing skills for both formal and informal presentations, using visual aids effectively, and using appropriate strategies to engage various audiences.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL MEDIA ADVOCACY IN AGRI SCIENCES & NATURAL RESOURCES",
  "course_number": "AG 445",
  "credits": "3",
  "description": "Through practice and application, students develop the ability to communicate effectively in writing using social media and other digital platforms for business purposes, including internal communication, stakeholder engagement, educational messaging, event promotion, and product marketing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*RISK AND CRISIS COMMUNICATIONS IN AG SCI & NATURAL RESOURCES",
  "course_number": "AG 455",
  "credits": "3",
  "description": "Examine potential risk and crisis communications scenarios in agriculture, natural resources and environmental sciences, plus the relevant theories, models, and processes involved in addressing these types of situations effectively. Explores the mitigation, management, and response to risks and crises from a communications perspective with special application to natural resources, along with agricultural and environmental sciences, hazardous situations through completing case studies and creating a risk and crisis communications manual.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AG SCI AND NATURAL RESOURCES COMMUNICATIONS MINOR CAPSTONE",
  "course_number": "AG 465",
  "credits": "2",
  "description": "Reflect on accumulated knowledge and technical/soft skills gained and conceptualize how to apply communication theories and practices in the context of future agricultural and natural resources careers. Integrate real-life agriculture and natural resources communications scenarios, which will allow for the practice of strategy development, proper implementation, and appropriate assessment methods. Helps package and demonstrate skills verbally and in a portfolio.",
  "prerequisites": [["AG 351"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AG 499",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AG 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "AG 509",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EXTENSION COURSE IN TEACHER EDUCATION: TECHNICAL",
  "course_number": "AG 518",
  "credits": "1-3",
  "description": "Enables present and prospective teachers of agriculture to continue their professional development on technical topics of current importance.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WRITING IN AGRICULTURE",
  "course_number": "AG 521",
  "credits": "3",
  "description": "Students will synthesize their knowledge in various areas of agricultural sciences and analyze how current issues impact the agriculture industry, explore careers in agriculture, and develop their written communication skills. Students will share their ideas and demonstrate their learning primarily in writing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DEVELOPMENTS IN AGRICULTURAL MECHANICS",
  "course_number": "AG 525",
  "credits": "3",
  "description": "Emphasis on the development of instructional units for agricultural instruction programs. Wide applications to agricultural mechanization and biotechnology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "AG 808",
  "credits": "1-4",
  "description": "Designed to enhance professionalism and create a knowledge base to increase personal effectiveness. This course will provide a basis for future leadership by synthesizing theoretical knowledge with practical application. Individuals will have the opportunity to explore their own personality, reflect on their leadership ability, and develop the professional skills and networking abilities necessary to become influential leaders in their home, community and profession.",
  "prerequisites": []
}]