[{
  "corequisites": [],
  "course_name": "INTERNSHIP/WORK EXPERIENCE",
  "course_number": "AHE 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO ADULT LEARNING",
  "course_number": "AHE 440",
  "credits": "3",
  "description": "Explores various theories and principles of development for the adult learner. Integrates various methods of understanding for how adults learn and process information. Develops a personal philosophy of adult education.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSTRUCTIONAL METHODS FOR ADULT LEARNING",
  "course_number": "AHE 445",
  "credits": "3",
  "description": "Explores instructional strategies to facilitate adult learning in higher education and workplace settings. Develops resources for instructing and evaluating adult learner experiences through observation and practice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EXPLORING LEADERSHIP IN EDUCATION",
  "course_number": "AHE 450",
  "credits": "3",
  "description": "Examines leadership and management theories often used in education and training settings, while studying values, characteristics, and challenges in the development of a philosophy and portfolio. Explores the value of diversity within leadership in education and training.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "AHE 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "AHE 502",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "AHE 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "AHE 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "AHE 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AHE 507",
  "credits": "1-5",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "AHE 508",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "AHE 510",
  "credits": "1-18",
  "description": "By special permission and arrangement.",
  "prerequisites": []
}, {
  "corequisites": [["AHE 553"]],
  "course_name": "INSTRUCTIONAL TECHNOLOGY I",
  "course_number": "AHE 522",
  "credits": "1",
  "description": "Explores technologies used in distance education to deliver content and facilitate active learning through learner creation of digital portfolios and artifacts using online tools and apps.",
  "prerequisites": []
}, {
  "corequisites": [["AHE 533"]],
  "course_name": "INSTRUCTIONAL TECHNOLOGY II",
  "course_number": "AHE 523",
  "credits": "1",
  "description": "An overview of best practices in digital-age learning design, including implementation of backward design principles.",
  "prerequisites": [["AHE 522"]]
}, {
  "corequisites": [["AHE 531"]],
  "course_name": "INSTRUCTIONAL TECHNOLOGY III",
  "course_number": "AHE 524",
  "credits": "1",
  "description": "Students will develop the knowledge and skills needed to design and create complete online teachings/courses within a learning management system.",
  "prerequisites": [["AHE 522"], ["AHE 523"]]
}, {
  "corequisites": [["AHE 547"]],
  "course_name": "INSTRUCTIONAL TECHNOLOGY IV",
  "course_number": "AHE 525",
  "credits": "1",
  "description": "Learners will research and demonstrate how to use a current innovative instructional technology, as well as develop skills in understanding trends and preparing for future innovations in instructional technology.",
  "prerequisites": [["AHE 522"], ["AHE 523"], ["AHE 524"]]
}, {
  "corequisites": [],
  "course_name": "INSTRUCTIONAL DESIGN",
  "course_number": "AHE 531",
  "credits": "4",
  "description": "Designed for instructors, trainers, managers, organizational consultants or others who are responsible for the development of programs and courses in community colleges, the workplace or other settings. Using systems concepts and methods, students will learn to design learner-centered instructional programs and courses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROGRAM EVALUATION",
  "course_number": "AHE 532",
  "credits": "4",
  "description": "Assessing outcomes in college curriculum and workplace training programs from a systems perspective and evaluation of program effectiveness. Particular emphasis on formative and summative evaluation, frameworks for program evaluation, quantitative and qualitative methods and analysis, communicating and reporting evaluation findings, and the ethics and standards of evaluation practice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NEEDS ASSESSMENT AND RESEARCH",
  "course_number": "AHE 533",
  "credits": "4",
  "description": "Introduces workplace learning needs assessment (WLNA) and research principles and practices for individual and collaborative learning groups.",
  "prerequisites": [["AHE 553"]]
}, {
  "corequisites": [],
  "course_name": "ORGANIZATIONS AND SYSTEMS THEORY",
  "course_number": "AHE 534",
  "credits": "4",
  "description": "Introduces principles and practices underlying individual and collaborative work group learning. Participants will learn how to create an environment that promotes effective and efficient workplace learning.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSTRUCTIONAL STRATEGIES FOR ADULT LEARNERS",
  "course_number": "AHE 547",
  "credits": "4",
  "description": "Exploration of and practice using instructional strategies to enhance adult learning. Acquisition of an instructional strategy tool kit as well as a method for evaluating adult learning events.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ETHICAL AND PROFESSIONAL ISSUES",
  "course_number": "AHE 549",
  "credits": "4",
  "description": "Focuses on issues facing professionals working with adult learners as well as ethical issues relevant to the practice and scholarship in the field. Combines instruction in inquiry-based teaching methods and learning theory with work in professional settings, such as for-profit and non-profit organizations and government agencies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADULT LEARNING & DEVELOPMENT",
  "course_number": "AHE 553",
  "credits": "4",
  "description": "Introduce participants to key theories, orientations, models, and principles of learning and development in adulthood.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEADERSHIP DEVELOPMENT AND HUMAN RELATIONS",
  "course_number": "AHE 567",
  "credits": "4",
  "description": "Exploration of multiple theories of leadership in different organizational contexts; synthesize theory with experience to construct a personal framework for leadership practice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EDUCATIONAL FINANCE",
  "course_number": "AHE 575",
  "credits": "3",
  "description": "Finance, budgeting and accounting for sources of revenue; deferral, state and local financing, budgeting and accounting models, practical experience combined with examination of theory, trends and issues. Focus in either public schools, community colleges or higher education through practical experience.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEGAL ISSUES IN HIGHER EDUCATION",
  "course_number": "AHE 582",
  "credits": "3",
  "description": "A comprehensive presentation and discussion of the law governing administration within community colleges and college/universities with a special emphasis on student services administration.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AHE 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "AHE 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "AHE 602",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "AHE 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "AHE 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "AHE 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AHE 607",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "AHE 608",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM CLINICAL EXPERIENCE",
  "course_number": "AHE 609",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "AHE 610",
  "credits": "1-15",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUANTITATIVE ANALYSIS IN EDUCATIONAL RESEARCH I",
  "course_number": "AHE 611",
  "credits": "3",
  "description": "Foundational course to methods and statistics used in quantitative educational research. Examines data analysis, statistical procedures, and interpretation of results within postsecondary environments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH PERSPECTIVES IN EDUCATION",
  "course_number": "AHE 612",
  "credits": "3",
  "description": "Research perspectives, how they are influenced by worldviews, and how these worldviews influence research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH ANALYSIS AND INTERPRETATION IN EDUCATION",
  "course_number": "AHE 613",
  "credits": "3",
  "description": "Critical analysis of scholarly studies in education from a variety of research perspectives.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED RESEARCH METHODS IN EDUCATION",
  "course_number": "AHE 614",
  "credits": "1-3",
  "description": "Selected topics in research methods as appropriate for research perspectives in education.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUANTITATIVE ANALYSIS IN EDUCATIONAL RESEARCH II",
  "course_number": "AHE 616",
  "credits": "3",
  "description": "Develop conceptual and practical understanding of research and evaluation in higher education. Course topics include basic statistics, survey design, data analysis, and assessment issues. As an advanced statistics course, students will have the opportunity to apply concepts and gain direct research experience by conducting an original research project.",
  "prerequisites": [["AHE 611"]]
}, {
  "corequisites": [],
  "course_name": "NEEDS ASSESSMENT IN HIGHER EDUCATION",
  "course_number": "AHE 617",
  "credits": "3",
  "description": "Explores needs assessment as an applied research tool. Addresses definitions of types of needs assessment and compares needs assessment approaches. Applies research skills in the creation, design and implementation of a pilot needs assessment project focused around educational inequities.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUALITATIVE ANALYSIS IN EDUCATIONAL RESEARCH",
  "course_number": "AHE 618",
  "credits": "3",
  "description": "Introduces learners to a variety of qualitative research perspectives and methodologies. Participants will examine these approaches by critiquing a scholarly article containing qualitative methods; formulating qualitative questions; writing a short proposal; collecting, coding, and analyzing data; and writing a final synthesis paper.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUALITATIVE ANALYSIS IN EDUCATIONAL RESEARCH II",
  "course_number": "AHE 619",
  "credits": "3",
  "description": "Focuses on the interlocking concepts of theory and data to broaden understanding and application of qualitative methodologies to improve research design and analysis from varying disciplinary approaches for the study of higher education.",
  "prerequisites": [["AHE 618"]]
}, {
  "corequisites": [],
  "course_name": "CONTEMPORARY ISSUES IN HIGHER EDUCATION",
  "course_number": "AHE 623",
  "credits": "3",
  "description": "Examines contemporary challenges facing higher education institutions and identifies connections between broader issues and problems of practice. Compares and contrasts issues and problems at different institutional types. Identifies relationships between major issues, policies, and external factors.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROGRAM EVALUATION IN HIGHER EDUCATION",
  "course_number": "AHE 630",
  "credits": "3",
  "description": "Examines program evaluation methods and frameworks used in higher education. Describes key models, theories, strategies, and underlying assumptions of evaluation practice and addresses appropriate evaluation designs. Explores the political and contextual factors that affect the practice of evaluation and effective methods for disseminating evaluation findings. Applies evaluation skills to assess efficacy and effectiveness of solutions focused on a problem of practice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "POWER AND PRIVILEGE IN LEADERSHIP",
  "course_number": "AHE 634",
  "credits": "3",
  "description": "Critically analyzes how systemic power and privilege serve to maintain/reproduce systemic inequities. Evaluates ways leadership identity is socially constructed and identifies leadership style in relation to identity. Distinguishes between academic and student affairs leadership. Analyzes leaders’ engagement with the environment and assesses critical perspectives, models, and theories that inform leadership practice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY OF HIGHER EDUCATION",
  "course_number": "AHE 638",
  "credits": "3",
  "description": "Surveys American higher education across 200-plus years of American history, with a specific emphasis in this section on the American community college.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HIGHER EDUCATION ADMINISTRATION I",
  "course_number": "AHE 640",
  "credits": "3",
  "description": "Examines the role of academic and student affairs leaders in managing effective and inclusive institutions. Explores creating equity-focused policies and practices that promote diverse and inclusive learning environments. Addresses how leaders can formulate equitable strategies to recruit, retain, and develop faculty, staff and leaders and analyzes leadership strategies for navigating institutional and environmental crises. Evaluates skills to foster productive cross-campus collaborations between units, divisions, and departments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HIGHER EDUCATION ADMINISTRATION II",
  "course_number": "AHE 641",
  "credits": "3",
  "description": "Examines the role of external relations in leading effective and inclusive higher education institutions. Identifies the relationship between leaders, various stakeholders and external constituents, and analyzes strategies for leaders to effectively communicate with the media. Describes the role and responsibilities of college and university boards. Identifies leaders’ role in fundraising and philanthropy and compares strategies for individual fundraising and project fundraising at different institutional types. Evaluates community engagement strategies for higher education leaders. Analyzes the influence of globalization and internationalization on higher education practice, policy, procedures, and programs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ORGANIZATION THEORY-HIGHER EDUCATION",
  "course_number": "AHE 643",
  "credits": "3",
  "description": "An introduction to organizational theory (OT). The texts allow us to explore how systems thinking is applied to our world, and how we can use it to better understand the nature of human social engagement. Both OT and living systems theories are deeply associated with improvement and change theories in higher education settings and business.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "POLICY ISSUES IN HIGHER EDUCATION",
  "course_number": "AHE 644",
  "credits": "3",
  "description": "Examines state and national policy issues impacting leadership in higher education. Describes contexts underlying policies impacting college access and outcomes and distinguishes theoretical approaches for higher education policymaking. Explores how leaders inform and influence policy within systems of higher education. Applies knowledge to an analysis of policy issues impacting higher education.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ETHICAL PRACTICE",
  "course_number": "AHE 645",
  "credits": "3",
  "description": "Reviews major ethical theories with an emphasis on practical applications related to community college professional practice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ORGANIZATIONAL DEVELOPMENT AND CHANGE IN HIGHER EDUCATION",
  "course_number": "AHE 648",
  "credits": "3",
  "description": "Examines the role of strategic, operational, and fiscal management and planning in leading inclusive and equitable higher education institutions. Analyzes strategies to efficiently and effectively manage institutional resources and explores the role of leaders in developing and executing strategic plans. Explains the role of leaders in supporting regional and program accreditation and compares different models of change. Identifies ways for leaders to lead proactive change and innovation. Analyzes the role of a budget manager including strategies for managing budget cuts and fluctuations. Explores elements of a budget, budget cycle, and steps for creating a budget and setting priorities.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDIVIDUAL LEVEL THEORY IN HIGHER EDUCATION",
  "course_number": "AHE 652",
  "credits": "3",
  "description": "Analyze the role of theory in conducting equity-focused higher education research. Diagram systemic inequities in higher education and evaluate individual-level theories. Compare approaches to developing theories across social science disciplines. Identify appropriate theories and theoretical concepts for use in research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO RESEARCH METHODS IN HIGHER EDUCATION",
  "course_number": "AHE 672",
  "credits": "3",
  "description": "Introduces research methodologies designed to enable students to comprehend and critically evaluate research across social science disciplines, as well as prepare them for ethical research activities. Engages with the research process, including but not limited to the importance of existing literature, the role theoretical frameworks play, and generating impactful research questions. Exposes different methodological approaches to collecting data focused mostly on quantitative and qualitative research, as well as the limitations and advantages associated with the various methods (i.e., interviews, focus groups, secondary data analysis, etc.). Explores research epistemologies and how these beliefs influence worldview and subsequent research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "AHE 699",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]