[{
  "corequisites": [],
  "course_name": "LEADERSHIP",
  "course_number": "ALS 002",
  "credits": "0",
  "description": "Provides students with basic personal and interpersonal leadership skills that can be used within and outside of a work setting. Through practice, the leadership experience help students explore motivation, decision-making, time management, power, team building, conflict, ethics, dealing with change, communication skills, and diversity issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CAMP ORIENTATION",
  "course_number": "ALS 107",
  "credits": "1-3",
  "description": "Assists students of migrant worker background to develop successful skills adaptive to the culture of higher education.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TRIO-SSS FIRST-YEAR STUDENT SUCCESS",
  "course_number": "ALS 109",
  "credits": "2",
  "description": "For TRIO-SSS students. Designed to ease their transition to college by providing technological and academic skills, as well as knowledge of resources and the information necessary to be successful students and productive citizens. Students will also learn the importance of self-reliance and the skills necessary to be self-sufficient.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CAREER DECISION MAKING",
  "course_number": "ALS 114",
  "credits": "2",
  "description": "Students will become knowledgeable about the world of work and career development theories using career assessment, literature, media, and computer resources.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACADEMIC SUCCESS",
  "course_number": "ALS 116",
  "credits": "2",
  "description": "Assessment and development of strategies for succeeding in university-level academics. Topics include time management, goal setting, critical thinking, note taking, and study skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WELCOME TO OSU: INTERNATIONAL FIRST YEAR EXPERIENCE",
  "course_number": "ALS 139",
  "credits": "3",
  "description": "A university integration class specifically designed for new students at Oregon State University. Explore topics such as academic integrity, working with academic advisors, U.S. academic culture, navigating campus resources, communicating with professors, and integrating into the campus community.",
  "prerequisites": []
}, {
  "corequisites": ["ALS 181"],
  "course_name": "INTRODUCTION TO UNIVERSITY READING AND WRITING",
  "course_number": "ALS 140",
  "credits": "3",
  "description": "Students will strengthen their ability to comprehend and analyze a variety of texts. They will also improve the unity and coherence of their writing as well as develop techniques for writing in an academic setting. Students will focus on strategic reading and content analysis; comparing and contrasting ideas; considering different points of view; and linking cause and effect relationships. In addition, students will be introduced to concepts regarding academic accountability and using outside sources in their writing.",
  "prerequisites": []
}, {
  "corequisites": ["ALS 181"],
  "course_name": "INTRODUCTION TO UNIVERSITY LISTENING AND SPEAKING",
  "course_number": "ALS 141",
  "credits": "3",
  "description": "Students will improve their ability to understand main ideas, important details, and implied meanings of authentic academic speech. They will listen to audio and video lectures, participate in in-class discussions, improve their note-taking skills, and conduct basic research that they will present in formal and informal in-class presentations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BUILDING STRATEGIES FOR GRADUATE SUCCESS",
  "course_number": "ALS 145",
  "credits": "3",
  "description": "Provides international graduate students with cultural and academic support to supplement other content-based and language-focused courses. Emphasizes skills for graduate student success such as time management, group work, planning, professional development, and effective communication. Surveys campus resources.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTO OSU ACADEMIC READING AND WRITING 5",
  "course_number": "ALS 150",
  "credits": "3",
  "description": "Designed to provide international and/or immigrant students substantive practice in reading and writing English at the advanced level. Read, understand and discuss a variety of academic readings from the natural and physical sciences, the social sciences, the humanities and literature. Work on reading skills; vocabulary acquisition; library and research skills; paraphrasing and summarizing; and the organization, style and development of essays.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTO OSU ACADEMIC LISTENING AND SPEAKING 5",
  "course_number": "ALS 151",
  "credits": "3",
  "description": "Skill building to develop and improve comprehension and notetaking of lectures in an academic format. Students required to give individual and group presentations including informational, argumentative, and persuasive presentations. Instruction is given in cross-cultural communications styles, non-verbal communication, questioning techniques, and clarifying information.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LECTURE AND PRESENTATION METHODS FOR INTERNATIONAL STUDENTS",
  "course_number": "ALS 161",
  "credits": "3",
  "description": "Develop and improve comprehension and notetaking of lectures in an academic format. Give individual and group presentations. Develop skills in cross-cultural communication styles, non-verbal communication, questioning techniques, and clarifying information.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED ACADEMIC WRITING FOR INTERNATIONAL STUDENTS",
  "course_number": "ALS 162",
  "credits": "3",
  "description": "University reading and writing skills for international students. Comprehension of advanced authentic academic texts, including full-length academic articles on a variety of topics. Production of written texts that develop arguments systematically, synthesize and integrate information from multiple sources, underline relevant salient issues, and expand and support opinions on a range of advanced academic topics. Academic reading, and writing strategies.",
  "prerequisites": ["ALS 150"]
}, {
  "corequisites": [],
  "course_name": "TECHNICAL COMMUNICATION FOR INTERNATIONAL GRADUATE STUDENTS",
  "course_number": "ALS 165",
  "credits": "3",
  "description": "Helps students develop comprehension of university-level academic material, engage in classroom discussions, and make academic presentations. Comprehension topics include note-taking skills and understanding organizational structures and signals used by university academic lecturers and discussions in STEM-related fields. Presentation skill development activities prepare students for COMM 111Z and COMM 218Z, focusing on incorporating outside research from library sources (such as academic journals, newspapers, magazines, and textbooks) and working together with other students. Emphasis on group participation, equal sharing of group projects, self-evaluation, and critiques of the presentation styles of peers and lecturers.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WRITING/RESEARCH METHODS FOR INTERNATIONAL GRADUATE STUDENTS",
  "course_number": "ALS 166",
  "credits": "3",
  "description": "Emphasizes reading and writing skills required for graduate-level STEM majors at the university, focusing on a wide range of reading skills and strategies that include critically analyzing academic journal articles, synthesizing ideas, vocabulary expansion, and vocabulary acquisition skills. Reading and vocabulary study are centered on a range of STEM fields and student interests. Written work focuses on writing critical reactions to readings through synthesizing multiple sources and developing coherent arguments. Students develop skills of summarizing, paraphrasing, utilizing appropriate grammar, customizing their writing style to their audience, and increasing familiarization with library and online resources.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL WRITING FOR GRADUATE BUSINESS STUDENTS",
  "course_number": "ALS 174",
  "credits": "3",
  "description": "Emphasizes development of reading, writing and critical thinking skills needed for progression into the MBA program. Written work focuses on writing critical reactions to readings, summarizing, paraphrasing and synthesizing information and increasing familiarization with library and online resources. Additionally, the course gives attention to a range of reading skills and strategies, including vocabulary expansion and vocabulary acquisition skills. Students will develop business vocabulary and knowledge of key business concepts by reading and analyzing real-world business case studies and writing case briefs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL WRITING FOR INTERNATIONAL GRADUATE STUDENTS",
  "course_number": "ALS 176",
  "credits": "3",
  "description": "Emphasizes reading, writing and critical thinking skills required for success in graduate STEM classes. Written work focuses on writing about in-class experiments that replicate real-world procedures in STEM fields. Develops summary skills, with an emphasis on technical report writing, and develops skills in writing about procedures and recommendations. Focuses on improving reading comprehension of authentic STEM texts found in reports, articles and published papers. Students will develop skills in using STEM-focused online databases. Finally, teamwork and revision are essential components of the course.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTO OSU ESL BRIDGE",
  "course_number": "ALS 181",
  "credits": "2",
  "description": "This course acts as a \"bridge\" for international students enrolled in specific OSU courses. It supports the understanding of OSU course assignments and vocabulary, and helps to build language skills needed to fulfill assignments. Classroom activities include, but are not limited to, discussions, in-class exercises, vocabulary games and exercises, and work in Canvas.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BEST ORIENTATION",
  "course_number": "ALS 190",
  "credits": "1-5",
  "description": "Focuses on study skills, time management and college success strategies specifically targeted to improve the academic performance of first-year student athletes at Oregon State University. Covers study strategies, time management, note taking, test preparation, critical reading, OSU’s campus resources, and online learning platforms. Students practice these skills in an accompanying baccalaureate core class. Provides first-year student athletes with a summer introduction to college along with strategies for balancing athletics and academics at the Division I level.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "UNIVERSITY EXPLORATORY STUDIES PGM FIRST-YEAR TRANSITIONS",
  "course_number": "ALS 191",
  "credits": "2",
  "description": "Provides support to new first-year University Exploratory Studies Program (UESP) students in their transition to the university and explores foundational experiences and resources to support academic and personal exploration at OSU. Examines tools to identify personal strengths, values, interests and preferences, and resources to reflect on how these elements correspond to the various academic pathways at the university.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ALS 199",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ALS 199H",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HOW TO BE SUCCESSFUL IN YOUR INTERNSHIP SEARCH",
  "course_number": "ALS 210",
  "credits": "2",
  "description": "Internship preparation course designed to provide students with the fundamental tools to find and secure an internship. Topics will include internship search strategies, resumes, cover letters, and interviewing. Guest speakers will provide additional insight into these topics from the perspective of employers and students with prior internship experience. Reflection on student's interests, values, and goals will also be integrated into the course.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ALS 299",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}]