[{
  "corequisites": [],
  "course_name": "TOPICS IN AMERICAN STUDIES",
  "course_number": "AMS 311",
  "credits": "4",
  "description": "Selected topics, changed annually, that investigate American ideas, regions, events, or periods. Fulfills the requirement for an integrated course in the major. May be repeated as topics vary. Open to nonmajors.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*AMERICAN CULTURE AND THE VIETNAM EXPERIENCE",
  "course_number": "AMS 350",
  "credits": "4",
  "description": "Examines through literature, film, and popular media the effects of the Vietnam War on American culture. Taught at OSU-Cascades only. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "AMS 405",
  "credits": "1-16",
  "description": "Independent, individual studies supervised by the director, members of the American Studies Board, or assigned professors, as arranged by the student and the director.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "AMS 406",
  "credits": "1-16",
  "description": "Studies of American culture and society centered around topical events or cultural programs of current interest in American studies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AMERICAN STUDIES INTERNSHIP",
  "course_number": "AMS 410",
  "credits": "1-16",
  "description": "Supervised and evaluated work in a variety of professional fields to enhance students' career preparation; arranged at the initiative of the student one semester in advance.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRAGMATISM IN AMERICAN CULTURE",
  "course_number": "AMS 450",
  "credits": "4",
  "description": "Explores origins and continuing importance of the American tradition of pragmatist thought in American culture and transnationally. Introduces major figures who anticipate pragmatism, its founding generation, and contemporary paths of pragmatism. Explores the relation between pragmatism and democracy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "AMS 507",
  "credits": "1-16",
  "description": "CROSSLISTED as AMS 507/ENG 507.",
  "prerequisites": []
}]