[{
  "corequisites": [],
  "course_name": "ORIENTATION TO ANIMAL AND RANGELAND SCIENCES",
  "course_number": "ANS 100",
  "credits": "1",
  "description": "Designed to provide incoming Animal and Rangeland Sciences students an introduction to college life at OSU with an emphasis on the faculty, facilities, services, and the curricula of the Department of Animal and Rangeland Sciences.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO ANIMAL SCIENCES",
  "course_number": "ANS 121",
  "credits": "4",
  "description": "Principles of breeding, physiology, nutrition, and management as they apply to modern livestock and poultry production.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO ANIMAL SCIENCES",
  "course_number": "ANS 121H",
  "credits": "4",
  "description": "Principles of breeding, physiology, nutrition, and management as they apply to modern livestock and poultry production.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOPHOMORE SEMINAR",
  "course_number": "ANS 207",
  "credits": "2",
  "description": "Examination of career opportunities in animal sciences.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BEEF/DAIRY INDUSTRIES",
  "course_number": "ANS 215",
  "credits": "3",
  "description": "Introduction to beef and dairy industries; history, current industry status, and demonstration and practice of basic husbandry skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SMALL RUMINANT/SWINE INDUSTRIES",
  "course_number": "ANS 216",
  "credits": "3",
  "description": "Introduction to the small ruminant and swine industries including history, current status and production practices, with demonstration and hands-on experience of basic husbandry practices.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY HORSE SCIENCE",
  "course_number": "ANS 220",
  "credits": "3",
  "description": "Introduction to horses, their history, breeds, form and function, performance evaluation, current industry status, and general management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LIVESTOCK EVALUATION",
  "course_number": "ANS 231",
  "credits": "3",
  "description": "Focuses on an individual animal's economic merit as compared to a sample group. Visual appraisal, performance data, and carcass merit are stressed. Includes the evaluation of both market and breeding animals. The livestock species of concentration include beef cattle, swine, sheep, and meat goats.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF ANIMAL FOODS TECHNOLOGY",
  "course_number": "ANS 251",
  "credits": "3",
  "description": "Processing of meat, milk and eggs into human food products.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPANION ANIMAL MANAGEMENT",
  "course_number": "ANS 280",
  "credits": "4",
  "description": "An introduction to the challenges, responsibilities, and benefits of interaction with selected companion animals. Topics covered will provide an overview of the human-animal bond, the position of companion animals in society, ethical issues of pet ownership and potential career opportunities. In addition, the course will serve as an introduction to preventive care and normal behavior of dogs, cats, and selected exotic pets. As the Department of Animal and Rangeland Sciences curriculum offers courses addressing equine care and husbandry, horses will not be discussed in this class.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ANS 299",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMON DISEASES OF COMPANION ANIMALS",
  "course_number": "ANS 302",
  "credits": "4",
  "description": "An introduction to common diseases of selected companion animals. Emphasis will be placed on identifying predisposing factors, clinical signs, common diagnostic procedures and potential implications for human health.",
  "prerequisites": [["BI 211", "BI 211H"], ["BI 212", "BI 212H"], ["BI 213", "BI 213H", "BI 221", "BI 221H"], ["BI 222", "BI 222H"], ["BI 223", "BI 223H"], ["CH 121"], ["CH 122"], ["CH 123"]]
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF ANIMAL NUTRITION",
  "course_number": "ANS 311",
  "credits": "3",
  "description": "Classification, digestion, absorption, and metabolism of nutrients in animals; consequences of nutritional deficiencies and toxicities.",
  "prerequisites": [["BI 211", "BI 211H"], ["BI 212", "BI 212H", "BI 221", "BI 221H"], ["BI 222", "BI 222H"], ["BI 223", "BI 223H"]]
}, {
  "corequisites": [],
  "course_name": "APPLIED ANIMAL NUTRITION: FEEDS AND RATION FORMULATION",
  "course_number": "ANS 313",
  "credits": "4",
  "description": "Discusses topics relevant to feedstuff identification and nutrient analysis, feed processing and formulation of balanced animal diets based on nutrient requirements. Provides students hands-on experiences in identifying various feedstuffs and formulating rations based on the nutrient composition of those feedstuffs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ANIMAL PHYSIOLOGY",
  "course_number": "ANS 314",
  "credits": "4",
  "description": "Biological basis of animal performance; describes how networks of cells act cooperatively to enable locomotion, provide a stable internal environment, allocate resources, remove metabolic end-products, and counteract microorganisms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*CONTENTIOUS SOCIAL ISSUES IN ANIMAL AGRICULTURE",
  "course_number": "ANS 315",
  "credits": "3",
  "description": "Discussion of contentious issues including role of animal products and human health; use of hormones and antibiotics; new animal biotechnologies; animal rights/welfare; livestock grazing on public lands.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "REPRODUCTION IN DOMESTIC ANIMALS",
  "course_number": "ANS 316",
  "credits": "4",
  "description": "Anatomy and physiology of mammalian and avian reproductive systems; fertilization, embryonic and fetal development, placentation and parturition; reproductive technologies.",
  "prerequisites": [["BI 211", "BI 211H", "BI 221", "BI 221H"], ["BI 222", "BI 222H"], ["BI 223", "BI 223H"], ["CH 121", "CH 221", "CH 231", "CH 231H"]]
}, {
  "corequisites": [],
  "course_name": "REPRODUCTION IN DOMESTIC ANIMALS LABORATORY",
  "course_number": "ANS 317",
  "credits": "1",
  "description": "Gross and microscopic anatomy of the reproductive tract; semen collection, evaluation and extension; evaluation of fertilization, embryo and fetal development and placentation.",
  "prerequisites": [["ANS 316"]]
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF COMPANION ANIMAL NUTRITION",
  "course_number": "ANS 320",
  "credits": "3",
  "description": "Learn about nutrients, the digestive process, and the application of nutritional sciences to the health and welfare of companion animals. Introduction to the metabolic basis and practical preventative management for nutritional diseases in companion animals.",
  "prerequisites": [["BI 211", "BI 211H"], ["BI 212", "BI 212H", "BI 221", "BI 221H"], ["BI 222", "BI 222H"], ["BI 223", "BI 223H"]]
}, {
  "corequisites": [],
  "course_name": "EQUINE STABLE MANAGEMENT",
  "course_number": "ANS 333",
  "credits": "3",
  "description": "Discusses developing a business plan, financial statements, and ratios, budgeting, financial planning, taxation, and employment issues within the current equine industry.",
  "prerequisites": [["ANS 220"]]
}, {
  "corequisites": [],
  "course_name": "EQUINE HEALTH AND DISEASE",
  "course_number": "ANS 335",
  "credits": "3",
  "description": "Recognition of common diseases and disorders including their cause, treatment and prevention. Management of internal and external parasites. Recognizing common lameness issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ANIMAL BEHAVIOR AND COGNITION",
  "course_number": "ANS 341",
  "credits": "3",
  "description": "Survey, discuss, and explore principles of animal behavior and cognition from a comparative perspective, taking into account the interacting influences of biology, environment, and life experience on the individual and group behavior of animals across species. Aspects of animal cognition, including reasoning, perception, memory and personality, that play an important role in animal behavior will also be addressed.",
  "prerequisites": [["BI 102", "BI 213", "BI 213H", "BI 221", "BI 221H"], ["BI 222", "BI 222H"], ["BI 223", "BI 223H"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED PRINCIPLES OF ANIMAL FOODS TECHNOLOGY",
  "course_number": "ANS 351",
  "credits": "4",
  "description": "Provides in-depth coverage of both fresh and processed meats and eggs into products suitable for human consumption.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ANIMAL GENETICS",
  "course_number": "ANS 378",
  "credits": "4",
  "description": "Fundamentals of inheritance, principles of genetic segregation, population and quantitative genetics, response to natural selection and artificial manipulation of populations.",
  "prerequisites": [["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H"]]
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF ANIMAL ANATOMY AND PHYSIOLOGY",
  "course_number": "ANS 380",
  "credits": "3",
  "description": "An introductory course in animal anatomy to provide a foundation for advanced courses in the Animal Science curriculum. Emphasis is on acquisition of a basic knowledge of minute and gross anatomical structures, their operation, and integration. Begins with anatomical nomenclature such as body planes and directional terms then covers the following tissues and organ systems: epithelium, connective tissue, blood and bone marrow, bone/cartilage, muscle tissue, nervous tissue, digestive system, circulatory system, reproductive system, urinary system, and respiratory system.",
  "prerequisites": [["BI 211", "BI 211H"], ["BI 212", "BI 212H"], ["BI 213", "BI 213H", "BI 221", "BI 221H"], ["BI 222", "BI 222H"], ["BI 223", "BI 223H"]]
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF MAMMALIAN HISTOLOGY",
  "course_number": "ANS 385",
  "credits": "4",
  "description": "Provides a basic knowledge of mammalian microscopic anatomy. Emphasizes the appearance, organization and function of minute anatomical structures that can only be observed with the help of a visual enhancer, such as a microscope. Topics include basic histological techniques and histology and related functions of the following tissues and organ systems: epithelium, connective tissue, bone/cartilage, blood, muscle tissue, nervous tissue, circulatory system, digestive system, reproductive system, urinary system, respiratory system, immune system, integument, eye and ear. Covers gametogenesis, fertilization, and early development of the vertebrate embryo.",
  "prerequisites": [["BI 211", "BI 211H"], ["BI 212", "BI 212H"], ["BI 213", "BI 213H", "BI 221", "BI 221H"], ["BI 222", "BI 222H"], ["BI 223", "BI 223H"], ["BB 314", "BB 314H"], ["ANS 380"]]
}, {
  "corequisites": [],
  "course_name": "GROSS ANATOMY OF DOMESTIC ANIMALS",
  "course_number": "ANS 390",
  "credits": "4",
  "description": "Provides a foundation for advanced courses in animal science. Emphasizes mammalian anatomy, including anatomical nomenclature, structure, operation, and integration of major organ systems. Uses the dog as a general model while some comparative domestic animal anatomy will also be covered.",
  "prerequisites": [["BI 211", "BI 211H"], ["BI 212", "BI 212H"], ["BI 213", "BI 213H", "BI 221", "BI 221H"], ["BI 222", "BI 222H"], ["BI 223", "BI 223H"], ["ANS 380"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ANS 399",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "ANS 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "ANS 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "ANS 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "ANS 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ANIMAL SCIENCE INTERNSHIP",
  "course_number": "ANS 410",
  "credits": "1-12",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^ETHICAL ISSUES IN ANIMAL AGRICULTURE",
  "course_number": "ANS 420",
  "credits": "3",
  "description": "Provides an opportunity to discuss, debate and write extensively about current, relevant, and controversial social issues dealing with modern animal agriculture.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED PHYSIOLOGY OF REPRODUCTION",
  "course_number": "ANS 427",
  "credits": "5",
  "description": "Principles, techniques and recent development in semen collection, evaluation, extension and preservation; artificial insemination, estrus detection and synchronization; pregnancy diagnosis and embryo transfer.",
  "prerequisites": [["ANS 316"], ["ANS 317"]]
}, {
  "corequisites": [],
  "course_name": "EQUINE SYSTEMS I: EXERCISE SCIENCE",
  "course_number": "ANS 430",
  "credits": "4",
  "description": "Intensively explore and apply science to real-life situations regarding cardiorespiratory, muscle physiology, and bone physiology responses to exercise, climate, and altitude.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED EQUINE NUTRITION",
  "course_number": "ANS 431",
  "credits": "4",
  "description": "Applies science and learning appropriate techniques to feed horses in different physiological states to promote health and well-being. Covers metabolic disorders and the consequences of incorrect feeding.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EQUINE SYSTEMS III: REPRODUCTION",
  "course_number": "ANS 432",
  "credits": "4",
  "description": "Senior and graduate students explore the fundamentals of equine reproduction and their application in horse breeding. Includes practical training of laboratory techniques.",
  "prerequisites": [["ANS 220"], ["ANS 316"]]
}, {
  "corequisites": [],
  "course_name": "APPLIED ANIMAL BEHAVIOR",
  "course_number": "ANS 435",
  "credits": "3",
  "description": "Exploration of the fundamental processes of animal behavior and implications for animal management, production, housing and welfare. Covers a range of species, with emphasis on domestic animals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SHEEP PRODUCTION SYSTEMS",
  "course_number": "ANS 436",
  "credits": "3",
  "description": "Integration of nutrition, genetics, reproduction, behavior, and health principles into management systems for production and marketing of lamb and wool.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DAIRY PRODUCTION SYSTEMS",
  "course_number": "ANS 439",
  "credits": "4",
  "description": "Fundamentals of nutrition, breeding, reproductive physiology and health programs and their applications in the care and management of dairy cattle.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED DAIRY MANAGEMENT",
  "course_number": "ANS 440",
  "credits": "3",
  "description": "Focuses on knowledge and techniques for diagnosis of common diseases, preventative management, and therapeutic care necessary for a dairy herdsman position. Emphasizes hands-on instruction in basic calf, heifer, lactating and dry cow care. Discusses and practices essential management techniques including those relating to cattle handling, reproduction, hoof health, calf care as well as instruction in understanding and utilizing cow monitoring systems and records.",
  "prerequisites": [["ANS 439"]]
}, {
  "corequisites": [],
  "course_name": "TOPICS IN ANIMAL LEARNING",
  "course_number": "ANS 441",
  "credits": "3",
  "description": "Explore when and how the behavior of animals can be shaped by the environment, individual experiences, and interactions with other animals (including humans).",
  "prerequisites": [["BI 211", "BI 211H"], ["BI 212", "BI 212H", "BI 221", "BI 221H"], ["BI 222", "BI 222H"], ["BI 223", "BI 223H"]]
}, {
  "corequisites": [],
  "course_name": "BEEF PRODUCTION SYSTEMS",
  "course_number": "ANS 445",
  "credits": "4",
  "description": "Students will be exposed to the fundamentals of nutrition, reproductive physiology, selection, health programs, and their applications in the care and management of beef cattle from conception through calving, weaning, stocker/back grounding and the feedlot. Students will practice decision-making processes using working case studies. Overnight field trip with extra fee charged.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRAZING LIVESTOCK PRODUCTION",
  "course_number": "ANS 446",
  "credits": "4",
  "description": "Equips non-animal science majors with basic ruminant livestock (beef cattle, sheep and meat goat) production knowledge, so they may communicate and collaborate effectively with livestock producers.",
  "prerequisites": [["ANS 121", "ANS 121H"]]
}, {
  "corequisites": [],
  "course_name": "LIVESTOCK PRODUCTION ON PASTURE",
  "course_number": "ANS 448",
  "credits": "4",
  "description": "Focuses on grazing management in cultivated pastures in Oregon and other regions with similar agro-ecological conditions. Become familiar with the basic principles of pasture production, grazing management and feed planning and management in large and small ruminant production systems. Provides information on the underlying factors affecting pasture and animal production and product quality in pasture-based production systems. CROSSLISTED as ANS 448/CROP 448/RNG 448.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LIVESTOCK HOUSING AND WASTE MANAGEMENT",
  "course_number": "ANS 452",
  "credits": "3",
  "description": "Basics in where, how, and why one would build, insulate, and ventilate livestock buildings. Manure and wastewater collection, treatment, storage, and utilization.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPANION ANIMAL PRODUCTION SYSTEMS",
  "course_number": "ANS 456",
  "credits": "3",
  "description": "Fundamentals of dog and cat breeding stock selection, feeding and housing as well as biology and management from estrus through parturition to weaning. Due to the nature of this class, a variety of animals may be present during class session. Questions and interactions are encouraged but, while precautions are taken, any contact with animals carries some risk of injury or illness.",
  "prerequisites": [["ANS 313"], ["ANS 316"], ["ANS 317"], ["ANS 378"]]
}, {
  "corequisites": [],
  "course_name": "SWINE PRODUCTION SYSTEMS",
  "course_number": "ANS 460",
  "credits": "4",
  "description": "Students will be exposed to the fundamentals of nutrition, reproductive physiology, selection, health programs, and their applications in the care and management of swine from conception through farrowing, weaning, and the growing/finishing phases. Students will practice decision-making processes using working case studies. Overnight field trip with extra fee charged.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ANS 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "ANS 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "ANS 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "ANS 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRADUATE SEMINAR",
  "course_number": "ANS 507",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "ANS 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEACHING PRACTICUM",
  "course_number": "ANS 509",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DIGESTIVE PHYSIOLOGY AND NUTRITION OF RUMINANT ANIMALS",
  "course_number": "ANS 511",
  "credits": "4",
  "description": "Anatomy and physiology of the ruminant digestive tract including rumen microbiology and digestive processes. Nutritional biochemistry and physiology of ruminants. Feed chemistry, feed intake and principles of ration balancing. Theory of energy and protein metabolism.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EQUINE SYSTEMS I: EXERCISE SCIENCE",
  "course_number": "ANS 530",
  "credits": "4",
  "description": "Intensively explore and apply science to real-life situations regarding cardiorespiratory, muscle physiology, and bone physiology responses to exercise, climate, and altitude.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED EQUINE NUTRITION",
  "course_number": "ANS 531",
  "credits": "4",
  "description": "Applies science and learning appropriate techniques to feed horses in different physiological states to promote health and well-being. Covers metabolic disorders and the consequences of incorrect feeding.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EQUINE SYSTEMS III: REPRODUCTION",
  "course_number": "ANS 532",
  "credits": "4",
  "description": "Designed for seniors and graduate students to explore the fundamentals of equine reproduction and their application in horse breeding. Includes practical training in laboratory techniques.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED ANIMAL BEHAVIOR",
  "course_number": "ANS 535",
  "credits": "3",
  "description": "Exploration of the fundamental processes of animal behavior and implications for animal management, production, housing and welfare. Covers a range of species, with emphasis on domestic animals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SHEEP PRODUCTION SYSTEMS",
  "course_number": "ANS 536",
  "credits": "3",
  "description": "Integration of nutrition, genetics, reproduction, behavior, and health principles into management systems for production and marketing of lamb and wool.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BIOLOGY OF LACTATION",
  "course_number": "ANS 538",
  "credits": "3",
  "description": "Physiological and environmental factors affecting mammary gland development and function. Offered alternate years.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DAIRY PRODUCTION SYSTEMS",
  "course_number": "ANS 539",
  "credits": "4",
  "description": "Fundamentals of nutrition, breeding, reproductive physiology and health programs and their applications in the care and management of dairy cattle.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DAIRY PRODUCTION SYSTEMS",
  "course_number": "ANS 540",
  "credits": "3",
  "description": "Decision case analysis or special topics in application of dairy management principles.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TOPICS IN ANIMAL LEARNING",
  "course_number": "ANS 541",
  "credits": "3",
  "description": "Explore when and how the behavior of animals can be shaped by the environment, individual experiences, and interactions with other animals (including humans).",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BEEF PRODUCTION SYSTEMS",
  "course_number": "ANS 545",
  "credits": "4",
  "description": "Students will be exposed to the fundamentals of nutrition, reproductive physiology, selection, health programs, and their applications in the care and management of beef cattle from conception through calving, weaning, stocker/back grounding and the feedlot. Students will practice decision-making processes using working case studies. Overnight field trip with extra fee charged.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LIVESTOCK PRODUCTION ON PASTURE",
  "course_number": "ANS 548",
  "credits": "4",
  "description": "Focuses on grazing management in cultivated pastures in Oregon and other regions with similar agro-ecological conditions. Become familiar with the basic principles of pasture production, grazing management and feed planning and management in large and small ruminant production systems. Provides information on the underlying factors affecting pasture and animal production and product quality in pasture-based production systems. CROSSLISTED as ANS 548/RNG 548.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ORGANIC ANIMAL PRODUCTION SYSTEMS",
  "course_number": "ANS 550",
  "credits": "3",
  "description": "Topics include the principles of livestock production, legislation, animal welfare, and marketing of organic production systems. Course emphasizes principles, concepts, and techniques of organic and sustainable production of animals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPANION ANIMAL PRODUCTION SYSTEMS",
  "course_number": "ANS 556",
  "credits": "3",
  "description": "Fundamentals of dog and cat breeding stock selection, feeding and housing as well as biology and management from estrus through parturition to weaning. Due to the nature of this class, a variety of animals may be present during class session. Questions and interactions are encouraged but, while precautions are taken, any contact with animals carries some risk of injury or illness.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LIPID METABOLISM",
  "course_number": "ANS 560",
  "credits": "3",
  "description": "Digestion, absorption and metabolism of lipids with emphasis on lipoprotein metabolism, regulation of lipid metabolism in various tissues and metabolism of eicosanoids.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ANS 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "ANS 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "ANS 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "ANS 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "ANS 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRADUATE SEMINAR",
  "course_number": "ANS 607",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "ANS 608",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEACHING PRACTICUM",
  "course_number": "ANS 609",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HORMONE ACTION",
  "course_number": "ANS 662",
  "credits": "3",
  "description": "Mechanisms of action of peptide and steroid hormones and related compounds at the cellular level.",
  "prerequisites": [["BB 551", "BB 592"]]
}, {
  "corequisites": [],
  "course_name": "BIOLOGY OF MAMMALIAN REPRODUCTION",
  "course_number": "ANS 673",
  "credits": "4",
  "description": "Physiological, neuroendocrine, endocrine and environmental factors that regulate reproduction of mammals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ANS 699",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]