[{
  "corequisites": [],
  "course_name": "UNDERGRADUATE RESEARCH",
  "course_number": "ART 003",
  "credits": "0",
  "description": "Engage in research activities appropriate to the discipline; and through the research experience, acquire skills, techniques, and knowledge relevant to the field of study. In consultation with a faculty mentor, engage in research activity, and make and execute a plan for a project.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ART ORIENTATION",
  "course_number": "ART 100",
  "credits": "2",
  "description": "Provides an introduction to the art resources and visual art faculty at Oregon State University. Explores artistic concepts and processes using a variety of art techniques. Introduces studio practices of working artists and how they explore issues in their field.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO THE VISUAL ARTS",
  "course_number": "ART 101",
  "credits": "3",
  "description": "An introductory lecture course using visual materials with emphasis on methods and motivations that generate the visual experience, both past and present.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "2-D CORE STUDIO",
  "course_number": "ART 115",
  "credits": "4",
  "description": "Studio course that introduces the visual language, the elements of design, and the principles of organization. Emphasizes skills, concepts, and problem solving in the areas of two-dimensional design and color.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "3-D CORE STUDIO",
  "course_number": "ART 117",
  "credits": "4",
  "description": "Studio course examining three-dimensional design elements and their spatial organization. Emphasizes innovative problem solving and exposure to varied media. Gives students a sound conceptual basis to apply to more advanced media-oriented courses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DIGITAL CORE STUDIO",
  "course_number": "ART 121",
  "credits": "4",
  "description": "An introductory studio art class using computers in the visual arts. Project-based exploration of digital imaging, layout, 3-D rendering, and video. Examination of the impact of digital technology on the visual arts from contemporary and historical perspectives.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRAWING CORE STUDIO",
  "course_number": "ART 131",
  "credits": "4",
  "description": "Introductory studio course in drawing techniques with emphasis on developing skills in perception and visual organization.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "ART 199",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO WESTERN ART: PREHISTORY TO HIGH MIDDLE AGES",
  "course_number": "ART 204",
  "credits": "3",
  "description": "A survey of the painting, sculpture, architecture, and decorative arts of Europe and the Mediterranean between the Paleolithic period and the eleventh century.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO WESTERN ART: GOTHIC TO BAROQUE",
  "course_number": "ART 205",
  "credits": "3",
  "description": "A survey of the painting, sculpture, architecture, and decorative arts of Europe between the late Middle Ages and the seventeenth century.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO WESTERN ART: NEOCLASSICISM TO CONTEMPORARY",
  "course_number": "ART 206",
  "credits": "3",
  "description": "A survey of painting, sculpture and other visual arts in the Western world from the late eighteenth century to the present.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO ASIAN ART",
  "course_number": "ART 208",
  "credits": "3",
  "description": "Introduces the distinctive, yet related, aesthetic traditions of South and Southeast Asia, Inner Asia, and East Asia. It focuses on architectural sites, sculptures, and paintings from prehistory to the present.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*HISTORY OF WESTERN ARCHITECTURE",
  "course_number": "ART 210",
  "credits": "3",
  "description": "A survey of buildings and architectural thought in the West from antiquity to the twentieth century; focuses on major periods and movements of architectural history by examining building types, patrons, materials, building traditions, structural innovations and other critical aspects inherent to architecture.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COLOR IN THE VISUAL ARTS",
  "course_number": "ART 215",
  "credits": "4",
  "description": "Studio course following ART 115 and ART 117 that examines the properties of colors and their interaction. Emphasizes problem solving and the experimental use of color.",
  "prerequisites": ["ART 115"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO TIME-BASED ART",
  "course_number": "ART 222",
  "credits": "4",
  "description": "Introduction to time-based media using the computer as a tool. Studio art class developing skills in video art, sound art, performance, and other time-based digital arts. Exploration of sequential, experimental, historical, and contemporary themes and the role of the audience in time-based art.",
  "prerequisites": ["ART 121"]
}, {
  "corequisites": [],
  "course_name": "DRAWING II: FIGURE",
  "course_number": "ART 234",
  "credits": "4",
  "description": "Drawing from the life model with emphasis on skill and conceptual awareness as well as anatomical consideration.",
  "prerequisites": ["ART 131"]
}, {
  "corequisites": [],
  "course_name": "DIGITAL PHOTOGRAPHY",
  "course_number": "ART 263",
  "credits": "4",
  "description": "Introductory course in digital photography. Focus on creation of photographic images in series format. Technical camera operation will be emphasized as well as basic photographic composition, use of photographic editing software, historical grounding, and discussions of contemporary issues in photography. Students must have the use of a digital single lens reflex camera (DSLR) or mirrorless camera (with viewfinder and fully manual controls).",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PHOTOGRAPHY: HISTORY",
  "course_number": "ART 264",
  "credits": "TECHNOLOGY",
  "description": "Introduction to the history of photography through aesthetic, cultural and technical contexts. This course covers the history of photography and its technologies, photography in art, some photographers and their photographs and the purposes of photography.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRINTMAKING I",
  "course_number": "ART 271",
  "credits": "4",
  "description": "Introduction to the basic processes of printmaking, with options among relief, lithography, intaglio, screen printing and monotype.",
  "prerequisites": ["ART 115", "ART 131"]
}, {
  "corequisites": [],
  "course_name": "PAINTING I",
  "course_number": "ART 281",
  "credits": "4",
  "description": "Introductory studio course with emphasis on basic materials and techniques in painting.",
  "prerequisites": ["ART 131"]
}, {
  "corequisites": [],
  "course_name": "SCULPTURE I",
  "course_number": "ART 291",
  "credits": "4",
  "description": "Studio course in basic materials and approaches used in sculpture; a foundation for further three-dimensional work.",
  "prerequisites": ["ART 117"]
}, {
  "corequisites": [],
  "course_name": "ADVISOR REVIEW",
  "course_number": "ART 306",
  "credits": "1",
  "description": "A review, conducted by the student's advisor and another faculty member of the student's choosing, of work produced to date in the student's area of concentration.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*EARLY CHINESE ART AND ARCHAEOLOGY",
  "course_number": "ART 310",
  "credits": "3",
  "description": "Introduces major forms of Chinese art from the Neolithic period to the Tang dynasty (618-907 CE) and related major archaeological finds. Stresses the materials and processes of making art, development of representational art, and the role of visual arts in an aristocratic and religious culture.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*LATE CHINESE ART AND CULTURE",
  "course_number": "ART 311",
  "credits": "3",
  "description": "Introduction to the major forms of Chinese art and visual culture from the eleventh century to the early twentieth century.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*CONTEMPORARY CHINESE ART",
  "course_number": "ART 312",
  "credits": "3",
  "description": "Introduces origins and development of contemporary Chinese art and visual culture in its domestic and global contexts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ART OF JAPAN",
  "course_number": "ART 313",
  "credits": "3",
  "description": "Surveys the arts of Japan from the prehistoric period to the twentieth century.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ANCIENT GREEK ART",
  "course_number": "ART 320",
  "credits": "3",
  "description": "Focuses on the major artistic developments in Ancient Greece from the Middle Bronze Age to 31 BCE, and especially on the city-state of Athens during the Fifth Century.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ANCIENT ROMAN ART AND ARCHITECTURE",
  "course_number": "ART 321",
  "credits": "3",
  "description": "Survey of ancient Roman art and culture between the sixth century BCE and fifth century CE, covering principal media, styles, and subject matter.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*MEDIEVAL ART AND ARCHITECTURE",
  "course_number": "ART 322",
  "credits": "3",
  "description": "Survey of the art and architecture of the major periods and cultures of Europe and the Mediterranean between the fourth and the fourteenth century. Traces salient developments in thought and material culture of western civilization.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ITALIAN RENAISSANCE ART AND ARCHITECTURE",
  "course_number": "ART 323",
  "credits": "3",
  "description": "Survey of Italian Renaissance art and culture, covering the principal artists, patrons, media, styles, and subject matter.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ITALIAN RENAISSANCE ART AND ARCHITECTURE",
  "course_number": "ART 323H",
  "credits": "3",
  "description": "Survey of Italian Renaissance art and culture, covering the principal artists, patrons, media, styles, and subject matter.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRAWING CONCEPTS",
  "course_number": "ART 331",
  "credits": "4",
  "description": "Studio course emphasizing drawing composition as an investigative, conceptualizing and communicative nonverbal language. Independent thinking, problem solving, and creative development encouraged.",
  "prerequisites": ["ART 234"]
}, {
  "corequisites": [],
  "course_name": "DRAWING III: FIGURE",
  "course_number": "ART 334",
  "credits": "4",
  "description": "Intermediate study of the human figure utilizing life models, the skeleton, and anatomy texts. Emphasis on gaining greater knowledge of the body's underlying structure and potential for aesthetic expression.",
  "prerequisites": ["ART 234"]
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL PRACTICES FOR ARTISTS",
  "course_number": "ART 339",
  "credits": "3",
  "description": "Examination of relevant issues and realities facing working artists today through class discussion, critical readings, gallery visits, guest lectures and panel discussions. Development of professional practices appropriate for artists and the business of art include portfolio development, writing and presentation skills, grants, contracts, exhibition opportunities and marketing strategies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DARKROOM PHOTOGRAPHY I",
  "course_number": "ART 340",
  "credits": "4",
  "description": "Studio course in black-and-white film exposure and development, and printing in the darkroom. The medium of silver-based black-and-white photography is explored as a communication mode and art form. Historical, conceptual, technical and legal aspects of traditional wet processing are surveyed. Access to a single lens reflex (SLR) film camera is required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DARKROOM PHOTOGRAPHY II",
  "course_number": "ART 341",
  "credits": "4",
  "description": "Improving silver-gelatin printing and photographic presentation techniques. Emphasis on furthering creative visual language and individual photographic project development. Student must supply a medium format or 35mm single lens reflex (SLR) film camera.",
  "prerequisites": ["ART 340"]
}, {
  "corequisites": [],
  "course_name": "INTERMEDIATE PHOTOGRAPHY",
  "course_number": "ART 345",
  "credits": "4",
  "description": "Emphasis is on both technical and aesthetic expression of digital color photography, from initial image capture, color management to finished print along with color symbolism and composition. Exploration of narrative, sequencing and image-series concepts. Introduction to contemporary color photographers.",
  "prerequisites": ["ART 263"]
}, {
  "corequisites": [],
  "course_name": "PHOTOGRAPH: STUDIO LIGHTING",
  "course_number": "ART 347",
  "credits": "4",
  "description": "Practical studio class surveying the basic principles and application of light in the creation of photographs. The development of craft and technique inside the studio will be emphasized but formal and conceptual considerations related to light and photography will also be explored.",
  "prerequisites": ["ART 263"]
}, {
  "corequisites": [],
  "course_name": "CONCEPTS IN DIGITAL IMAGING",
  "course_number": "ART 348",
  "credits": "4",
  "description": "Approaches to non-traditional and the manipulated image in digital photography with an emphasis on producing personal imagery. Introduction to the history of the manipulated image in photography and to contemporary approaches to digital photography.",
  "prerequisites": ["ART 263"]
}, {
  "corequisites": [],
  "course_name": "VIDEO ART",
  "course_number": "ART 349",
  "credits": "4",
  "description": "Studio course in video art and time-based media projects. Emphasis on experimental approaches to video art in a contemporary art context, linear and non-linear video production and the projection and screening of video art projects. Introduction to the history of video art as an art form. CROSSLISTED as ART 349/NMC 349.",
  "prerequisites": ["ART 222", "ART 263"]
}, {
  "corequisites": [],
  "course_name": "PHOTOGRAPHY ON ASSIGNMENT",
  "course_number": "ART 350",
  "credits": "4",
  "description": "An introduction to shooting photographs on assignment. Students will create, edit, caption, and submit photographs for print publications, online media, and alternative/independent media venues. Students will experiment with text, audio slideshows, and other creative means of illustrating concepts and ideas. Also covered are history, law, and ethics of photojournalism.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSTALLATION",
  "course_number": "ART 351",
  "credits": "4",
  "description": "Studio course designed to acquaint the student with the possibilities of using non-traditional means such as site, time, and interaction to communicate ideas.",
  "prerequisites": ["ART 291"]
}, {
  "corequisites": [],
  "course_name": "*CREATIVE COLLABORATION: DESIGNING AND BUILDING",
  "course_number": "ART 352",
  "credits": "3",
  "description": "Working in multi-disciplinary teams, design, implement, and document a piece of public art work or science museum display. Projects may be made of any media, but must demonstrate creativity both in the engineering used to create them and the technology and society message they convey. CROSSLISTED as ART 352/ENGR 352.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALTERNATIVE PROCESSES IN PHOTOGRAPHY",
  "course_number": "ART 354",
  "credits": "4",
  "description": "Historical photographic printing methods in use today e.g., cyanotype, gum bichromate and more. Use of digital and analog negatives, mixing emulsions and coating paper by hand.",
  "prerequisites": ["ART 263", "ART 345"]
}, {
  "corequisites": [],
  "course_name": "THE PHOTOGRAPHIC BOOK",
  "course_number": "ART 355",
  "credits": "4",
  "description": "Practical studio course focusing on the photographic book in all of its forms. Use appropriated imagery as well as original imagery to create a variety of zines as well as soft and hardcover photo-books. Structure, form, materials, and layout will be discussed as well as content, sequencing, and physical construction. CROSSLISTED as ART 355/GD 355.",
  "prerequisites": ["ART 263"]
}, {
  "corequisites": [],
  "course_name": "*PHOTOGRAPHY: ACTIVISM",
  "course_number": "ART 359",
  "credits": "AND",
  "description": "Explores photography as an agent of social change through creative projects and topical discussions. Emphasis on the visual language, ethical considerations, and strategies employed by activist photographers that disrupt dominant ideologies and address institutionalized inequality and privilege in the United States. No prior photography experience necessary.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CREATIVE FIELD WORK I",
  "course_number": "ART 360",
  "credits": "4",
  "description": "Emphasizes intensive experiential learning using Cape Perpetua Scenic Area, Hatfield Marine Science Center and surrounding areas as the studio. Collects or creates material inspired and informed by the interaction with the people and places associated with the area. Explores unique ecosystems consisting of rocky intertidal zones and old growth forests. Considers history of human interaction with the landscape.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*NINETEENTH-CENTURY ART",
  "course_number": "ART 364",
  "credits": "3",
  "description": "Lecture course covering the principal movements and trends in late eighteenth-century and nineteenth-century architecture, painting, and sculpture in Europe and America, from Neoclassicism to Symbolism.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*HISTORY OF MODERN ART 1900-1945",
  "course_number": "ART 365",
  "credits": "3",
  "description": "Lecture course covering the principal movements and trends in early twentieth-century Western art, from Expressionism to early American Modernism.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ART SINCE 1945",
  "course_number": "ART 366",
  "credits": "3",
  "description": "Lecture course covering the principal movements, theories and ideas in visual art since 1945, including painting, sculpture, photography, installation, performance and participatory art.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*HISTORY OF DESIGN",
  "course_number": "ART 367",
  "credits": "3",
  "description": "A survey of the impact of technology on the visual qualities of graphic, advertising, fashion, architecture, and industrial design from the Victorian Arts and Crafts Movement to the computer age.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ART",
  "course_number": "ART 371",
  "credits": "SCIENCE",
  "description": "A survey of the influence and application of science and technology in the arts. Provides historical and contemporary context of the effects of the evolution of technology and scientific discovery on visual art practices.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRINTMAKING: RELIEF",
  "course_number": "ART 375",
  "credits": "4",
  "description": "Studio course in relief printmaking with emphasis on linocut and woodcut; may include other relief processes, i.e. photo polymer plate. Black-and-white and color.",
  "prerequisites": ["ART 101", "ART 115", "ART 131", "ART 271"]
}, {
  "corequisites": [],
  "course_name": "PRINTMAKING: INTAGLIO",
  "course_number": "ART 376",
  "credits": "4",
  "description": "Studio course in intaglio printmaking with emphasis on drypoint, line etching, aquatint, softground and photo process. Black-and-white and possibly color for final project.",
  "prerequisites": ["ART 101", "ART 115", "ART 131", "ART 271"]
}, {
  "corequisites": [],
  "course_name": "PRINTMAKING: LITHOGRAPHY",
  "course_number": "ART 377",
  "credits": "4",
  "description": "Studio course in lithographic printmaking with emphasis on graining the stone, drawing with crayon and tusche, etching and reworking, inking and printing lithographic limestone. Black-and-white and possibly color for final project.",
  "prerequisites": ["ART 101", "ART 115", "ART 131", "ART 271"]
}, {
  "corequisites": [],
  "course_name": "PRINTMAKING: MONOTYPE",
  "course_number": "ART 378",
  "credits": "4",
  "description": "Studio course in monotype printmaking with emphasis on drawing/painting with brushes, oil pastels, watercolors, water-based crayons, inking with a lithographic roller and printing with an etching press. Black-and-white and color.",
  "prerequisites": ["ART 101", "ART 115", "ART 131", "ART 271"]
}, {
  "corequisites": [],
  "course_name": "PRINTMAKING: SCREEN PRINTING",
  "course_number": "ART 379",
  "credits": "4",
  "description": "Studio course in screen printing with emphasis on paper stencil, drawing fluid and photo emulsion processes. Students are exposed to a range of techniques and concepts are encouraged to investigate personal motivations while making multiple color prints.",
  "prerequisites": ["ART 115"]
}, {
  "corequisites": [],
  "course_name": "PAINTING II: THE FIGURE",
  "course_number": "ART 381",
  "credits": "4",
  "description": "Studio course with emphasis on painting from the live model; understanding the figure in terms of color, form and composition, the figure as symbol, implied narrative and vehicle of expression.",
  "prerequisites": ["ART 281", "ART 234"]
}, {
  "corequisites": [],
  "course_name": "PAINTING II: CONCEPTS",
  "course_number": "ART 382",
  "credits": "4",
  "description": "Painting with emphasis on experimentation and an exploratory investigation of mixed media, new media, collage, and assemblage, utilizing either representation or abstraction.",
  "prerequisites": ["ART 281"]
}, {
  "corequisites": [],
  "course_name": "PAINTING II: ABSTRACT AND MULTIMEDIA",
  "course_number": "ART 383",
  "credits": "4",
  "description": "Intermediate studio course with emphasis on contemporary directions in painting: abstraction and non-literal approaches.",
  "prerequisites": ["ART 101", "ART 115", "ART 131", "ART 281"]
}, {
  "corequisites": [],
  "course_name": "PAINTING II: NEW GENRE",
  "course_number": "ART 384",
  "credits": "4",
  "description": "Exploration of current directions in painting using traditional and non-traditional concepts and techniques.",
  "prerequisites": ["ART 281"]
}, {
  "corequisites": [],
  "course_name": "PAINTING II: ENCAUSTICS",
  "course_number": "ART 385",
  "credits": "4",
  "description": "Exploration and application of a variety of traditional and non-traditional techniques using encaustics paint; beeswax and pigment fused to a surface.",
  "prerequisites": ["ART 281"]
}, {
  "corequisites": [],
  "course_name": "A CULTURAL HISTORY OF AMERICAN ART AND LITERATURE: PART I",
  "course_number": "ART 386",
  "credits": "4",
  "description": "The first course in an interdisciplinary sequence that examines the development and interrelationships of American art and literature from contact to the present. Covers Conquest to Civil War. CROSSLISTED as ART 386/ENG 386.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "A CULTURAL HISTORY OF AMERICAN ART AND LITERATURE: PART II",
  "course_number": "ART 387",
  "credits": "4",
  "description": "The second course in an interdisciplinary sequence that examines the development and interrelationships of American art and literature from contact to the present. Covers Civil War to Harlem Renaissance. CROSSLISTED as ART 387/ENG 387.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "A CULTURAL HISTORY OF AMERICAN ART AND LITERATURE: PART III",
  "course_number": "ART 388",
  "credits": "4",
  "description": "The third course in an interdisciplinary sequence that examines the development and interrelationships of American art and literature from contact to the present. Covers Great Depression to Postmodernity. CROSSLISTED as ART 388/ENG 388.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCULPTURE II",
  "course_number": "ART 391",
  "credits": "4",
  "description": "Intermediate studio course with emphasis in material research and developing greater skills and technical knowledge in sculptural fabrication processes.",
  "prerequisites": ["ART 291"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN EARLY ART HISTORY",
  "course_number": "ART 395",
  "credits": "3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN ART HISTORY",
  "course_number": "ART 398",
  "credits": "3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ART 399",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ART 399H",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "ART 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "ART 402",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "ART 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "ART 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "ART 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "ART 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "ART 408",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM STUDENT MEDIA",
  "course_number": "ART 409",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "ART 410",
  "credits": "1-16",
  "description": "A one-quarter residency with an appropriate, approved agency or organization where a student may receive practical experience related to the objectives of the Department of Art. The intern observes and produces; the work is supervised and evaluated, both by the agency and the art faculty.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^ART IN CONTEXT HISTORICAL AND CRITICAL APPROACHES",
  "course_number": "ART 411",
  "credits": "3",
  "description": "Seminar developing writing and research skills in the field of art with interdisciplinary approaches.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ART FOR TEACHERS I",
  "course_number": "ART 415",
  "credits": "4",
  "description": "A studio course covering basic art materials and techniques. Integrates aesthetics and art criticism, creating art, and the cultural and historical context of works of art for K-12.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PORTFOLIO SEMINAR",
  "course_number": "ART 418",
  "credits": "2",
  "description": "An advanced lecture course providing an overview of pertinent issues in creating a professional graphic design portfolio.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NEW MEDIA: INTERACTIVE",
  "course_number": "ART 422",
  "credits": "4",
  "description": "An advanced course designing digital experiences with emphasis on innovative navigation, architectural structures, theoretical, and historical issues of new media.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRAWING IV",
  "course_number": "ART 431",
  "credits": "3-5",
  "description": "Development of an individual approach to the varied aspects of drawing, emphasis on exploration of traditional and contemporary techniques and styles.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GENDER",
  "course_number": "ART 432",
  "credits": "SEXUALITY",
  "description": "A creative and discussion-based course focusing on ways in which photography can and has addressed issues of gender and sexuality. An introduction to key concepts and intersections in Women's, Gender and Sexuality Studies; Queer Studies and photography theory. Create written and photographic responses to artworks, texts, personal experience and pop-culture. CROSSLISTED as ART 432/QS 432/WGSS 432 and ART 532/QS 532.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRAWING IV/FIGURE",
  "course_number": "ART 434",
  "credits": "3-5",
  "description": "Development of an individual approach to the varied aspect of figure drawing; emphasis on exploration of traditional and contemporary techniques and styles.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SONIC ARTS",
  "course_number": "ART 439",
  "credits": "2",
  "description": "Create experimental sonic art projects using analog and digital technologies to make natural, artificial, and curated sound installations within an arts, design, or communication context. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the sound art project. Develop collaborative skills by working with people from other disciplines. Demonstrate competency through describing and applying sound art concepts including those that involve active listening practices. Explore the breadth and range of sonic-art from a historical and contemporary art practice. CROSSLISTED as ART 439/GD 439/MUS 439/NMC 439/TA 439 and ART 539/MUS 539.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED DARKROOM",
  "course_number": "ART 441",
  "credits": "4",
  "description": "Explores using the camera as a tool to sharpen aesthetic and visual perception. Creates exhibition-quality silver-gelatin prints in pursuit of an individual student portfolio. Introduction to the view camera. Applies advanced darkroom techniques.",
  "prerequisites": ["ART 340"]
}, {
  "corequisites": [],
  "course_name": "COMBINED MEDIA: PHOTO INSTALLATION",
  "course_number": "ART 443",
  "credits": "4",
  "description": "This studio course explores the use the photographic image in conjunction with other studio media to create multi-media works and site-specific installations. Designed to remove and release the photographic image from its ubiquitous tradition, it looks to reassign the association of photography as merely a two dimensional pursuit. Emphasizing the relationship between objects, the course investigates installation art as a contemporary practice and focuses on the role photography or the photographic image has played in expanding this dialogue. Issues involved with using photography for the purposes of creating multimedia spatial experiences are discussed and compared with ideas related to traditional photographic presentation.",
  "prerequisites": ["ART 345"]
}, {
  "corequisites": [],
  "course_name": "THE CONSTRUCTED IMAGE",
  "course_number": "ART 444",
  "credits": "4",
  "description": "An advanced studio photography course that explores directed, manipulated, and constructed photographs. It investigates this rich tradition by looking at both historical and contemporary photography. Issues involved with making clearly artificial photographs are discussed and compared with traditional ideas related to veracity of the photographic image.",
  "prerequisites": ["ART 345"]
}, {
  "corequisites": [],
  "course_name": "DOCUMENTARY PHOTOGRAPHY",
  "course_number": "ART 446",
  "credits": "4",
  "description": "Intensive in-depth documentary photography course designed to develop skill in telling stories with pictures. The course requires pitching a photographic project, reading and writing about documentary photography, and producing a sustained photographic essay with a self-selected documentary subject. Expanded documentary mediums and socially concerned photography are also covered.",
  "prerequisites": ["ART 263", "ART 345"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED STUDIO LIGHTING",
  "course_number": "ART 447",
  "credits": "4",
  "description": "Practical studio course focusing on the advanced applications of studio and location lighting. Students will use digital cameras in combination with professional strobe and mixed artificial lighting. Real-world location lighting challenges will be mastered: scouting locations, hauling and setting up gear, working with models and products, and learning to work on-location.",
  "prerequisites": ["ART 263", "ART 347"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO ARTS ENTREPRENEURSHIP",
  "course_number": "ART 451",
  "credits": "3",
  "description": "Survey of the business strategies behind a successful career in the arts. Emphasizes the importance of entrepreneurial thinking, engages students with the fundamentals of the arts \"business\", and explores ways to influence and shape the industry's future. CROSSLISTED as ART 451/MUS 451/TA 451.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALTERNATIVE PROCESSES IN PHOTOGRAPHY II",
  "course_number": "ART 454",
  "credits": "4",
  "description": "Advanced projects using historical photographic processes.",
  "prerequisites": ["ART 354"]
}, {
  "corequisites": [],
  "course_name": "THE PHOTOGRAPHIC BOOK II",
  "course_number": "ART 455",
  "credits": "4",
  "description": "Practical studio course focusing on advanced practices and techniques in relation to the photographic book. Use appropriated imagery as well as original imagery to complete well-developed book projects. Structure, form, materials, and layout will be discussed as well as content, sequencing, and physical construction. Advanced elements such as application of blanking, slip cases, screen printing, and other construction techniques will be taught. CROSSLISTED as ART 455/GD 455.",
  "prerequisites": ["ART 355"]
}, {
  "corequisites": [],
  "course_name": "PORTFOLIO-PHOTOGRAPHY/VIDEO ART",
  "course_number": "ART 456",
  "credits": "4",
  "description": "Culmination-level course for the creation of an exhibition-level photographic portfolio or other artistic product using lens-based media. Taught using lectures, critiques, readings, writing and self-reflection.",
  "prerequisites": ["ART 340", "ART 345", "ART 347"]
}, {
  "corequisites": [],
  "course_name": "OFF THE SCREEN - VIDEO INSTALLATION ART",
  "course_number": "ART 457",
  "credits": "2",
  "description": "Create experimental video-art installations within an arts, design, or communication context. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the video art project. Explore the breath and range of experimental approaches to video installations, multi-screen projections, immersive visual and sound environments, and projection-mapping from a historical and contemporary art perspective. Develop collaborative skills by working with people from other disciplines. CROSSLISTED as ART 457/GD 457/MUS 457/ NMC 457/TA 457 and ART 557/MUS 557.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CREATIVE FIELD WORK II",
  "course_number": "ART 460",
  "credits": "4",
  "description": "Emphasizes intensive experiential learning studio art that focuses on site-based research and investigation. Collects or creates material inspired and informed by the interaction with the people and places associated with the area. Explores unique ecosystems consisting of rocky intertidal zones and old growth forests. Considers history of human interaction with the landscape. Practices leadership and mentorship for camp organization and best practices during site-based learning.",
  "prerequisites": ["ART 360"]
}, {
  "corequisites": [],
  "course_name": "DIRECTIONS AND ISSUES IN CONTEMPORARY ART",
  "course_number": "ART 462",
  "credits": "3",
  "description": "Specialized study of current trends, developments, and critical issues, including the study of new media such as video and photography, as they manifest themselves in the contemporary art world.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CULTURAL STUDIES OF THE MUSEUM",
  "course_number": "ART 464",
  "credits": "3",
  "description": "Overview of the history, visual culture, and cultural significance of the Western museum. Special attention paid to the development of the art museum and artist's projects that pertain to museums.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY OF PRINTMAKING",
  "course_number": "ART 468",
  "credits": "3",
  "description": "Survey of the social, economic, intellectual, and technical history of printmaking between the early Middle Ages and the twentieth century in Asia, Europe, and the Americas. Treats the major printmaking processes of woodcut, intaglio, lithography, silkscreen, and photography.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRINTMAKING STUDIO",
  "course_number": "ART 475",
  "credits": "4",
  "description": "Studio workshop in relief, intaglio, lithographic, and silkscreen media on an individual project basis.",
  "prerequisites": ["ART 101", "ART 115", "ART 131", "ART 271"]
}, {
  "corequisites": [],
  "course_name": "PRINTMAKING: ADVANCED SCREEN PRINTING",
  "course_number": "ART 479",
  "credits": "4",
  "description": "Studio course in screen printing with an emphasis on photo emulsion processes. Students are encouraged to integrate these processes with other art-making methods in their creative work.",
  "prerequisites": ["ART 379"]
}, {
  "corequisites": [],
  "course_name": "PAINTING III",
  "course_number": "ART 481",
  "credits": "4",
  "description": "Development of individual interests and directions in painting.",
  "prerequisites": ["ART 382", "ART 384"]
}, {
  "corequisites": [],
  "course_name": "SENSOR TECHNOLOGIES AND THE ARTS",
  "course_number": "ART 488",
  "credits": "2",
  "description": "Create interactive arts, design, or communication projects using sensor technologies in combination with sound, video, lights, video games, and generative digital art. Translate gestures of the physical world into interactive control using plug and play wireless sensors. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the sensor technologies project. Explore the breadth and range of interactive art from a historical and contemporary art practice. CROSSLISTED as ART 488/GD 488/MUS 488/NMC 488/TA 488 and ART 588/MUS 588.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCULPTURE III",
  "course_number": "ART 491",
  "credits": "4",
  "description": "Development of individual interests and directions in sculpture.",
  "prerequisites": ["ART 391"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN ASIAN ART",
  "course_number": "ART 492",
  "credits": "3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN EARLY ART HISTORY",
  "course_number": "ART 494",
  "credits": "3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EXHIBITION DESIGN",
  "course_number": "ART 495",
  "credits": "1",
  "description": "Participatory experience in art gallery exhibition design working in Fairbanks Gallery. Includes specialized study in visual design, lighting, and technical installation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN ART HISTORY",
  "course_number": "ART 498",
  "credits": "3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ART 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "ART 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "ART 502",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "ART 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "ART 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "ART 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "ART 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "ART 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "ART 510",
  "credits": "1-12",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GENDER",
  "course_number": "ART 532",
  "credits": "SEXUALITY",
  "description": "A creative and discussion-based course focusing on ways in which photography can and has addressed issues of gender and sexuality. An introduction to key concepts and intersections in Women's, Gender and Sexuality Studies; Queer Studies and photography theory. Create written and photographic responses to artworks, texts, personal experience and pop-culture. CROSSLISTED as ART 432/QS 432/WGSS 432 and ART 532/QS 532.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SONIC ARTS",
  "course_number": "ART 539",
  "credits": "2",
  "description": "Create experimental sonic art projects using analog and digital technologies to make natural, artificial, and curated sound installations within an arts, design, or communication context. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the sound art project. Develop collaborative skills by working with people from other disciplines. Demonstrate competency through describing and applying sound art concepts including those that involve active listening practices. Explore the breadth and range of sonic-art from a historical and contemporary art practice. CROSSLISTED as ART 439/GD 439/MUS 439/NMC 439/TA 439 and ART 539/MUS 539.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DOCUMENTARY PHOTOGRAPHY",
  "course_number": "ART 546",
  "credits": "3",
  "description": "An intensive shooting course in 35mm photography designed to develop skill in telling stories using pictures. Single picture and multiple picture stories.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PORTFOLIO-PHOTOGRAPHY/VIDEO ART",
  "course_number": "ART 556",
  "credits": "4",
  "description": "Culmination-level course for the creation of an exhibition-level photographic portfolio or other artistic product using lens-based media. Taught using lectures, critiques, readings, writing and self-reflection.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OFF THE SCREEN - VIDEO INSTALLATION ART",
  "course_number": "ART 557",
  "credits": "2",
  "description": "Create experimental video-art installations within an arts, design, or communication context. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the video art project. Explore the breath and range of experimental approaches to video installations, multi-screen projections, immersive visual and sound environments, and projection-mapping from a historical and contemporary art perspective. Develop collaborative skills by working with people from other disciplines. CROSSLISTED as ART 457/GD 457/MUS 457/ NMC 457/TA 457 and ART 557/MUS 557.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DIRECTIONS AND ISSUES IN CONTEMPORARY ART",
  "course_number": "ART 562",
  "credits": "3",
  "description": "Specialized study of current trends, developments, and critical issues, including the study of new media such as video and photography, as they manifest themselves in the contemporary art world.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CULTURAL STUDIES OF THE MUSEUM",
  "course_number": "ART 564",
  "credits": "3",
  "description": "Overview of the history, visual culture, and cultural significance of the Western museum. Special attention paid to the development of the art museum and artist's projects that pertain to museums.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PAINTING III",
  "course_number": "ART 581",
  "credits": "3-5",
  "description": "Development of individual interests and directions in painting.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SENSOR TECHNOLOGIES AND THE ARTS",
  "course_number": "ART 588",
  "credits": "2",
  "description": "Create interactive arts, design, or communication projects using sensor technologies in combination with sound, video, lights, video games, and generative digital art. Translate gestures of the physical world into interactive control using plug and play wireless sensors. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the sensor technologies project. Explore the breadth and range of interactive art from a historical and contemporary art practice. CROSSLISTED as ART 488/GD 488/MUS 488/NMC 488/TA 488 and ART 588/MUS 588.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ART 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]