[{
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "AT 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "AT 509",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "AT 510",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO ATHLETIC TRAINING",
  "course_number": "AT 511",
  "credits": "4",
  "description": "Practice domains include injury and illness prevention and wellness protection, clinical evaluation and diagnosis, immediate and emergency care, treatment and rehabilitation, and organizational and professional health and well-being.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CLINICAL ANATOMY",
  "course_number": "AT 513",
  "credits": "4",
  "description": "Explores clinical anatomy in athletic training focusing on structure and function. Emphasizes the clinical assessment of human anatomy, movement, and its relationship to injury and dysfunction.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ORTHOPEDIC ASSESSMENT I",
  "course_number": "AT 530",
  "credits": "4",
  "description": "Explores prevention, assessment and management of lower extremity injuries and conditions commonly encountered by the athletic trainer.",
  "prerequisites": [["AT 513"]]
}, {
  "corequisites": [],
  "course_name": "ORTHOPEDIC ASSESSMENT II",
  "course_number": "AT 531",
  "credits": "4",
  "description": "Explores prevention, assessment and management of upper extremity injuries and conditions commonly encountered by the athletic trainer.",
  "prerequisites": [["AT 530", "AT 521", "KIN 521"]]
}, {
  "corequisites": [],
  "course_name": "ORTHOPEDIC ASSESSMENT III",
  "course_number": "AT 532",
  "credits": "4",
  "description": "Explores prevention, assessment and management of neck, spine and pelvis injuries and conditions commonly encountered by the athletic trainer.",
  "prerequisites": [["AT 531", "AT 520", "KIN 520"]]
}, {
  "corequisites": [],
  "course_name": "INTEGRATED BEHAVIORAL HEALTH IN ATHLETIC TRAINING",
  "course_number": "AT 541",
  "credits": "3",
  "description": "Explores integrated behavioral health in athletic training focusing on patient-centered care. Emphasizes the multidisciplinary approach in the individualized care of behavioral health conditions including suicidal ideation, depression, eating disorders and the associated necessary referrals to additional clinical personnel.",
  "prerequisites": [["AT 530", "AT 521", "KIN 521"]]
}, {
  "corequisites": [],
  "course_name": "MANAGEMENT OF EMERGENT CONDITIONS IN ATHLETIC TRAINING",
  "course_number": "AT 565",
  "credits": "3",
  "description": "Examines the knowledge and skills required to care for emergent conditions encountered by the athletic trainer. Includes the management of a patient experiencing shock, cardiovascular emergency, respiratory emergency, head injury, spinal injury, fracture, dislocation, and conditions related to environmental factors.",
  "prerequisites": [["AT 566", "KIN 566"]]
}, {
  "corequisites": [],
  "course_name": "GENERAL MEDICAL ASSESSMENT",
  "course_number": "AT 566",
  "credits": "4",
  "description": "Prevention, evaluation, diagnosis, and management of general medical conditions commonly encountered by the athletic trainer.",
  "prerequisites": [["AT 565", "KIN 565"]]
}, {
  "corequisites": [],
  "course_name": "ADMINISTRATIVE ISSUES IN ATHLETIC TRAINING",
  "course_number": "AT 568",
  "credits": "3",
  "description": "Examines administrative aspects of athletic training program management. Including principles of risk management, strategic and operational planning, medical-legal aspects of athletic healthcare, confidentiality and documentation of patient health information, insurance and third-party reimbursement, personnel issues, and current professional issues.",
  "prerequisites": [["AT 569", "KIN 569"]]
}, {
  "corequisites": [],
  "course_name": "RESEARCH INFORMED PRACTICE",
  "course_number": "AT 569",
  "credits": "3",
  "description": "Examine the principles and skills underlying the utilization of evidence to enhance clinical practice decision-making. Includes the development of clinical questions, review and appraisal of relevant literature, and utilization of patient-centered outcome measures.",
  "prerequisites": [["AT 531", "AT 520", "KIN 520"]]
}, {
  "corequisites": [],
  "course_name": "CONCUSSION MANAGEMENT",
  "course_number": "AT 583",
  "credits": "3",
  "description": "Examines concussions and other traumatic brain injuries encountered by the athletic trainer. Includes the prevention, assessment, rehabilitation, and management of concussions.",
  "prerequisites": [["AT 565", "KIN 565"]]
}, {
  "corequisites": [],
  "course_name": "PHYSIOLOGY AND MANAGEMENT OF MUSCULOSKELETAL INJURIES",
  "course_number": "AT 584",
  "credits": "3",
  "description": "Mechanics of musculoskeletal tissue injuries; physiologic response and repair processes of various tissues; and effects of physical agents commonly used by athletic trainers in the care and treatment of musculoskeletal injuries.",
  "prerequisites": [["AT 511", "KIN 511"]]
}, {
  "corequisites": [],
  "course_name": "REHABILITATION I",
  "course_number": "AT 585",
  "credits": "4",
  "description": "Explores the theoretical foundation and techniques of rehabilitation management in the physically active patient. Emphasizes therapeutic exercise of injuries and conditions of the lower extremity, lumbar spine, pelvis and ribs with a focus on program design, implementation and interpretation of patient’s physical status.",
  "prerequisites": [["AT 532", "AT 522", "KIN 522"]]
}, {
  "corequisites": [],
  "course_name": "REHABILITATION II",
  "course_number": "AT 586",
  "credits": "4",
  "description": "Explores the theoretical foundation and techniques of rehabilitation management in the physically active patient. Emphasizes therapeutic exercise of injuries and conditions of the upper extremity, cervical and thoracic spine using techniques of program design learned in AT 585. Examine theory and apply manual therapy interventions.",
  "prerequisites": [["AT 585", "KIN 585"]]
}, {
  "corequisites": [],
  "course_name": "NUTRITION FOR INJURY AND ATHLETIC PERFORMANCE",
  "course_number": "AT 587",
  "credits": "3",
  "description": "Examines and incorporates evidenced based recommendations for nutrition to support active individuals. Applies nutrition strategies to decrease risk of injury, support rehabilitation and tissue healing, and optimize athletic performance specific to the skill set of an athletic trainer.",
  "prerequisites": [["AT 530", "AT 521", "KIN 521"]]
}]