[{
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "BANA 004",
  "credits": "0",
  "description": "Provides basic personal and professional skills that can be used within and outside of a work setting. Through practice, this experience guides students in building and maintaining positive professional relationships, networking/mentoring relationships, and enhances students’ understanding of the connection between theory and practice in their respective disciplines.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO BUSINESS ANALYTICS AND ARTIFICIAL INTELLIGENCE",
  "course_number": "BANA 270",
  "credits": "4",
  "description": "Applies analytical and artificial intelligence methods for better organizational decision making. Applies computational methods over large amount of data to gain competitive advantage. Covers basic IT strategy concepts for the identification of the opportunities for analytical/AI solutions. Introduces various machine learning methods with hands-on experience using software package to implement such solutions. Provides link between computational methods and typical issues in various aspects of organizations, including customer relationship management, internet marketing, supply chain management, information security, and human resource management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO BUSINESS ANALYTICS",
  "course_number": "BANA 370",
  "credits": "4",
  "description": "How organizations can successfully collect, evaluate and apply information for better decision making. Emerging technologies such as transaction processing systems, RFID, weblogs, social networks, website usage, and online communities have the potential to reveal market trends, suppliers' preferences, and competitors' next moves. The success of an organization largely depends on its ability to take advantage of those data sets that are already available to it. Starts with basic IT strategy concepts for the identification of the opportunities for BI solutions, and ends with hands-on experience using Business Intelligence tools to implement such solutions. NO LONGER TAUGHT. REPLACED WITH BANA 270.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DATA MANAGEMENT",
  "course_number": "BANA 371",
  "credits": "3",
  "description": "Familiarize students with the major activities involved in collecting and managing data for a data analytics project, including extracting information from relational databases, mapping organizational requirements into a data design, transforming data into information, and exploring basic concepts underlying No Structured Query Language (NoSQL) data management and analysis methods.",
  "prerequisites": ["BANA 270", "BANA 370"]
}, {
  "corequisites": [],
  "course_name": "DATA EXPLORATION AND VISUALIZATION",
  "course_number": "BANA 372",
  "credits": "3",
  "description": "Explores and visualizes data in business analytics projects. Focuses on exploring and wrangling data to discover interesting analysis questions and prepare for other analytics activities. Pays special attention to data visualization methods and their overall place in data science and business analytics.",
  "prerequisites": ["BANA 270", "BANA 370"]
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "BANA 410",
  "credits": "1-12",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO SPORTS ANALYTICS",
  "course_number": "BANA 450",
  "credits": "2",
  "description": "Introduces the applications of data analytics across all functional areas of sport business, including marketing, event management, human resource management, finance, facility operation, legal services, etc. Explains how data can be applied to improve the decision outcomes and operation performance in talent identification, team performance management, ticket sales, and risk management.",
  "prerequisites": ["BA 350"]
}, {
  "corequisites": [],
  "course_name": "MACHINE LEARNING AND TEXT MINING FOR BUSINESS",
  "course_number": "BANA 472",
  "credits": "3",
  "description": "Examines how machine learning (ML) and natural language processing (NLP) technologies can be used to improve decision-making. Covers the fundamental principles and techniques of ML, NLP, and uses real-world examples and cases to place ML and NLP techniques in context. Provides hands-on experience with ML and NLP software.",
  "prerequisites": ["BANA 371", "BANA 372"]
}, {
  "corequisites": [],
  "course_name": "DATA ANALYTICS FOR COMPETITIVE ADVANTAGE",
  "course_number": "BANA 560",
  "credits": "3",
  "description": "Case studies, hands-on data analysis experience, and a class project will introduce basic concepts of data analytics, sketch the lifecycle of a data analytics project, and connect analytics to business consequences. Use representative analytic tools to support decision making.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DATA MANAGEMENT",
  "course_number": "BANA 570",
  "credits": "3",
  "description": "Familiarize students with the major activities involved in collecting and managing data for a data analytics project, including extracting information from relational databases, mapping organizational requirements into a data design, transforming data into information, and exploring basic concepts underlying noSQL data management and analysis methods.",
  "prerequisites": ["BANA 560"]
}, {
  "corequisites": [],
  "course_name": "DATA EXPLORATION AND VISUALIZATION",
  "course_number": "BANA 571",
  "credits": "3",
  "description": "Explores and visualizes data in business analytics projects. Focuses on exploring and wrangling data to discover interesting analysis questions and prepare for other analytics activities. Pays special attention to data visualization methods and their overall place in data science and business analytics.",
  "prerequisites": ["BANA 560"]
}, {
  "corequisites": [],
  "course_name": "MACHINE LEARNING AND TEXT MINING FOR BUSINESS",
  "course_number": "BANA 572",
  "credits": "3",
  "description": "Examines how machine learning (ML) and natural language processing (NLP) technologies can be used to improve decision-making. Covers the fundamental principles and techniques of ML, NLP, and uses real-world examples and cases to place ML and NLP techniques in context. Provides hands-on experience with ML and NLP software.",
  "prerequisites": ["BANA 570", "BANA 571"]
}, {
  "corequisites": [],
  "course_name": "INTEGRATED BUSINESS ANALYTICS PROJECT",
  "course_number": "BANA 577",
  "credits": "3",
  "description": "Integrates what students have learned to solve industry-sponsored problems. Provides opportunities to design, implement, and evaluate analytic solutions for a real-world enterprise. Student teams examine the data requirements, technical requirements, and organizational requirements necessary for the success of analytical solutions. Gives students the experience of leading and managing an analytical team, much as a Chief Analytics Officer (CAO) would be expected to do.",
  "prerequisites": ["BA 555", "BANA 570", "BANA 571"]
}]