[{
  "corequisites": [],
  "course_name": "GENERAL CREDIT",
  "course_number": "BI LD1",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GENERAL CREDIT",
  "course_number": "BI LD2",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "UNDERGRADUATE RESEARCH",
  "course_number": "BI 003",
  "credits": "0",
  "description": "Engage in research activities appropriate to the discipline; and through the research experience, acquire skills, techniques, and knowledge relevant to the field of study. In consultation with a faculty mentor, engage in research activity, and make and execute a plan for a project.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ENVIRONMENTAL BIOLOGY: ECOLOGY",
  "course_number": "BI 101",
  "credits": "CONSERVATION",
  "description": "Introduction to ecosystems, including biodiversity, species interactions, human impacts, and conservation biology. Lectures introduce biological themes and research in the context of current issues in science and society. Hands-on laboratories focus on using organisms and technologies to explore biology and develop skills for lifelong learning. No previous science courses are required, intended for non-biological science majors. This course can be taken alone or in any combination with BI 102 or 103.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ANIMAL BIOLOGY: GENES",
  "course_number": "BI 102",
  "credits": "BEHAVIOR",
  "description": "Introduction to how genetics shapes life on Earth, including how understandings of DNA and environmental factors are leading to biotechnological advances. Lectures introduce biological themes and research in the context of current issues in science and society. Hands-on laboratories focus on using organisms and technologies to explore biology and develop skills for lifelong learning. No previous science courses are required, intended for non-biological science majors. This course can be taken alone or in any combination with BI 101 and BI 103.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*HUMAN BIOLOGY: ANATOMY",
  "course_number": "BI 103",
  "credits": "PHYSIOLOGY",
  "description": "Introduction to the biology of humans, including aspects of human health and disease. Lectures introduce biological themes and research in the context of current issues in science and society. Hands-on laboratories focus on using organisms and technologies to explore biology and develop skills for lifelong learning. No previous science courses are required, intended for non-biological science majors. This course can be taken alone or in any combination with BI 101 and BI 102.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTH PROFESSIONS: MEDICAL",
  "course_number": "BI 109",
  "credits": "1",
  "description": "Discussion of matters relating to a medical career. Includes application procedures, the importance of various requirements, admissions, professional school curricula, financing education, and related matters. Speakers are included.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO MARINE LIFE IN THE SEA: MARINE HABITATS",
  "course_number": "BI 111",
  "credits": "1",
  "description": "A field-focused learning experience exploring the varied marine life and habitats on the Oregon coast, including rocky shores, sandy beaches, mud flats, bays and estuaries. Students will also be introduced to the breadth of marine science course offerings and research at Oregon State University’s Hatfield Marine Science Center located in Newport, Oregon.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BIODIVERSITY RESEARCH AND MUSEUM SCIENCE",
  "course_number": "BI 112X",
  "credits": "1",
  "description": "Emphasizes hands-on learning experiences that explore topics related to biodiversity science through examination of, and activities with, natural history museum specimens. Explores varied approaches biologists use to study diverse groups like insects and other arthropods while gaining an appreciation for the amazing regional faunal diversity as well as the role of research collections and museum specimens in modern biological science.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO MARINE BIOLOGY",
  "course_number": "BI 150",
  "credits": "3",
  "description": "Survey of marine organisms, the environments they inhabit, and their evolutionary adaptations for thriving in those environments. The course will also highlight current conservation challenges that threaten marine life, such as climate change, overfishing, and pollution.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GENOMES",
  "course_number": "BI 175",
  "credits": "IDENTITIES",
  "description": "DNA's roles in shaping our senses of identity, individuality, and societal interconnectivity will be analyzed. New advances in genetic technology will be explored, along with their potential impacts on society. The relationships between genetics and discrimination will be examined with focus on cases from Oregon, America, and the world.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL DEVELOPMENT I: ZOOLOGY CAREERS",
  "course_number": "BI 196X",
  "credits": "1",
  "description": "Explores the online Zoology major and careers related to animals. Emphasizes professional development through relevant social and cognitive concepts. Examines online and regional experiential learning and networking opportunities. Highlights departmental and Ecampus student success resources.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL DEVELOPMENT I: HEALTH PROFESSIONS",
  "course_number": "BI 197",
  "credits": "1",
  "description": "Integrative Biology faculty and other professionals introduce a variety of human health professions including dentistry, medicine, pharmacy and others (veterinary medicine students take BI 198). Emphasizes professional development through exploring relevant social and cognitive concepts, as well as engaging in experiential learning and networking. Departmental and campus student success resources are highlighted.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL DEVELOPMENT I: BIOLOGY AND ZOOLOGY",
  "course_number": "BI 198",
  "credits": "1",
  "description": "Integrative Biology faculty and biology professionals introduce life science careers outside of human health professions (human health profession students take BI 197). Emphasizes professional development through exploring relevant social and cognitive concepts, as well as engaging in experiential learning and networking. Departmental and campus student success resources are highlighted.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS",
  "course_number": "BI 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS",
  "course_number": "BI 199H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTORY BIOLOGY I",
  "course_number": "BI 204",
  "credits": "4",
  "description": "Foundations of biological sciences including scientific inquiry, genetics, evolution, and ecology. Significant emphasis throughout on the application of core concepts to solve human and environmental problems. Laboratory emphasizes skills in critical thinking, scientific writing, and experimental design. Not intended for pre-health profession students.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTORY BIOLOGY II",
  "course_number": "BI 205",
  "credits": "4",
  "description": "Explores fundamental concepts in molecular and cellular biology, beginning with biomolecules and the origin of life, and ending with genomics. Emphasizes applications of molecular and cellular biology to solve human problems. Reinforces general course content, through companion laboratory experiments, while cultivating student skills in critical thinking, scientific writing, and experimental design. Not intended for pre-health profession students.",
  "prerequisites": ["BI 204", "CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTORY BIOLOGY III",
  "course_number": "BI 206",
  "credits": "4",
  "description": "Explores basic plant and animal physiology from an evolutionary perspective. Significant emphasis on topics of importance to human society, including human and plant disease. Laboratory emphasizes skills in critical thinking, scientific writing, and experimental design. Not intended for pre-health professional students.",
  "prerequisites": ["BI 204", "CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY",
  "course_number": "BI 211",
  "credits": "4",
  "description": "Origins of life, energy transformations, plant and animal diversity. Lec/lab. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY",
  "course_number": "BI 211H",
  "credits": "4",
  "description": "Origins of life, energy transformations, plant and animal physiology. Lec/lab. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY",
  "course_number": "BI 212",
  "credits": "4",
  "description": "Cell biology, organ systems, plant and animal physiology. Lec/lab. (Bacc Core Course)",
  "prerequisites": ["CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY",
  "course_number": "BI 212H",
  "credits": "4",
  "description": "Cell biology, organ systems, plant and animal physiology. Lec/lab. (Bacc Core Course)",
  "prerequisites": ["CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY",
  "course_number": "BI 213",
  "credits": "4",
  "description": "Genetics, evolution, natural selection, and ecology. Lec/lab. (Bacc Core Course)",
  "prerequisites": ["CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY",
  "course_number": "BI 213H",
  "credits": "4",
  "description": "Genetics, evolution, natural selection, and ecology. Lec/lab. (Bacc Core Course)",
  "prerequisites": ["CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY: CELLS",
  "course_number": "BI 221",
  "credits": "4",
  "description": "Introduction to fundamental biological concepts and theories about the chemical and molecular basis of life, structure and function, transformation of energy and matter and information flow at a cellular and molecular level. (Bacc Core Course)",
  "prerequisites": ["CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY: CELLS",
  "course_number": "BI 221H",
  "credits": "4",
  "description": "Introduction to fundamental biological concepts and theories about the chemical and molecular basis of life, structure and function, transformation of energy and matter and information flow at a cellular and molecular level. (Bacc Core Course)",
  "prerequisites": ["CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY: ORGANISMS",
  "course_number": "BI 222",
  "credits": "4",
  "description": "Introduction to fundamental biological concepts and theories about plant, and animal physiology, evolution, structure and function, transformation of energy and matter and systems at an organismal level. (Bacc Core Course)",
  "prerequisites": ["BI 221", "BI 221H", "CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY: ORGANISMS",
  "course_number": "BI 222H",
  "credits": "4",
  "description": "Introduction to fundamental biological concepts and theories about plant, and animal physiology, evolution, structure and function, transformation of energy and matter and systems at an organismal level. (Bacc Core Course)",
  "prerequisites": ["BI 221", "BI 221H", "CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY: POPULATIONS",
  "course_number": "BI 223",
  "credits": "4",
  "description": "Introduction to fundamental biological concepts and theories about diversity, evolution, and ecology; specifically, evolutionary relationship, transformation of energy and matter, information flow and systems at a population level or above. (Bacc Core Course)",
  "prerequisites": ["BI 221", "BI 221H", "CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "*PRINCIPLES OF BIOLOGY: POPULATIONS",
  "course_number": "BI 223H",
  "credits": "4",
  "description": "Introduction to fundamental biological concepts and theories about diversity, evolution, and ecology; specifically, evolutionary relationship, transformation of energy and matter, information flow and systems at a population level or above. (Bacc Core Course)",
  "prerequisites": ["BI 221", "BI 221H", "CH 121", "CH 201", "CH 231", "CH 231H", "CH 261", "CH 261H", "CH 271"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HUMAN ANATOMY AND PHYSIOLOGY",
  "course_number": "BI 231",
  "credits": "3",
  "description": "The first of a three-term introductory series. Using a strong gross anatomy focus, course topics address fundamental concepts of biology as they apply to human anatomy and physiology and then focus on understanding the structures, functions, and regulatory mechanisms involved in the human skeleton, muscular and integumentary systems. BI 231 is a required prerequisite to BI 232 and BI 233. The BI 241 Lab is optional but prerequisite for either of the subsequent BI 242 or BI 243 lab courses in the series. Lec.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HUMAN ANATOMY AND PHYSIOLOGY",
  "course_number": "BI 232",
  "credits": "3",
  "description": "The second of a three-term introductory series. Using a strong gross anatomy focus, course topics address the structures, functions and regulatory mechanisms involved in the human nervous, endocrine and reproductive systems. Lec.",
  "prerequisites": ["BI 231"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HUMAN ANATOMY AND PHYSIOLOGY",
  "course_number": "BI 233",
  "credits": "3",
  "description": "The third of a three-term introductory series. Using a strong gross anatomy focus, course topics address the structures, functions, and regulatory mechanisms involved in the human cardiovascular, respiratory, urinary and digestive systems. Lec.",
  "prerequisites": ["BI 231"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HUMAN ANATOMY AND PHYSIOLOGY LABORATORY",
  "course_number": "BI 241",
  "credits": "2",
  "description": "The first of a three-term introductory series. Using the human cadaver (prosection), course topics address fundamental concepts of biology as they apply to human anatomy and physiology and then focus on understanding the structures, functions, and regulatory mechanisms involved in the human skeletal, muscular and integumentary systems. Physiology demonstrations illustrate functions of organ systems.",
  "prerequisites": ["BI 231"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HUMAN ANATOMY AND PHYSIOLOGY LABORATORY",
  "course_number": "BI 242",
  "credits": "2",
  "description": "The second of a three-term introductory series. Using the human cadaver (prosection) and dissection of preserved specimens with a strong gross anatomy focus, course topics address the structures, functions and regulatory mechanisms involved in the nervous, endocrine and reproductive systems. Physiology demonstrations illustrate functions of organ systems.",
  "prerequisites": ["BI 231", "BI 232", "BI 241"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HUMAN ANATOMY AND PHYSIOLOGY LABORATORY",
  "course_number": "BI 243",
  "credits": "2",
  "description": "The third of a three-term introductory series. Using the human cadaver (prosection) and dissection of preserved specimens with a strong gross anatomy focus, course topics address the structures, functions, and regulatory mechanisms involved in the human cardiovascular, respiratory, urinary and digestive systems. Physiology demonstrations illustrate functions of organ systems.",
  "prerequisites": ["BI 231", "BI 233", "BI 241"]
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF HUMAN ANATOMY AND PHYSIOLOGY",
  "course_number": "BI 254",
  "credits": "5",
  "description": "First of a three-term series. Explores the fundamental concepts of biology as they apply to human anatomy and physiology and examines the structures, functions, and regulatory mechanisms involved in the skeletal, muscular and integumentary systems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF HUMAN ANATOMY AND PHYSIOLOGY",
  "course_number": "BI 255",
  "credits": "5",
  "description": "Second of a three-term series. Explores the structures, functions and regulatory mechanisms involved in the nervous, endocrine and reproductive systems.",
  "prerequisites": ["BI 254"]
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF HUMAN ANATOMY AND PHYSIOLOGY",
  "course_number": "BI 256",
  "credits": "5",
  "description": "Third of a three-term series. Explores the structures, functions, and regulatory mechanisms involved in the cardiovascular, respiratory, urinary and digestive systems.",
  "prerequisites": ["BI 254"]
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL DEVELOPMENT FOR BIOLOGISTS II",
  "course_number": "BI 298",
  "credits": "1",
  "description": "Students will develop awareness of the elements of professional development, identify strategic areas for growth, and design an exploration plan. Emphasis is placed on being able to analyze career opportunities to determine the best mix of technical and professional skills needed for success as a biological science professional.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "BI 299",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*HUMAN IMPACTS ON ECOSYSTEMS",
  "course_number": "BI 301",
  "credits": "3",
  "description": "Examines selected human impacts on ecosystems in depth, including air quality, global climate change, management of agricultural and forest resources, and threats to biological diversity. Discusses the causes, approaches to investigating, and potential solutions for each issue from a scientific and social perspective. Examines the adverse effects on ecosystems that result from each environmental problem. CROSSLISTED as BI 301/BOT 301.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ENVIRONMENTAL ECOLOGY",
  "course_number": "BI 306",
  "credits": "3",
  "description": "Biological, physical, and chemical nature of both natural and human-disturbed ecosystems. Topics include population and conservation ecology, toxins in the food chain and in the environment, forest decline and acid rain, eutrophication of terrestrial and aquatic ecosystems, and ecosystem restoration. Offered alternate years. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ENVIRONMENTAL ECOLOGY",
  "course_number": "BI 306H",
  "credits": "3",
  "description": "Biological, physical, and chemical nature of both natural and human-disturbed ecosystems. Topics include population and conservation ecology, toxins in the food chain and in the environment, forest decline and acid rain, eutrophication of terrestrial and aquatic ecosystems, and ecosystem restoration. Offered alternate years. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEACHING PRACTICUM",
  "course_number": "BI 309",
  "credits": "1-6",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GENETICS",
  "course_number": "BI 311",
  "credits": "4",
  "description": "Explores fundamentals of transmission, population and molecular genetics.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "GENETICS",
  "course_number": "BI 311H",
  "credits": "4",
  "description": "Explores fundamentals of transmission, population and molecular genetics.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "^THEORY",
  "course_number": "BI 319",
  "credits": "PRACTICE",
  "description": "The practice of science and the critical evaluation of scientific claims are explored though writings, discussions and presentations. Topics including the scientific method, ethics and the role of science in society are examined along with implications for professionals ranging from health care to environmental biology. Strategies for effectively communicating science with diverse audiences are emphasized.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206", "ST 351", "ST 351H"]
}, {
  "corequisites": [],
  "course_name": "^MICROBIAL INFLUENCES ON HUMAN HEALTH",
  "course_number": "BI 323",
  "credits": "3",
  "description": "Explores how microorganisms contribute in beneficial and detrimental ways to human health. Emphasizes microbial contributions to cancer, gut health, chronic infection and autoimmune diseases.",
  "prerequisites": ["MB 302", "MB 302H"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED HUMAN ANATOMY AND PHYSIOLOGY",
  "course_number": "BI 331",
  "credits": "3",
  "description": "The first of a three-term advanced series. With a strong focus on the physiological underpinnings of disease, course topics address the fundamental concepts of human anatomy and physiology and then focus on understanding the structures, functions, regulatory mechanisms and common pathologies involved in the skeletal, muscular and integumentary systems. Lec.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "CH 123", "CH 233", "CH 233H", "CH 263", "CH 263H", "BI 341"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED HUMAN ANATOMY AND PHYSIOLOGY",
  "course_number": "BI 332",
  "credits": "3",
  "description": "The second of a three-term advanced series. With a strong focus on the physiological underpinnings of disease, course topics address the structures, functions, and regulatory mechanisms involved in the nervous, endocrine and reproductive systems. Lec.",
  "prerequisites": ["BI 331", "BI 342"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED HUMAN ANATOMY AND PHYSIOLOGY",
  "course_number": "BI 333",
  "credits": "3",
  "description": "The third part of a three-term advanced series. With a strong focus on the physiological underpinnings of disease, course topics address the structures, functions, and regulatory mechanisms involved in the cardiovascular, respiratory, urinary and digestive systems. Lec.",
  "prerequisites": ["BI 332", "BI 343"]
}, {
  "corequisites": ["BI 331"],
  "course_name": "ADVANCED HUMAN ANATOMY AND PHYSIOLOGY LABORATORY",
  "course_number": "BI 341",
  "credits": "2",
  "description": "The first of a three-term advanced series. Using the human cadaver (prosection) and physiological data acquisition equipment, course topics address the fundamental concepts of human anatomy and physiology and then focus on understanding the structures, functions, regulatory mechanisms and common pathologies involved in the human skeletal, muscular and integumentary systems. Lab.",
  "prerequisites": []
}, {
  "corequisites": ["BI 332"],
  "course_name": "ADVANCED HUMAN ANATOMY AND PHYSIOLOGY LABORATORY",
  "course_number": "BI 342",
  "credits": "2",
  "description": "The second of a three-term advanced series. Using the human cadaver (prosection), dissection of preserved specimens, and physiological data acquisition equipment, course topics address the structures, functions, regulatory mechanisms and common pathologies involved in the human nervous, endocrine and reproductive systems. Lab.",
  "prerequisites": []
}, {
  "corequisites": ["BI 333"],
  "course_name": "ADVANCED HUMAN ANATOMY AND PHYSIOLOGY LABORATORY",
  "course_number": "BI 343",
  "credits": "2",
  "description": "The third of a three-term advanced series. Using the human cadaver (prosection),dissection of preserved specimens, and physiological data acquisition equipment, course topics address the structures, functions, regulatory mechanisms and common pathologies involved in the human cardiovascular, respiratory, urinary and digestive systems. Lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OCEAN SOLUTIONS",
  "course_number": "BI 346X",
  "credits": "0-3",
  "description": "Introduces environmental and policy challenges in marine systems then explores various technological and policy strategies to address those challenges. Develops a conceptual framework to examine potential environmental, social, and economic implications of proposed mitigation strategies via lectures, group and individual library research, fieldtrips to coastal locations, and in-class and online discussions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*OCEANS IN PERIL",
  "course_number": "BI 347",
  "credits": "3",
  "description": "The interactions of society and the marine environment, emphasizing the ecological, biogeochemical, economic, sociological, and political significance of the oceans. Topics of current critical importance will include marine pollution, protecting marine habitats, conserving marine biodiversity, fisheries and aquaculture, ocean energy, biogeochemical change, global warming, ocean acidification, and sea level rise.",
  "prerequisites": ["BI 101", "BI 102", "BI 211", "BI 211H", "BI 213", "BI 213H", "BI 204", "BI 150", "BI 221", "BI 221H"]
}, {
  "corequisites": [],
  "course_name": "*HUMAN ECOLOGY",
  "course_number": "BI 348",
  "credits": "3",
  "description": "The impact of humans on the environment, emphasizing the political, sociological, and ecological consequences of human population growth. Topics of current critical importance will include global warming trends, destruction of the ozone layer, consequences of pollution, habitat destruction, the loss of biodiversity, and conservation biology. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MARINE ECOLOGY",
  "course_number": "BI 351",
  "credits": "3",
  "description": "Ecological interactions and principles in different marine habitats. Topics include the organisms (plants, invertebrates, vertebrates) found in major habitats and interactions between organisms. Habitats discussed include coral reefs, rocky shores, kelp forests, near-shore waters, open-ocean waters, and the deep sea. Emphasis is placed on how organism-organism interactions produce varying patterns of distribution, abundance, body size, diversity, stability, and succession.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "PACIFIC NORTHWEST COASTAL ECOSYSTEMS",
  "course_number": "BI 353",
  "credits": "4",
  "description": "A field-based introduction to the diversity of ecosystems of the Pacific Northwest coast. Biological and physical processes affecting the distribution, structure, community composition and physical features of these systems are explored through a variety of lectures and field trips. Ecosystem services and human impacts are examined.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "SYMBIOSES AND THE ENVIRONMENT",
  "course_number": "BI 358",
  "credits": "3",
  "description": "Overview of the diversity of mutualistic symbioses and their roles in the natural environment. Integrative approach, from ecosystem to molecule, to the examination of certain key mutualisms. Offered even years",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206", "CH 123", "CH 233", "CH 233H", "CH 263", "CH 263H"]
}, {
  "corequisites": [],
  "course_name": "ECOLOGY",
  "course_number": "BI 370",
  "credits": "3",
  "description": "Examines the interactions between organisms and their biotic and abiotic environments at the population, community, ecosystem, and biosphere levels of organization.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "ECOLOGY",
  "course_number": "BI 370H",
  "credits": "3",
  "description": "Examines the interactions between organisms and their biotic and abiotic environments at the population, community, ecosystem, and biosphere levels of organization.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "^ECOLOGICAL METHODS",
  "course_number": "BI 371",
  "credits": "3",
  "description": "Experimental design, data collection, analysis and synthesis in ecological studies; local ecosystems emphasized.",
  "prerequisites": ["BI 370", "BI 370H"]
}, {
  "corequisites": [],
  "course_name": "^FIELD METHODS IN MARINE ECOLOGY",
  "course_number": "BI 373",
  "credits": "3",
  "description": "Exposure to research methods used in field studies of the marine rocky intertidal ecosystem. Research projects and writing exercises provide students with hands-on experience of collecting, analyzing, and presenting marine ecological data.",
  "prerequisites": ["BI 351", "BI 370", "BI 370H", "ST 351", "ST 351H"]
}, {
  "corequisites": [],
  "course_name": "FIELD METHODS IN ECOLOGICAL RESTORATION",
  "course_number": "BI 375",
  "credits": "4",
  "description": "Observation and application of theory and practice in ecological restoration. Using site visits and hands-on research, explores the roles in restoration of fire, local adaptation, disturbance history, natural history, beaver, and soils, including visits to several active and completed restoration projects and overnights in the field. Lab.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "INTERSECTIONS OF BIODIVERSITY AND BUDDHIST CULTURES IN NEPAL",
  "course_number": "BI 382X",
  "credits": "3",
  "description": "Examines the intersections of biodiversity concepts and Buddhist cultures in the Gaurishankar Conservation Area of Nepal. Investigates Western biodiversity frameworks across scales, from DNA to species to ecosystem. Explores cultural diversity of Himalayan Buddhist traditions in Nepal, and their relationships with nature. Compares Western scientific concepts of biodiversity to Buddhist outlooks on biodiversity.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "BI 399",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "BI 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "BI 401H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "BI 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS: CURATORIAL ASSISTANT",
  "course_number": "BI 406",
  "credits": "1-6",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "BI 407",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "BI 407H",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED TEACHING PRACTICUM",
  "course_number": "BI 409",
  "credits": "1-6",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "BI 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCIENTIFIC ILLUSTRATION",
  "course_number": "BI 419X",
  "credits": "1",
  "description": "Covers basic methods and principles of scientific illustration, focusing on biological topics, through student projects that illustrate organisms or concepts. Media covered include pen and ink, colored pencils, watercolor, as well as some digital tools. Each student will complete one or two illustrations for their term project, as well as a portfolio.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PALEOBIOLOGY",
  "course_number": "BI 427",
  "credits": "4",
  "description": "Fossils provide a direct window into the evolution, extinction, and ecology of past life on Earth. A process-based study of the marine and terrestrial fossil record is taken to explore the topics of preservation, macroevolution, extinction of biotas, biomechanics, paleoecology, and climate change. Required laboratory and weekend field trip.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206", "GEO 203"]
}, {
  "corequisites": [],
  "course_name": "EVOLUTION",
  "course_number": "BI 445",
  "credits": "3",
  "description": "Formal analysis of genetic and ecological mechanisms producing evolutionary change; special topics include speciation, ecological constraints, adaptive radiations, paleontology, biogeography, the origin of life, molecular evolution, and human evolution.",
  "prerequisites": ["BI 311", "BI 311H"]
}, {
  "corequisites": [],
  "course_name": "EVOLUTION",
  "course_number": "BI 445H",
  "credits": "3",
  "description": "Formal analysis of genetic and ecological mechanisms producing evolutionary change; special topics include speciation, ecological constraints, adaptive radiations, paleontology, biogeography, the origin of life, molecular evolution, and human evolution.",
  "prerequisites": ["BI 311", "BI 311H"]
}, {
  "corequisites": [],
  "course_name": "^MARINE BIOLOGY AND ECOLOGY",
  "course_number": "BI 450",
  "credits": "15",
  "description": "A comprehensive lecture and laboratory introduction to the flora and fauna of the marine environment approached from the level of the organism to ecosystem. Ecological patterns and processes characteristic of marine communities will be emphasized. Taught at Hatfield Marine Science Center, Newport, OR.",
  "prerequisites": ["BI 370", "BI 370H", "ST 351", "ST 351H"]
}, {
  "corequisites": [],
  "course_name": "FUNCTIONAL ANATOMY OF THE HUMAN MUSCULAR SYSTEM",
  "course_number": "BI 451",
  "credits": "4",
  "description": "In-depth dissection of the orientation, innervation, and functional significance of muscles and muscle groups. Topics include muscle identification, joint anatomy and variation of human form. Student expectations include vascularization and detailed joint anatomy. The laboratory component will consist of the dissection of the muscular anatomy of a human cadaver. Lab fee.",
  "prerequisites": ["BI 231", "BI 241", "BI 331", "BI 341", "BI 232", "BI 242", "BI 332", "BI 342", "BI 233", "BI 243", "BI 333", "BI 343"]
}, {
  "corequisites": [],
  "course_name": "PHYLOGENETICS",
  "course_number": "BI 456",
  "credits": "4",
  "description": "Explores the theory and practice of modern phylogenetic analysis. Emphasis placed on tree reconstruction algorithms, assessment of statistical support, and contemporary issues in phylogenetics. Lab will focus on the use of phylogenetic software and the analysis of molecular data sets. Offered even years.",
  "prerequisites": ["ST 351", "ST 351H", "ST 352", "ST 411", "BI 311", "BI 311H", "BI 445", "BI 445H"]
}, {
  "corequisites": [],
  "course_name": "BIOGEOGRAPHY",
  "course_number": "BI 481",
  "credits": "3",
  "description": "Biogeography is the study of the distribution of biodiversity. Focuses on abiotic (geological, climatological) and biotic (ecological, evolutionary) factors that govern diversity across space and through time, emphasizing assembly of communities, global change, and conservation in today’s rapidly changing world. Offered odd years.",
  "prerequisites": ["BI 370", "BI 370H"]
}, {
  "corequisites": [],
  "course_name": "POPULATION BIOLOGY",
  "course_number": "BI 483",
  "credits": "3",
  "description": "Theoretical and empirical views of the structure and function of populations from across the tree of life, emphasizing the integration of ecological and evolutionary approaches.",
  "prerequisites": ["MTH 241", "MTH 251", "MTH 251H", "MTH 227", "ST 351", "ST 351H", "ST 352", "ST 411", "BI 311", "BI 311H", "BI 370", "BI 370H"]
}, {
  "corequisites": [],
  "course_name": "MONSTER BIOLOGY",
  "course_number": "BI 485",
  "credits": "3",
  "description": "Scientists seek to explain what exists and why things are. An alternative approach is to ask why things are not. Biological and physical laws are used to critically and rigorously assess why monsters from literature, television and film are not possible in the real world.",
  "prerequisites": ["BI 311", "BI 311H", "BI 370", "BI 370H"]
}, {
  "corequisites": [],
  "course_name": "DISEASE ECOLOGY",
  "course_number": "BI 495",
  "credits": "3",
  "description": "An introduction to disease ecology--the study of disease processes in natural populations and communities. Focuses on (I) the role parasites play in the ecology and evolution of animal populations, including humans; and (II) the relevance of ecological and evolutionary considerations in managing infectious diseases. Not offered every year.",
  "prerequisites": ["BI 370", "BI 370H"]
}, {
  "corequisites": [],
  "course_name": "SENIOR ASSESSMENT AND SURVEY",
  "course_number": "BI 498",
  "credits": "0",
  "description": "Programmatic assessment of the biological knowledge and undergraduate experiences of Biology and Zoology seniors. Students must complete the course CANVAS assignments during their final undergraduate term.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "BI 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "BI 499H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]