[{
  "corequisites": [],
  "course_name": "GREAT EXPERIMENTS IN BIORESOURCE SCIENCES",
  "course_number": "BRR 100",
  "credits": "2",
  "description": "For students interested in BRR and undergraduate research, to introduce the research process and help them start defining research interests and project areas. Faculty describe research projects and experimental approaches, and pose interesting political and ethical questions related to scientific research. Students work with junior and senior student mentors already involved in research projects.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCIENCE AND RESEARCH",
  "course_number": "BRR 200",
  "credits": "2",
  "description": "An introduction to science concepts, professional skills and science literacy for organizing, planning, designing and conducting research in biological, agricultural and natural resource science. Learn the process of research, prepare a resume for prospective research mentors, and work in teams to analyze a timely and relevant problem, formulate experimental approaches to address it, and write a research proposal.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "BRR 299",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENERGY TECHNOLOGY AND SOCIAL CHANGE",
  "course_number": "BRR 325",
  "credits": "3",
  "description": "Science and technology co-evolve with a prosperous human society. Discusses key issues surrounding the interaction between social changes and energy technologies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "BRR 399",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "BRR 401",
  "credits": "1-16",
  "description": "Undergraduate mentored research. Students select a faculty research mentor (from 7 OSU colleges) and complete 14 credits of research. Students follow established guidelines to prepare project proposals, progress reports, and a thesis; learn research methods applicable to their chosen field; gain professional skills and contacts. Students are evaluated on their ability to develop and complete a research project proposal, learn and develop research methodologies, conduct research and trouble-shooting procedures, and demonstrate responsible and ethical participation in the research project. Offered all terms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^THESIS",
  "course_number": "BRR 403",
  "credits": "4",
  "description": "BRR students independently interpret and present their research in writing. Students write the thesis in a style appropriate for submission to a peer-reviewed journal in their chosen scientific discipline. Students receive a letter grade based on their final thesis. Timeliness of reports is factored in student assessments. The student's faculty mentor and the BRR Director provide a consensus grade when the thesis is completed.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WRITING AND CONFERENCE",
  "course_number": "BRR 404",
  "credits": "1-3",
  "description": "Thesis writing for Bioenergy minor and other students.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "BRR 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS-DATA PRESENTATIONS",
  "course_number": "BRR 406",
  "credits": "1",
  "description": "For any student doing research, to learn to develop and evaluate poster and slide presentations containing scientific data. Students are exposed to a variety of scientific disciplines as they prepare and critique their own and other students' posters and oral presentations. Students improve written and oral communication skills. Letter grade is based on participation, improvement, and the quality of a final poster project and oral presentation. Offered winter term. CROSSLISTED as BRR 406/HORT 406.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "BRR 407",
  "credits": "1",
  "description": "For BRR students, to encourage excellence in public speaking. Exposes students to a variety of current seminar topics and provides them with the opportunity to evaluate components of good public seminars. Students receive a grade only after completing a public seminar on their own research (final research seminar). Offered spring term.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM: TEACHING AND PEER MENTORING",
  "course_number": "BRR 409",
  "credits": "2-4",
  "description": "Upper-division BRR students are grouped with lower-division students in BRR 100 to facilitate discussion and encourage dialogue about current research topics. Juniors and seniors Juniors and seniors continue to learn new ways to teach and communicate science issues in written and verbal formats.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "BRR 410",
  "credits": "1-12",
  "description": "Supervised internship allowing students to gain off-campus work experience for credit. Under direction and approval of the program director, students will submit a statement of intent, identify employer contact, and provide a written report upon completion.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "BRR 499",
  "credits": "2",
  "description": "",
  "prerequisites": []
}]