[{
  "corequisites": [],
  "course_name": "CIVIL AND CONSTRUCTION ENGINEERING GRAPHICS AND DESIGN",
  "course_number": "CCE 201",
  "credits": "3",
  "description": "Introduces the engineering design process and graphic skills that are used by civil and construction engineers. Topics include design process, geometric construction, multiviews, auxiliary views, sections, dimensioning, tolerances and engineering drawing standards. Students participate in team design projects and presentations. Graphic and design projects from the areas of civil and construction engineering.",
  "prerequisites": ["MTH 111", "MTH 111Z", "MTH 112", "MTH 112Z", "MTH 241", "MTH 251", "MTH 251H"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO VIRTUAL DESIGN AND CONSTRUCTION",
  "course_number": "CCE 203",
  "credits": "3",
  "description": "Basic principles of virtual design and construction (VDC) focusing on skills required for generating design and construction information models. Parametric modeling and design constraints are introduced. Students will utilize construction drawings and documentation to create accurate 3D models. Use of design and construction information models for making estimates of quantities and cost, and for determination of constructability problems.",
  "prerequisites": ["CCE 201", "ENGR 248"]
}, {
  "corequisites": [],
  "course_name": "CCE SEMINAR",
  "course_number": "CCE 207",
  "credits": "1",
  "description": "Visit construction sites and engineering design offices. Engage with faculty and industry professionals on topics including ethics, resume-writing, interviewing, professionalism in the workplace, understanding the nature and culture of the civil and construction engineering industries.",
  "prerequisites": ["CS 162", "CS 162H", "ENGR 103", "ENGR 103H"]
}, {
  "corequisites": [],
  "course_name": "CIVIL AND CONSTRUCTION ENGINEERING MATERIALS",
  "course_number": "CCE 321",
  "credits": "4",
  "description": "Classify attributes and quantify properties of civil and construction engineering materials including portland cement concrete, asphalt concrete, wood, and metals. Implement and interpret data from standard laboratory material testing methods.",
  "prerequisites": ["ENGR 213", "ENGR 213H"]
}, {
  "corequisites": [],
  "course_name": "CIVIL AND CONSTRUCTION ENGINEERING MATERIALS",
  "course_number": "CCE 321H",
  "credits": "4",
  "description": "Classify attributes and quantify properties of civil and construction engineering materials including portland cement concrete, asphalt concrete, wood, and metals. Implement and interpret data from standard laboratory material testing methods.",
  "prerequisites": ["ENGR 213", "ENGR 213H"]
}, {
  "corequisites": [],
  "course_name": "GREEN BUILDING MATERIALS",
  "course_number": "CCE 422",
  "credits": "3",
  "description": "Introduces concepts of construction with green building materials. Specific concepts include evaluation of what truly makes a material \"green\", long-term performance (e.g., durability) of materials, material production and life cycle cost analysis. Concepts of green building programs, guidelines and specifications will be introduced.",
  "prerequisites": ["CCE 321", "CCE 321H"]
}, {
  "corequisites": [],
  "course_name": "CONCRETE FUNDAMENTALS",
  "course_number": "CCE 423",
  "credits": "4",
  "description": "Portland cement hydration, microstructural development, fresh and hardened properties, testing standards, durability, alternative cements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ASPHALT FUNDAMENTALS",
  "course_number": "CCE 424",
  "credits": "3",
  "description": "Focuses on characterization of asphalt materials and mixtures, current laboratory testing technology for asphalt binders and mixes, engineering of asphalt mixes to meet design requirements, asphalt recycling process, environmental impacts of asphalt pavements, and recent developments in asphalt technology.",
  "prerequisites": ["CCE 321"]
}, {
  "corequisites": [],
  "course_name": "FOREST TO FRAME: MASS TIMBER",
  "course_number": "CCE 492",
  "credits": "3",
  "description": "Critically examines the benefits of using mass timber with particular emphasis on its raw materials, manufacturing process, and engineering properties. Applies fundamental engineering concept to design gravity and lateral systems with mass timber including new innovations like hybrid structures. Integrates durability attributes, environmental, and social impacts to holistically analyze mass timber design within entire supply chain. CROSSLISTED as CCE 492/WSE 492.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "CCE 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS IN INFRASTRUCTURE MATERIALS",
  "course_number": "CCE 520",
  "credits": "0-4",
  "description": "A critical examination of in-depth topics selected by the instructor from among topics not covered in other infrastructure materials courses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GREEN BUILDING MATERIALS",
  "course_number": "CCE 522",
  "credits": "3",
  "description": "Introduces concepts of construction with green building materials. Specific concepts include evaluation of what truly makes a material \"green\", long-term performance (e.g., durability) of materials, material production and life cycle cost analysis. Concepts of green building programs, guidelines and specifications will be introduced.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CONCRETE FUNDAMENTALS",
  "course_number": "CCE 523",
  "credits": "4",
  "description": "Portland cement hydration, microstructural development, fresh and hardened properties, testing standards, durability, alternative cements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ASPHALT FUNDAMENTALS",
  "course_number": "CCE 524",
  "credits": "3",
  "description": "Focuses on characterization of asphalt materials and mixtures, current laboratory testing technology for asphalt binders and mixes, engineering of asphalt mixes to meet design requirements, asphalt recycling process, environmental impacts of asphalt pavements, and recent developments in asphalt technology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CONSTRUCTION SITE SYSTEMS ENGINEERING",
  "course_number": "CCE 525",
  "credits": "3",
  "description": "Design and planning of construction site field operations and engineered systems. Systems analysis and design as it applies to civil engineering projects. Design of construction systems: blasting; rock crushing and conveying; dewatering; cranes, pile driving, and rigging; and concrete pumping and placement. Construction site design and process design.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DESIGN FOR SAFETY",
  "course_number": "CCE 526",
  "credits": "3",
  "description": "Theoretical concepts and industry practices used to model, evaluate, and improve construction worker safety through the design of the project features, construction operations, and site safety program elements. Causes of construction site accidents, hazard recognition and comprehension, safety risk valuation and mitigation, and the true costs of injuries and fatalities.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED VIRTUAL DESIGN AND CONSTRUCTION",
  "course_number": "CCE 528",
  "credits": "4",
  "description": "Focusing on the skills and information needed to effectively use an existing Building Information Model (BIM) in plan execution for a building construction project. This is a project based course where students gain knowledge on the implementation of BIM concepts throughout the lifecycle of a building, from planning and design, to construction and operations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEAN CONSTRUCTION",
  "course_number": "CCE 529",
  "credits": "3",
  "description": "Introduction to the basics of lean production management, especially about how they are applied to the AEC industry to improve the operation management and product development. Class topics include theory of manufacturing science, principles of the lean production system, application of production management to project management, variability management in design and construction, improving project performance in the AEC industry, data gathering and process evaluation for productivity improvement.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECT RISK MANAGEMENT",
  "course_number": "CCE 552",
  "credits": "4",
  "description": "An introduction to the concept of project risk in producing constructed engineering projects. Course content includes project baselining, risk definition and identification, risk assessment and management techniques, risk control, risk response, and risk management. CROSSLISTED as CCE 552/EMGT 552.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL RESPONSIBILITY AND ETHICS",
  "course_number": "CCE 554",
  "credits": "3",
  "description": "An in-depth exploration of professional engineering ethics. Course content includes conceptual theoretical basis of ethics, ethics among professional organizations, ethical consideration of design, critical analysis of ethical situations, ethics in the workplace, and ethical considerations regarding the broader environment. CROSSLISTED as CCE 554/EMGT 554.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HYDROGRAPHIC SURVEYING",
  "course_number": "CCE 561",
  "credits": "3",
  "description": "Covers the fundamentals of hydrographic surveys performed to measure the depth and bottom configuration of water bodies in support of nautical charting and other areas of marine geomatics, as well as marine construction, benthic habitat mapping, marine spatial planning, and bathymetric mapping of rivers and lakes. Topics include underwater acoustics, sound velocity, the sonar equation, types of sonar systems (e.g., single-beam, multibeam, side scan sonar), water levels and tidal datums, positioning and motion sensing for hydrographic surveying, bathymetric lidar, and applications of hydrographic surveying.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "CCE 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DURABILITY AND CONDITION ASSESSMENT OF REINFORCED CONCRETE",
  "course_number": "CCE 621",
  "credits": "4",
  "description": "Concrete durability including freeze-thaw attack, sulfate attack, corrosion, alkali-silica reaction, long-term performance, durability modeling, durability of alternative cements. Non-destructive condition assessment; model-assisted testing; corrosion detection and monitoring; multi-scale assessment; service/remaining life predictions.",
  "prerequisites": ["CCE 523"]
}, {
  "corequisites": [],
  "course_name": "CORROSION OF METALS AND CORROSION CONTROL",
  "course_number": "CCE 623",
  "credits": "4",
  "description": "Corrosion science and corrosion engineering of metals in various environments. Thermodynamics of corrosion. Electrode kinetics and rates of corrosion. Mixed potential theory. Passivity. Measurement of corrosion. Corrosion prevention through materials selection, design, cathodic and anodic protection and coatings. Discussion of critical material-environment combinations such as corrosion of oil/gas pipelines, corrosion of steel in concrete, corrosion in marine environments, microbially induced corrosion (MIC), corrosion of implants in biological media. Cost of corrosion.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SERVICE LIFE MODELING OF INFRASTRUCTURE MATERIALS",
  "course_number": "CCE 624",
  "credits": "4",
  "description": "Service life modeling for infrastructure materials. Solution of generic boundary and initial value problems related to material deterioration. Heat and moisture transport modeling in porous media. Multi-species and multi-mechanism ionic transport in porous media. Reactive-transport modeling. Coupled problems. Corrosion modeling. Introduction to non-linear problems. Introduction to thermodynamic modeling.",
  "prerequisites": []
}]