[{
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ED 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PURPOSE",
  "course_number": "ED 216",
  "credits": "STRUCTURE",
  "description": "Introduction to the historical, social, philosophical, political, legal and economic foundations of education in Oregon, the United States, and other countries in order to provide a framework from which to analyze contemporary educational and environmental issues in various schools, communities, and workplaces.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PURPOSE",
  "course_number": "ED 216H",
  "credits": "STRUCTURE",
  "description": "Introduction to the historical, social, philosophical, political, legal and economic foundations of education in Oregon, the United States, and other countries in order to provide a framework from which to analyze contemporary educational and environmental issues in various schools, communities, and workplaces.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SOCIAL JUSTICE,CIVIL RIGHTS & MULTICULTURALISM IN EDUCATION",
  "course_number": "ED 219",
  "credits": "3",
  "description": "Covers examination of equity and injustice based on social groupings such as race, gender, language, and ability. Discusses equitable approaches and power in systems and institutions of society (e.g., schooling, curriculum, educational policy) and how to actively make change. Reviews contemplation of multiculturalism and personal experiences through a wholeness approach.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SOCIAL JUSTICE,CIVIL RIGHTS & MULTICULTURALISM IN EDUCATION",
  "course_number": "ED 219H",
  "credits": "3",
  "description": "Covers examination of equity and injustice based on social groupings such as race, gender, language, and ability. Discusses equitable approaches and power in systems and institutions of society (e.g., schooling, curriculum, educational policy) and how to actively make change. Reviews contemplation of multiculturalism and personal experiences through a wholeness approach.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEARNING ACROSS THE LIFESPAN",
  "course_number": "ED 253",
  "credits": "3",
  "description": "An exploration of how learning occurs at all ages from early childhood through adulthood. Covers major and emerging theories and styles, self-reflection on implications of how learning occurs for self and others, and the impact of these issues on the development and delivery of instruction.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ED 299",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FIELD PRACTICUM",
  "course_number": "ED 309",
  "credits": "1-7",
  "description": "Placement in either an elementary, middle or secondary school. To assist students to develop competencies in dealing with children or adolescents according to the individual major of the university student.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP/WORK EXPERIENCE",
  "course_number": "ED 310",
  "credits": "1-18",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TRAUMA-INFORMED CARE IN EDUCATION",
  "course_number": "ED 325",
  "credits": "3",
  "description": "Examines the need for trauma-informed care principles in the field of K-12 education and beyond. Explores various trauma-informed care practices and assesses the impact of trauma on brain function in youth as related to K-12 education and learning.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^SUPPORTIVE DIFFERENTIATED ENVIRONMENTS",
  "course_number": "ED 340",
  "credits": "3",
  "description": "Addresses special abilities and needs of learners and helps prepare teachers to develop strategies and instructional practices for diverse learners and students with exceptionalities in a supportive and inclusive classroom.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DIFFERENTIATION IN THE ELEMENTARY CLASSROOM",
  "course_number": "ED 394",
  "credits": "2",
  "description": "The role of culture, language, and group identification in learning will be examined and applied to the consideration of differentiated instructional strategies in grades K-5. Students will learn strategies teachers use to help differentiate instruction to meet the diverse needs of students in the elementary classroom.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ED 399",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "ED 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "ED 402",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "ED 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "ED 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "ED 406",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "ED 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "ED 407H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "ED 408",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM/CLINICAL EXPERIENCE",
  "course_number": "ED 409",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP/WORK EXPERIENCE",
  "course_number": "ED 410",
  "credits": "1-18",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED EDUCATIONAL PSYCHOLOGY IN K-12 SCHOOLS",
  "course_number": "ED 411",
  "credits": "3",
  "description": "Provides students with an opportunity to advance their knowledge and understanding of the theories and principles of psychology as applied to teaching and learning. Examines psychological factors that focus on and influence instruction, classroom management, and assessment. Applies theories and concepts related to development, student differences and diversity, learning and thinking, and motivation to real-world classrooms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEARNING STYLES AND NEEDS IN ADOLESCENCE",
  "course_number": "ED 412",
  "credits": "2",
  "description": "Exploration of the particular learning styles and needs of the adolescent, major and emerging learning theories, individual learning styles including one's own learning styles, self-reflection on implications of how learning occurs, and the impact of these issues on the development and delivery of instruction.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEARNING ENVIRONMENTS I: FOSTERING CLASS ENGAGEMENT",
  "course_number": "ED 413",
  "credits": "3",
  "description": "Creating a positive culture in the classroom, managing student behavior, and engaging students in critical learning discourse are challenges faced by all educators. Students will learn to develop the components of a productive and safe learning environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEARNING ENVIRONMENTS II: ADVANCING EVERY STUDENT",
  "course_number": "ED 414",
  "credits": "2",
  "description": "Students will expand their knowledge about constructing a positive K-12 classroom environment to a productive learning environment accommodated to fit the needs of a diversified student population.",
  "prerequisites": [["ED 413"]]
}, {
  "corequisites": [],
  "course_name": "CLASSROOM MANAGEMENT",
  "course_number": "ED 420",
  "credits": "3",
  "description": "Build knowledge and learn techniques for cultivating a positive learning environment and for managing classrooms. Learn through examining the literature and observing relevant learning environments and classrooms. Explore factors that influence student behavior, including those associated with social and/or multicultural student populations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEACHER AS REFLECTIVE PRACTITIONER",
  "course_number": "ED 424",
  "credits": "2",
  "description": "Designed to help teachers make complex judgments based upon their knowledge and understanding of their students, the curriculum, and larger social and cultural issues through reflective practice. Problem solving related to teaching with strong focus on generating new knowledge about teaching, learning, and assessment.",
  "prerequisites": [["ED 407"], ["ED 410"]]
}, {
  "corequisites": [],
  "course_name": "CURRICULUM DESIGN AND INSTRUCTIONAL METHODS",
  "course_number": "ED 425",
  "credits": "3",
  "description": "Examines the relationship of theory to practice in teaching the content areas in grades 7-12. Explores general curriculum trends as well as content selection in specific endorsement/subject areas. Prepares students for and is coordinated with part-time student teaching.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ASSESSMENT FOR K-12 INSTRUCTION",
  "course_number": "ED 427",
  "credits": "2",
  "description": "Students study and practice the administration, interpretation, and design of assessments for groups and individuals within the content area. Students will develop an understanding of a variety of assessment strategies for K-12 education that will enhance their understandings of the role of assessment in learning and curriculum design.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSTRUCTIONAL DESIGN FOR K-12 FORMAL AND INFORMAL EDUCATION",
  "course_number": "ED 430",
  "credits": "3",
  "description": "Prepares for teaching K-12 learners in traditional classroom settings as well as informal learning environments such as nature centers, after school care, and summer camps. Builds knowledge and skills in curriculum design, instructional strategies, and assessment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HUMAN DEVELOPMENT AND PSYCHOLOGY OF THE ADOLESCENT",
  "course_number": "ED 440",
  "credits": "3",
  "description": "Examines research from psychology, human development, and neuroscience to provide a holistic understanding of adolescents and learning with a focus on the middle/secondary student. Investigates the influence of family, neighborhood, peer, and school contexts on brain development; identity formation; and the challenges and opportunities of adolescence.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEACHING IN INCLUSIVE CLASSROOMS",
  "course_number": "ED 448",
  "credits": "2",
  "description": "Explores the broad range of needs that are represented in today’s classrooms. Addresses various types and characteristics of learners as well as ways to collaborate with specialists and families in the delivery of federally-mandated support services for students with (dis)abilities. Discusses strategies and promising practices to enhance the learning of diverse students in the inclusive classroom.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF EDUCATION AND PLANNING",
  "course_number": "ED 450",
  "credits": "4",
  "description": "The first of three courses examining the iterative cycle of curriculum planning, instruction and assessment. An introduction to learning theory and the relationship between teaching and learning provide the foundation. An overview of the complete teaching cycle leads to a focus on curriculum planning based on state standards.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^ASSESSMENT",
  "course_number": "ED 451",
  "credits": "4",
  "description": "Assessment for and of learning and its importance to student engagement and advancement. Formal and informal writing derived from multiple revisions will result in documents intended for different audiences including parents, school administrators, and national assessment prompts citing research-based practices.",
  "prerequisites": [["ED 450"]]
}, {
  "corequisites": [],
  "course_name": "USING DATA TO SUPPORT ALL STUDENTS",
  "course_number": "ED 452",
  "credits": "3",
  "description": "Teacher candidates will gather and analyze student data to inform instructional practice devoted to enhancing student learning; develop data literacy skills; differentiate instruction for targeted groups and individualized student learners while continuing to foster higher-order thinking and communication skills in the whole class: analyze patterns and gaps in individualized student learning; apply differentiated instruction and assessment strategies to support student growth; engage learners in goal setting; and identify teaching and assessment strategies to work with students with exceptional needs.",
  "prerequisites": [["ED 451"]]
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR TEACHING LANGUAGE ARTS AND SOCIAL STUDIES",
  "course_number": "ED 456",
  "credits": "3",
  "description": "Exploration of language arts and social studies programs (e.g., children's literature, writing, special needs, spelling, and cultural factors). Development of research-based teaching strategies and assessment. Focuses on the development of inquiry approaches that reflect interdisciplinary curriculum as well as subject-specific pedagogy in the teaching of both social studies and language arts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEACHING ELEMENTARY MATHEMATICS FOR UNDERSTANDING",
  "course_number": "ED 457",
  "credits": "3",
  "description": "Explores the teaching of mathematics in K-8 classrooms in a manner consistent with state and national standards. Students learn teaching strategies that incorporate the development of mathematical models and mental constructs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR TEACHING WELLNESS AND FINE ARTS",
  "course_number": "ED 458",
  "credits": "2",
  "description": "Exploration of recent trends and research-based practices in the teaching of wellness, physical education, and fine arts. Includes strategies, assessments, special needs, integrating curriculum through developmentally appropriate practices, content standards, and the value of developing holistic learners though an effective wellness and fine arts program.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR TEACHING HUMANITIES",
  "course_number": "ED 459",
  "credits": "3",
  "description": "Examines theory, pedagogy, and integration of language arts and social science in multiple-subject classrooms to develop appropriate daily lessons and unit plans in a manner consistent with current research and standards. Focuses on inquiry approaches that reflect interdisciplinary curriculum as well as subject specific pedagogy in the teaching of both social science and language arts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR TEACHING PHYSICAL EDUCATION HEALTH & WELLNESS",
  "course_number": "ED 463",
  "credits": "1",
  "description": "Exploration of recent trends and research-based practices in the teaching of physical education, health, and wellness in elementary school. Includes instructional strategies for developing holistic learners though an effective wellness program.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELEMENTARY METHODS: LITERACY",
  "course_number": "ED 465",
  "credits": "2-4",
  "description": "Understanding the theoretical and developmental foundations for literacy programs K-5; targeted reading, writing, listening, vocabulary, and speaking skill needs assessments; organizational strategies for teaching literacy; understanding dyslexia and how to differentiate instruction for students with dyslexia; and the integration of cultural diversity and social justice into literacy learning.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELEMENTARY METHODS II: MATHEMATICS",
  "course_number": "ED 466",
  "credits": "4",
  "description": "Exploration of the teaching of early childhood/elementary school mathematics with emphases on problem solving, connections, representation, communication, reasoning and proof. Course will incorporate the development of mathematical models and mental constructs. Research-based, developmentally appropriate and culturally relevant practices will be incorporated into lessons.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELEMENTARY METHODS III: NATURAL AND SOCIAL SCIENCE",
  "course_number": "ED 467",
  "credits": "4",
  "description": "Inquiry approaches to the teaching and learning of the natural and social sciences are used to explore the structure of the disciplines and support the creation of instructional units that develop disciplinary knowledge and practices/skills while highlighting cross-cutting themes. Scientific literacy and civic competence are emphasized.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELEMENTARY METHODS IV: LANGUAGE ARTS",
  "course_number": "ED 468",
  "credits": "4",
  "description": "Development of pedagogy in teaching of reading to elementary-aged students, including the teaching of vocabulary, comprehension, phonics, fluency and motivation to read. Use of children's literature, assessment approaches, and special needs students are also addressed. Gain a deeper level of understanding in how to differentiate the teaching of reading at grades K-5, how to run a Writers’ Workshop, and how to integrate literacy into other content areas.",
  "prerequisites": [["ED 465"]]
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR TEACHING THE FINE ARTS",
  "course_number": "ED 469",
  "credits": "1",
  "description": "Exploration of recent trends and research-based practices in the teaching of performing arts (dance, music, theater) and the visual arts in elementary school. Includes instructional strategies for developing holistic learners though an effective fine arts program.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BILITERACY INSTRUCTION",
  "course_number": "ED 470",
  "credits": "3",
  "description": "Explores literacy development in Spanish and English. Examines differences in literacy development across the two languages, as well as pedagogical approaches that leverage students' home language and literacy practices. Explores equity and bias in classroom language practices. Taught bilingually in Spanish and English.",
  "prerequisites": [["ED 472"]]
}, {
  "corequisites": [],
  "course_name": "MULTILINGUAL LINGUISTICS",
  "course_number": "ED 471",
  "credits": "3",
  "description": "Explores linguistic categories: phonology, morphology, syntax, semantics, pragmatics, and discourse. Focuses on academic language development and teaching implications for emergent bilingual students in Spanish-English K-12 dual language programs. Taught bilingually in Spanish and English.",
  "prerequisites": [["ED 472"]]
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF ESOL EDUCATION",
  "course_number": "ED 472",
  "credits": "3",
  "description": "Examines characteristics of English language learners (ELLs), key theories in language acquisition, the role of culture in language development, and instructional program models for ELLs, while considering implications for classroom instruction.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSTRUCTIONAL APPROACHES FOR ESOL EDUCATION",
  "course_number": "ED 473",
  "credits": "3",
  "description": "Examines characteristics of standards-based content-area instruction for emergent bilinguals. Includes integration of content and language development, classroom-based assessment, and use of technology to support student learning.",
  "prerequisites": [["ED 472"]]
}, {
  "corequisites": [],
  "course_name": "PROJECT-BASED MATHEMATICS",
  "course_number": "ED 474",
  "credits": "3",
  "description": "Building on the foundational concepts covered in ED 457 and ED 466/ED 566, students will plan and apply project-based lessons. Students will transfer knowledge and skills of mathematics to real world problems and will learn to teach with a project-based approach.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTEGRATED STEM",
  "course_number": "ED 475",
  "credits": "3",
  "description": "Students will continue to develop their pedagogical content knowledge in science, technology, engineering, mathematics, and integrated STEM. Students will develop a deeper understanding of the crosscutting concepts common to all science endeavors and will learn how to use these concepts to bridge across science or STEM curriculum units. Students will also examine and develop expertise in using science and engineering practices to lead students in authentic inquiry. Integrating crosscutting concepts, science and engineering practices, and disciplinary core ideas, students will learn and practice the development of curriculum and instruction utilizing the engineering design process.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PARTNERSHIPS AND IDEOLOGIES IN ESOL EDUCATION",
  "course_number": "ED 476",
  "credits": "3",
  "description": "Considers social and political issues pertaining to educating English language learners. Focuses on exploring multiple ideologies in ESOL and building partnerships across schools, families, and communities.",
  "prerequisites": [["ED 472"]]
}, {
  "corequisites": [],
  "course_name": "DIFFERENTIATION FOR STUDENTS WITH SPECIAL NEEDS",
  "course_number": "ED 477",
  "credits": "3",
  "description": "Building on the foundational concepts covered in HDFS 431, this course goes into greater depth on how to provide students with a range of exceptionalities with education in the least restrictive environment. Teacher candidates will explore differentiated instruction techniques for students with special needs that can be used in both the regular education and pull out Special Education resource classrooms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL EDUCATION LAW RIGHTS AND REGULATIONS",
  "course_number": "ED 478",
  "credits": "3",
  "description": "In-depth review of special education law and regulations that protect and provide educational rights for students with disabilities. Teacher candidates will leave the class understanding both the historical and current legal rights of students receiving special education and how to best meet those rights in both the regular and special education resource classrooms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LINGUISTICS FOR TEACHERS",
  "course_number": "ED 479",
  "credits": "3",
  "description": "Explores linguistic categories: phonology, morphology, syntax, semantics, pragmatics, and discourse. Focuses on teaching implications--from psycholinguistic, sociolinguistic, and critical perspectives--for emergent bilingual students in P-12 contexts.",
  "prerequisites": [["ED 472"]]
}, {
  "corequisites": [],
  "course_name": "READING AND WRITING FOR SECONDARY LEARNERS IN CONTEXT",
  "course_number": "ED 481",
  "credits": "3",
  "description": "Enhance and reinforce the authentic reading and writing embedded within occupationally relevant materials to prepare Career and Technical Education teachers for licensure.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR DEVELOPING LITERACY",
  "course_number": "ED 482",
  "credits": "3",
  "description": "Explores approaches to the teaching of reading in multiple-subjects classrooms in a manner consistent with current research and standards. Introduces pedagogical techniques and assessment to teaching vocabulary, comprehension, phonics, and fluency. Addresses strategies related to motivation to read, dyslexia, integration of cultural diversity and social justice and the needs of diverse learners in literacy development.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DEVELOPMENTAL READING",
  "course_number": "ED 483",
  "credits": "3",
  "description": "Development of pedagogy in teaching of reading to elementary-aged students, including teaching of vocabulary, comprehension, phonics, fluency and motivation to read. Use of children's literature, assessment approaches, and special needs students are also addressed.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TECHNOLOGY TOOLS FOR TEACHING",
  "course_number": "ED 492",
  "credits": "1",
  "description": "Develops technology skills needed to be successful as a classroom teacher. Explores how digital tools can be used in instruction, assessment, communication, and collaboration in educational settings to bring vibrant energy into student learning and engagement. Covers responsible digital citizenship, responsible use and ethics of technology in the classroom.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING",
  "course_number": "ED 493",
  "credits": "LITERATURE",
  "description": "Examination of reading, literature, and language development methods that can be used by middle school and high school teachers to support students' learning of content area information. Development of specific reading strategies in content areas.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CONTENT STANDARDS AND CURRICULUM DEVELOPMENT FOR HIGH SCHOOL",
  "course_number": "ED 494",
  "credits": "3",
  "description": "Exploration of content standards, materials and methods appropriate for high school students. Develops skills in work sample methodology through the design of effective instruction, integrating a variety of methods with existing understandings of content area, how people learn, and the diverse communities in which they work.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TECHNOLOGY FOR EDUCATORS",
  "course_number": "ED 496",
  "credits": "3",
  "description": "Explore the integration of current and emerging technologies into K-12 content areas by engaging learners in real world issues and learning in a social context. Integrate technologies that promote critical thinking, communication, collaboration, and creativity. Discuss technologies in terms of cultural linguistic diversity. Gain transferable skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ED 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "ED 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "ED 502",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "ED 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING & CONFERENCE",
  "course_number": "ED 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "ED 506",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "ED 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "ED 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "ED 509",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "ED 510",
  "credits": "1-18",
  "description": "By special permission and arrangement.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEARNING ENVIRONMENTS I: FOSTERING CLASS ENGAGEMENT",
  "course_number": "ED 513",
  "credits": "3",
  "description": "Creating a positive culture in the classroom, managing student behavior, and engaging students in critical learning discourse are challenges faced by all educators. Students will learn to develop the components of a productive and safe learning environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEARNING ENVIRONMENTS II: ADVANCING EVERY STUDENT",
  "course_number": "ED 514",
  "credits": "2",
  "description": "Students will expand their knowledge about constructing a positive K-12 classroom environment to a productive learning environment accommodated to fit the needs of a diversified student population.",
  "prerequisites": [["ED 513"]]
}, {
  "corequisites": [],
  "course_name": "LEARNING ENVIRONMENTS III: CULTURES AND COMMUNITIES",
  "course_number": "ED 515",
  "credits": "2",
  "description": "The third in a series of courses to assist the Teacher candidate in developing a classroom culture of learning that challenges every student to succeed and thrive. Teacher candidates will understand the important role that culture and community play in the teaching and learning process, and develop culturally responsive teaching practices.",
  "prerequisites": [["ED 513"], ["ED 514"]]
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL PRACTICE IN THE TEACHING COMMUNITY",
  "course_number": "ED 518",
  "credits": "2",
  "description": "The professional themes of communication, collaboration, reflection, knowledge of learners, professional ethics, social justice and cultural understanding will be explored and applied to teaching contexts, behaviors, dispositions, and actions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CAPSTONE: TEACHING AS A PROFESSION",
  "course_number": "ED 519",
  "credits": "3",
  "description": "Capstone course for the MAT in which teacher candidates further develop their educational philosophy and analyze their professional growth in alignment with national standards.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CLASSROOM MANAGEMENT",
  "course_number": "ED 520",
  "credits": "3",
  "description": "Build knowledge and learn techniques for cultivating a positive learning environment and for managing classrooms. Learn through examining the literature and observing relevant learning environments and classrooms. Explore factors that influence student behavior, including those associated with social and/or multicultural student populations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FUNDS OF KNOWLEDGE IN EDUCATION",
  "course_number": "ED 521",
  "credits": "3",
  "description": "Introduces models of culturally sustaining education and develops cultural competence by using a funds of knowledge approach. Combines fieldwork and ethnographic research methods with readings and class discussion to help teachers promote their own cultural competence relative to the students they serve. Explores teachers’ own funds of knowledge as well as their students' through exploring their community and developing activities centered on learners' own connections, resources, and cultural wealth.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RACIAL AND CULTURAL HARMONY IN THE K-12 CLASSROOM",
  "course_number": "ED 522",
  "credits": "3",
  "description": "An overview of many issues relevant to the increasingly diverse student population in public schools today. It explores how a culturally competent perspective can be incorporated into curriculum design, teaching strategies, and interactions with students and parents. The course is both self-directed and communal, requiring students to respond to the materials and each other, yet at their own pace.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEACHER AS REFLECTIVE PRACTITIONER",
  "course_number": "ED 524",
  "credits": "2-3",
  "description": "Designed to help teachers make complex judgements based upon their knowledge and understanding of their students, the curriculum, and larger social and cultural issues through reflective practice. Problem solving related to teaching with strong focus on generating new knowledge about teaching, learning, and assessment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ASSESSMENT FOR LEARNING",
  "course_number": "ED 528",
  "credits": "3",
  "description": "Applies the formative learning cycle to through development of an assessment plan. Examines various formative assessment practices that promote higher order thinking and empower students to show evidence of their learning through self-assessment and feedback.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCIENCE METHODS I: INQUIRY AND THE NATURE OF SCIENCE",
  "course_number": "ED 531",
  "credits": "4",
  "description": "Introduction to (1) fundamentals of science teaching including the nature of science and inquiry, (2) designing instructional sequences and selecting curriculum resources aligned to state science standards and research-based learning progressions, (3) effective teaching moves, (4) supporting acquisition of academic language, and (5) productive and safe science learning environments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCIENCE METHODS II: SUPPORTING STUDENTS' CONCEPTUAL CHANGE",
  "course_number": "ED 532",
  "credits": "4",
  "description": "Development of skill in identifying and addressing misconceptions or naive conceptions as part of the individualized conceptual change process. Integration of technology tools for instruction and assessment. Development of high-leverage science teaching practices with a focus on enhancing classroom discourse and evidence-based argumentation with a survey of science curriculum models.",
  "prerequisites": [["ED 531"]]
}, {
  "corequisites": [],
  "course_name": "SCIENCE METHODS III: SCIENCE FOR ALL LEARNERS",
  "course_number": "ED 533",
  "credits": "4",
  "description": "Teaching science as a community of practice means addressing the needs of all learners, particularly those underrepresented in science. Uses technology to enhance high-leverage teaching practices and practices safe and effective laboratory teaching methods. Explores contextualized and interdisciplinary approaches to science education.",
  "prerequisites": [["ED 531"], ["ED 532"]]
}, {
  "corequisites": [],
  "course_name": "MATHEMATICAL METHODS I: FOUNDATIONS OF NUMERICAL THOUGHT",
  "course_number": "ED 537",
  "credits": "4",
  "description": "Introduces the fundamentals of mathematics teaching including the nature and goals of mathematical thinking, numeracy, inquiry, and related academic language of mathematics. Introduces the high high-leverage practices of ambitious mathematics teaching, designing instructional sequences and selecting curriculum resources aligned to state science standards and research-based learning progressions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MATHEMATICS METHODS II: CYCLES OF ENACTMENT",
  "course_number": "ED 538",
  "credits": "4",
  "description": "Teacher candidates create instructional units based on student knowledge and skill while attending to needed accommodations. Designed to help the teacher candidate select or modify instructional materials based on student prior knowledge, experience, and interests; make accommodations for students; and provide for multiple representations across a unit of instruction.",
  "prerequisites": [["ED 537"]]
}, {
  "corequisites": [],
  "course_name": "MATHEMATICAL METHODS III: MATHEMATICS FOR EVERY LEARNER",
  "course_number": "ED 539",
  "credits": "4",
  "description": "Teacher candidates will develop practices that support all students, regardless of background or ability. The teacher candidate will design a unit of instruction with complex learning goals that are cross- and multi-disciplinary, draw on multiple perspectives, and invoke higher order thinking and communication skills.",
  "prerequisites": [["ED 537"], ["ED 538"]]
}, {
  "corequisites": [],
  "course_name": "HUMAN DEVELOPMENT AND PSYCHOLOGY OF THE ADOLESCENT",
  "course_number": "ED 540",
  "credits": "3",
  "description": "Examines research from psychology, human development, and neuroscience to provide a holistic understanding of adolescents and learning with a focus on the middle/secondary student. Investigates the influence of family, neighborhood, peer, and school contexts on brain development; identity formation; and the challenges and opportunities of adolescence.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEACHING INCLUSIVE CLASSROOMS",
  "course_number": "ED 548",
  "credits": "2",
  "description": "Explores the broad range of needs that are represented in today’s classrooms. Addresses various types and characteristics of learners as well as ways to collaborate with specialists and families in the delivery of federally-mandated support services for students with (dis)abilities. Discusses strategies and promising practices to enhance the learning of diverse students in the inclusive classroom.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE EFFECTIVE TEACHING CYCLE I: FOUNDATIONS AND PLANNING",
  "course_number": "ED 550",
  "credits": "4",
  "description": "The first of three courses examining the iterative cycle of curriculum planning, instruction, and assessment. An introduction to learning theory and the relationship between teaching and learning provides the foundation. An overview of the complete teaching cycle leads to a focus on curriculum planning based on state standards.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE EFFECTIVE TEACHING CYCLE II: ASSESSMENT",
  "course_number": "ED 551",
  "credits": "4",
  "description": "The second of three courses examining the iterative cycle of curriculum planning, instruction, and assessment. Learning in this class will concentrate on assessment for and of learning and its importance to student engagement and advancement.",
  "prerequisites": [["ED 550"]]
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR TEACHING WELLNESS AND FINE ARTS",
  "course_number": "ED 558",
  "credits": "2",
  "description": "Exploration of recent trends and research-based practices in the teaching of wellness, physical education, and fine arts. Includes strategies, assessments, special needs, integrating curriculum through developmentally appropriate practices, content standards, and the value of developing holistic learners though an effective wellness and fine arts program.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR TEACHING HUMANITIES",
  "course_number": "ED 559",
  "credits": "3",
  "description": "Examines theory, pedagogy, and integration of language arts and social science in multiple-subject classrooms to develop appropriate daily lessons and unit plans in a manner consistent with current research and standards. Focuses on inquiry approaches that reflect interdisciplinary curriculum as well as subject specific pedagogy in the teaching of both social science and language arts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CHANGES IN ESOL EDUCATION",
  "course_number": "ED 560",
  "credits": "3",
  "description": "Explores recent developments in education for K-12 emergent bilingual students, examining changes in theory, policy, and instruction. Practice-based projects draw on new language acquisition theories to address both language and content-knowledge development. Course work intended for K-12 teachers who earned an ESOL endorsement more than five years ago, as well as those with equivalent background knowledge.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR TEACHING PHYSICAL EDUCATION HEALTH & WELLNESS",
  "course_number": "ED 563",
  "credits": "1",
  "description": "Exploration of recent trends and research-based practices in the teaching of physical education, health, and wellness in elementary school. Includes instructional strategies for developing holistic learners though an effective wellness program.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELEMENTARY METHODS: LITERACY",
  "course_number": "ED 565",
  "credits": "2-4",
  "description": "Understanding the theoretical and developmental foundations for literacy programs K-5; targeted reading, writing, listening, vocabulary, and speaking skill needs assessments; organizational strategies for teaching literacy; understanding dyslexia and how to differentiate instruction for students with dyslexia; and the integration of cultural diversity and social justice into literacy learning.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELEMENTARY METHODS: MATHEMATICS",
  "course_number": "ED 566",
  "credits": "4",
  "description": "Exploration of the teaching of early childhood/elementary school mathematics with emphases on problem solving, connections, representation, communication, reasoning and proof. Course will incorporate the development of mathematical models and mental constructs. Research-based, developmentally appropriate and culturally relevant practices will be incorporated into lessons.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELEMENTARY METHODS: NATURAL AND SOCIAL SCIENCE",
  "course_number": "ED 567",
  "credits": "4",
  "description": "Inquiry approaches to the teaching and learning of the natural and social sciences are used to explore the structure of the disciplines and support the creation of instructional units that develop disciplinary knowledge and practices/skills while highlighting cross-cutting themes. Scientific literacy and civic competence are emphasized.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR TEACHING THE FINE ARTS",
  "course_number": "ED 569",
  "credits": "1",
  "description": "Exploration of recent trends and research-based practices in the teaching of performing arts (dance, music, theater) and the visual arts in elementary school. Includes instructional strategies for developing holistic learners though an effective fine arts program.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BILITERACY INSTRUCTION",
  "course_number": "ED 570",
  "credits": "3",
  "description": "Explores literacy development in Spanish and English. Examines differences in literacy development across the two languages, as well as pedagogical approaches that leverage students' home language and literacy practices. Explores equity and bias in classroom language practices. Taught bilingually in Spanish and English.",
  "prerequisites": [["ED 572"]]
}, {
  "corequisites": [],
  "course_name": "MULTILINGUAL LINGUISTICS",
  "course_number": "ED 571",
  "credits": "3",
  "description": "Explores linguistic categories: phonology, morphology, syntax, semantics, pragmatics, and discourse. Focuses on academic language development and teaching implications for emergent bilingual students in Spanish-English K-12 dual language programs. Taught bilingually in Spanish and English.",
  "prerequisites": [["ED 572"]]
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF ESOL EDUCATION",
  "course_number": "ED 572",
  "credits": "3",
  "description": "Examines characteristics of English language learners (ELLs), key theories in language acquisition, the role of culture in language development, and instructional program models for ELLs, while considering implications for classroom instruction.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSTRUCTIONAL APPROACHES FOR ESOL EDUCATION",
  "course_number": "ED 573",
  "credits": "3",
  "description": "Examines characteristics of standards-based content-area instruction for emergent bilinguals. Includes integration of content and language development, classroom-based assessment, and use of technology to support student learning.",
  "prerequisites": [["ED 572"]]
}, {
  "corequisites": [],
  "course_name": "PARTNERSHIPS AND IDEOLOGIES IN ESOL EDUCATION",
  "course_number": "ED 576",
  "credits": "3",
  "description": "Considers social and political issues pertaining to educating English language learners. Focuses on exploring multiple ideologies in ESOL and building partnerships across schools, families, and communities.",
  "prerequisites": [["ED 572"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL EDUCATION LAW RIGHTS AND REGULATIONS",
  "course_number": "ED 578",
  "credits": "3",
  "description": "In-depth review of special education law and regulations that protect and provide educational rights for students with disabilities. Teacher candidates will leave the class understanding both the historical and current legal rights of students receiving special education and how to best meet those rights in both the regular and special education resource classrooms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LINGUISTICS FOR TEACHERS",
  "course_number": "ED 579",
  "credits": "3",
  "description": "Explores linguistic categories: phonology, morphology, syntax, semantics, pragmatics, and discourse. Focuses on teaching implications--from psycholinguistic, sociolinguistic, and critical perspectives--for emergent bilingual students in P-12 contexts.",
  "prerequisites": [["ED 572"]]
}, {
  "corequisites": [],
  "course_name": "STRATEGIES FOR DEVELOPING LITERACY",
  "course_number": "ED 582",
  "credits": "3",
  "description": "Explores approaches to the teaching of reading in multiple-subjects classrooms in a manner consistent with current research and standards. Introduces pedagogical techniques and assessment to teaching vocabulary, comprehension, phonics, and fluency. Addresses strategies related to motivation to read, dyslexia, integration of cultural diversity and social justice and the needs of diverse learners in literacy development.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LANGUAGE ARTS METHODS I: ADOLESCENT LITERACY",
  "course_number": "ED 584",
  "credits": "4",
  "description": "Teaching language arts to middle and high school students requires a deep understanding of how reading and writing to learn occur. Guided by current professional and state literacy standards, students will learn to assess and advance adolescent reading comprehension, and writing and speaking skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LANGUAGE ARTS METHODS II: STRATEGIES FOR GRADES 5-12",
  "course_number": "ED 585",
  "credits": "4",
  "description": "Explores the integration and implementation of curriculum and high leverage instructional practices that respond to the learning needs of adolescents in language arts classrooms. Examines the importance of metacognitive strategies in the teaching of content-related skills and concepts, and how to create school cultures that support high achievement.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LANGUAGE ARTS METHODS III: CURRICULUM AND THE PROFESSION",
  "course_number": "ED 586",
  "credits": "4",
  "description": "Learning to teach language arts as a community of practice including the development of high-leverage instructional practices. Focus on enhancing classroom discourse and building student comprehension, meaning construction, interpretation, and response to complex text. Integration of technology tools for instruction and assessment.",
  "prerequisites": [["ED 584"], ["ED 585"]]
}, {
  "corequisites": [],
  "course_name": "SOCIAL STUDIES METHODS I: ADOLESCENT LITERACY",
  "course_number": "ED 587",
  "credits": "4",
  "description": "Teaching social studies to middle and high school students requires a deep understanding of how reading and writing to learn occur. Guided by current professional and state literacy standards, students will learn to assess and advance adolescent content reading comprehension, writing and speaking skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL STUDIES METHODS II: STRATEGIES FOR GRADES 5-12",
  "course_number": "ED 588",
  "credits": "4",
  "description": "Explores the integration and implementation of curriculum and high leverage instructional practices that respond to the learning needs of adolescents in secondary social studies classrooms. Examines the importance of metacognitive strategies in the teaching of content-related skills and concepts, and how to create school cultures that support high achievement.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL STUDIES METHODS III: CURRICULUM AND THE PROFESSION",
  "course_number": "ED 589",
  "credits": "4",
  "description": "Learning to teach social studies as a community of practice including the development of high-leverage instructional practices. Focus on curriculum strategies that provide opportunities for learners to develop and use facts, concepts, interpretations, and analyses to build and support arguments. Integration of technology tools for instruction and assessment.",
  "prerequisites": [["ED 587"], ["ED 588"]]
}, {
  "corequisites": [],
  "course_name": "SOCIAL JUSTICE IN EDUCATION",
  "course_number": "ED 590",
  "credits": "3",
  "description": "Examines social, environmental and ecological justice in educational settings focusing on bias critique in text, development of social justice curriculum, and creation of an action related to a social justice issue. The interconnectedness of social and ecological justice is also explored. Various international justice standards are used to ground students’ work in curriculum development.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TECHNOLOGY TOOLS FOR TEACHING",
  "course_number": "ED 592",
  "credits": "1",
  "description": "Develops technology skills needed to be successful as a classroom teacher. Explores how digital tools can be used in instruction, assessment, communication, and collaboration in educational settings to bring vibrant energy into student learning and engagement. Covers responsible digital citizenship, responsible use and ethics of technology in the classroom.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DIFFERENTIATION",
  "course_number": "ED 594",
  "credits": "2",
  "description": "Issues of K-12 learner and the role of culture, language, and group identification in learning will be examined and applied to the consideration of differentiated instructional strategies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EDUCATIONAL DEVELOPMENT",
  "course_number": "ED 595",
  "credits": "2",
  "description": "Issues of K-12 learner social/emotional/cognitive development across multiple areas of learning will be examined, with consideration given to impact on classroom pedagogy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "K-5 STEM INTEGRATION IN DIVERSE CLASSROOMS",
  "course_number": "ED 597",
  "credits": "2",
  "description": "An investigation of theory and practice related to science teaching and learning in diverse classrooms through integration of science, math, literacy and social studies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ED 599",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "ED 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "ED 602",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "ED 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "ED 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "ED 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "ED 607",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "ED 608",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM/CLINICAL EXPERIENCE",
  "course_number": "ED 609",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "ED 610",
  "credits": "1-15",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH DESIGN AND EPISTEMOLOGIES",
  "course_number": "ED 620",
  "credits": "3",
  "description": "Analysis of multiple research designs and epistemologies in education research. Development of critical reading of research and synthesis across related literature. Consideration of epistemologies and theoretical traditions in educational scholarship and how they shape research design. Exploration of the historical and ethical contexts of empirical research in related educational fields.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUALITATIVE RESEARCH TECHNIQUES IN EDUCATION",
  "course_number": "ED 622",
  "credits": "3",
  "description": "A study of qualitative research designs and analytical procedures with specific applications in education.",
  "prerequisites": [["ED 620"]]
}, {
  "corequisites": [],
  "course_name": "QUANTITATIVE RESEARCH DESIGN AND CRITICAL ANALYSIS",
  "course_number": "ED 624",
  "credits": "3",
  "description": "A study of quantitative research designs and analytical procedures with specific applications in education.",
  "prerequisites": [["ED 620"]]
}, {
  "corequisites": [],
  "course_name": "EQUITY AND EDUCATION POLICY",
  "course_number": "ED 650",
  "credits": "3",
  "description": "Introduces students to key educational policy debates, with a particular focus on attempts to use education policy to advance equity. Examines different visions for the purpose of education and different definitions of equity. Explores the roles of different actors within education policy, including legislators, courts, and non-governmental organizations. Provides students with frameworks for analyzing education policy, which students will then apply to analyze a current policy debate that is of interest to them.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH BILINGUALISM AND MULTILINGUALISM",
  "course_number": "ED 651",
  "credits": "3",
  "description": "Develops critical research skills to create new knowledge in the field of multilingualism. Examines interdisciplinary and intersectional perspectives to consider notions of identity among multilinguals and explore the historical trajectory of bilingualism and multilingualism research. Provides a broad understanding of the theoretical and methodological frameworks used to study bilingualism and multilingualism in globalized contexts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ETHNOGRAPHIC METHODS",
  "course_number": "ED 652",
  "credits": "3",
  "description": "As an advanced qualitative method class, this course introduces theory and ethnographic research methods by presenting the various ways by which socio-cultural anthropologists observe and analyze phenomena, groups or individuals in everyday language and social practices in their local and global contexts, taking into account issues of language, equity and educational policy. Students will carry out an ethnographic research project of a particular phenomenon they wish to learn more about.",
  "prerequisites": [["ED 622", "SED 622"]]
}, {
  "corequisites": [],
  "course_name": "DISCOURSE",
  "course_number": "ED 653",
  "credits": "IDENTITY",
  "description": "Builds a foundation in discourse theory and its applications to identity and education. Includes empirical studies that draw from particular lenses of discourse theory, exemplifying how these scholars organize the design, implementation, and discussion of research around discourse theory. Develops knowledge of discourse theory to propose a study that could be conducted drawing from discourse analytic perspectives.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ED 699",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "ED 808",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}]