[{
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "EMGT 506",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEAN FOR ENGINEERING MANAGERS",
  "course_number": "EMGT 530",
  "credits": "4",
  "description": "Explores lean concepts. Identifies areas of application in complex environments. Evaluates application of lean principles for effectiveness. Examines the role of management in a successful lean implementation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECT RISK MANAGEMENT",
  "course_number": "EMGT 552",
  "credits": "4",
  "description": "An introduction to the concept of project risk in producing constructed engineering projects. Course content includes project baselining, risk definition and identification, risk assessment and management techniques, risk control, risk response, and risk management. CROSSLISTED as CCE 552/EMGT 552.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL RESPONSIBILITY AND ETHICS",
  "course_number": "EMGT 554",
  "credits": "3",
  "description": "An in-depth exploration of professional engineering ethics. Course content includes conceptual theoretical basis of ethics, ethics among professional organizations, ethical consideration of design, critical analysis of ethical situations, ethics in the workplace, and ethical considerations regarding the broader environment. CROSSLISTED as CCE 554/EMGT 554.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELEVATING PROBLEM-SOLVING TO DRIVE CHANGE",
  "course_number": "EMGT 560",
  "credits": "3",
  "description": "Positions technical experts, engineers, and scientists as agents of change. Examines the process of moving beyond the technical solution to identifying the connection to the bigger system. Explores best practices for identifying opportunities, analyzing data, and designing unique approaches to effectively communicate insights and meaning to align stakeholders.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO MANAGEMENT FOR ENGINEERS AND SCIENTISTS",
  "course_number": "EMGT 572",
  "credits": "4",
  "description": "Introduces concepts, tools, and practices necessary for a broad understanding of the roles of engineering and technical managers. Uses a mix of research results, case studies, and experiential learning to bolster theories of management, with focus on technical organizations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED ENGINEERING ECONOMICS ANALYSIS",
  "course_number": "EMGT 573",
  "credits": "4",
  "description": "Examine the economic aspects of engineering management. Integrate financial data to evaluate economic decisions. Assess organizational performance through financial measures.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OPERATIONS MANAGEMENT",
  "course_number": "EMGT 574",
  "credits": "4",
  "description": "Explore operational issues in a technical environment. Analyze problems utilizing both qualitative and quantitative data. Create efficient solutions to operational challenges including location placement, building layout, inventory management, resource deployment, and quality control.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SYSTEMS ENGINEERING",
  "course_number": "EMGT 584",
  "credits": "4",
  "description": "Explores systems engineering within the discipline of engineering management. Identifies principles of traditional and contemporary hard and soft systems. Examines future developments in systems engineering.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEGAL ASPECTS OF ENGINEERING MANAGEMENT",
  "course_number": "EMGT 585",
  "credits": "3",
  "description": "Examines those legal issues likely to arise in the engineering and engineering management professions such as labor law, employment law, health and safety laws, intellectual property, torts, and contracts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MANAGEMENT OF INFORMATION SYSTEMS",
  "course_number": "EMGT 587",
  "credits": "4",
  "description": "An introduction to the management of information systems and their strategic importance in business. Topics covered include global e-business and collaboration, databases and information management, basics of telecommunications and wireless technology, security vulnerabilities of information systems, basics of business intelligence and business analytics, knowledge management and enhanced decision making.",
  "prerequisites": [["EMGT 572", "IE 582"]]
}, {
  "corequisites": [],
  "course_name": "MANAGEMENT OF NEW PRODUCT DEVELOPMENT",
  "course_number": "EMGT 588",
  "credits": "4",
  "description": "Explore the new product development (NPD) process for a technical organization. Implement each step of the NPD process through a term project. Evaluate the management aspects of the NPD process and analyze how NPD links to strategic planning.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STRATEGIC PLANNING IN ENGINEERING ORGANIZATIONS",
  "course_number": "EMGT 590",
  "credits": "4",
  "description": "Examines the integration of systems engineering principles in the strategic planning process from a variety of engineering perspectives. Explores the Viable System Model (VSM) and its five subsystems as an approach to strategic planning.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STATISTICAL CONCEPTS FOR ENGINEERING MANAGERS",
  "course_number": "EMGT 591",
  "credits": "4",
  "description": "Provides a first review of basic probability and statistical inference concepts and methods relevant for engineering managers. Presents frequently utilized statistical methods in industry, including process control, regression analysis, and experimental design. Covers the fundamental ideas of each method, and presents simple examples to provide engineering managers with the background needed to initiate and manage applications of these methods in industry. Ends with an overview of process optimization, and robust parameter design.",
  "prerequisites": [["EMGT 572", "IE 582"]]
}, {
  "corequisites": [],
  "course_name": "ENGINEERING MANAGEMENT CAPSTONE",
  "course_number": "EMGT 595",
  "credits": "3",
  "description": "Identifies critical problems and applies appropriate solutions to a real-world or simulated situation. Integrates project management skills, basic management knowledge, and engineering economic analysis. Emphasizes problem-solving, critical thinking, innovative application of curriculum knowledge, ethical considerations, and written and oral communication skills.",
  "prerequisites": [["IE 571"], ["EMGT 572", "IE 582"], ["EMGT 573", "IE 583"]]
}]