[{
  "corequisites": [["ECE 322"]],
  "course_name": "ELECTRONICS I LABORATORY",
  "course_number": "ESC 322",
  "credits": "1",
  "description": "Solidifies concepts covered in ECE 322 through the design, analysis, simulation, construction, and evaluation of electronic circuits. Provides students with experience designing, building, and testing electronics circuits, including diode circuits and rectifiers, and transistor amplifiers using both bipolar and MOS transistors.",
  "prerequisites": [["ESE 330", "ENGR 203"]]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY FLUID MECHANICS",
  "course_number": "ESC 331",
  "credits": "4",
  "description": "Introduces the concepts and applications of fluid mechanics and dimensional analysis with an emphasis on fluid behavior, internal and external flows, analysis of engineering applications of incompressible pipe systems, and external aerodynamics.",
  "prerequisites": [["ME 310", "NSE 310"]]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY HEAT TRANSFER",
  "course_number": "ESC 332",
  "credits": "4",
  "description": "Analyzes conductive, convective and radiative energy transfer using control volume and differential analysis and prediction of transport properties.",
  "prerequisites": [["ESC 331", "ME 331", "ME 331H", "NSE 331", "NSE 331H"]]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO EXPERIMENTATION",
  "course_number": "ESC 340",
  "credits": "4",
  "description": "Theory and application of instrumentation and measurement techniques are covered. Course topics include fundamentals of sampling theory, error and uncertainty analysis, signal conditioning, sensor fundamentals, and data analysis. Laboratory exercises provide experience utilizing data acquisition hardware and software, as well as a variety of sensors for measuring parameters from mechanical and electrical engineering systems.",
  "prerequisites": [["ENGR 202"], ["CS 162", "CS 162H"], ["PH 213", "PH 213H"], ["ST 314"]]
}, {
  "corequisites": [],
  "course_name": "ENGINEERING MATERIALS",
  "course_number": "ESC 350",
  "credits": "4",
  "description": "An introduction to materials and their structures and properties. The physical and chemical phenomena responsible for the electrical, mechanical, and thermal behavior of solids will be studied.",
  "prerequisites": [["PH 213", "PH 213H"], ["CH 232", "CH 232H"]]
}, {
  "corequisites": [],
  "course_name": "ENGINEERING PROJECT MANAGEMENT",
  "course_number": "ESC 395",
  "credits": "3",
  "description": "Discusses organization in managing engineering projects. Analyzes time, cost, and performance parameters using a team-project-based laboratory scenario. Introduces methods to properly perform network optimization, including resource leveling and techniques to reduce project duration. Introduces milestone definition and risk analysis using Failure Mode and Effects Analysis (FMEA).",
  "prerequisites": [["ENGR 390"]]
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "ESC 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "ESC 410",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUMERICAL METHODS FOR ENGINEERS",
  "course_number": "ESC 440",
  "credits": "4",
  "description": "Explores numerical analysis of calculations and models in the engineering setting. Predicts numerical error. Performs root finding, numerical differentiation and integration, curve fitting, optimization, and Fourier analysis. Solves linear systems of equations and ordinary differential equations. Processes images. Engineering specific applications may include: root finding for heat transfer fin sizing, solving linear systems for electrical nodal analysis, applying differential equations solution algorithms to solve a quarter car suspension model, and curve fitting for engineering data analysis.",
  "prerequisites": [["MTH 256", "MTH 256H"], ["MTH 264", "MTH 264H"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ESC 499",
  "credits": "4",
  "description": "",
  "prerequisites": []
}]