[{
  "corequisites": [],
  "course_name": "MODELING AND ANALYSIS OF DYNAMIC SYSTEMS",
  "course_number": "ESE 330",
  "credits": "4",
  "description": "Presents basic concepts of dynamic behavior, and the analytical and computational techniques for predicting and assessing dynamic behavior. Focuses on modeling a basic system, compound system, dynamic stability, and natural behavior to continuing and abrupt inputs.",
  "prerequisites": ["ENGR 202", "ENGR 212", "ENGR 212H", "ME 217", "MTH 256", "MTH 256H", "MTH 264", "MTH 264H", "MTH 341"]
}, {
  "corequisites": [],
  "course_name": "ENERGY REGULATION",
  "course_number": "ESE 355",
  "credits": "4",
  "description": "Introductory course to the policies and laws governing energy generation and transmission in the United States with a focus on electricity. History of regulations give context to understand current regulation and potential future policies. Laws regulating the use of alternative energy resources covered in a practical setting. Offered at OSU-Cascades only.",
  "prerequisites": ["BA 360", "ENGR 390"]
}, {
  "corequisites": [],
  "course_name": "ENERGY CONSUMPTION ANALYSIS",
  "course_number": "ESE 360",
  "credits": "4",
  "description": "Analysis of energy use in transportation, residential and industrial sectors to understand how new technologies improve energy efficiency. Tradeoff techniques applied to decide between less efficient, less expensive systems versus more efficient, more expensive systems. International energy consumption compared, and energy losses evaluated for heating, cooling and electronic systems.",
  "prerequisites": ["BA 360", "ENGR 390", "ME 311", "ME 311H", "NSE 311", "NSE 311H"]
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "ESE 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "ESE 410",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FEEDBACK CONTROL SYSTEMS",
  "course_number": "ESE 430",
  "credits": "4",
  "description": "Modeling and analysis of linear, continuous-time systems in the time and frequency domains. Fundamentals of single-input-single-output control system design using both time-domain and frequency-domain techniques.",
  "prerequisites": ["ESE 330"]
}, {
  "corequisites": [],
  "course_name": "ENERGY GENERATION SYSTEMS",
  "course_number": "ESE 450",
  "credits": "4",
  "description": "Survey of technical fundamentals and operational principles of conventional and renewable energy conversion systems to understand the environmental and sustainable issues for energy systems currently in use or may be used in the future to power our industrial society.",
  "prerequisites": ["ME 312", "ME 312H", "NSE 312", "NSE 312H"]
}, {
  "corequisites": [],
  "course_name": "ENERGY DISTRIBUTION SYSTEMS",
  "course_number": "ESE 470",
  "credits": "4",
  "description": "Detailed coverage of the electrical energy distribution system, its operation, control and design. Design considerations and impacts to meet emerging and evolving customer needs. Broader understanding of natural gas and oil pipeline distribution for these infrastructure commodities.",
  "prerequisites": ["ENGR 202", "ME 311", "ME 311H", "NSE 311", "NSE 311H"]
}, {
  "corequisites": [],
  "course_name": "ENERGY STORAGE SYSTEMS",
  "course_number": "ESE 471",
  "credits": "4",
  "description": "Coverage of energy storage techniques involving electrochemical, mechanical and emerging options. Integration of the energy storage media, its effects on the bulk power system, and design tradeoffs to understand environmental impacts, cost, reliabilities, and efficiencies for commercialization of bulk energy storage.",
  "prerequisites": ["ENGR 202", "ME 312", "ME 312H", "NSE 312", "NSE 312H"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ESE 499",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}]