[{
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "FOR 004",
  "credits": "0",
  "description": "Provides basic personal and professional skills that can be used within and outside of a work setting. Through practice, this experience guides students in building and maintaining positive professional relationships, networking/mentoring relationships, and enhances students’ understanding of the connection between theory and practice in their respective disciplines.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO FORESTRY",
  "course_number": "FOR 111",
  "credits": "3",
  "description": "Forest resources in the world; forests and human well-being; where and how forests grow; environmental and human values; products, characteristics, and uses; basic elements of use, planning and management. Interpretation of forestry literature; professional origins in the U.S. Field trips required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPUTING APPLICATIONS IN FORESTRY",
  "course_number": "FOR 112",
  "credits": "3",
  "description": "An overview of computing applications used in all aspects of forestry work, but largely focused on development of intermediate and advanced spreadsheet skills using Microsoft Excel (e.g., complex formulas and functions, charting, and pivot tables). Additionally, the course rounds out essential skills in document formatting and presentation development.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "FOR 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [["SOIL 205"]],
  "course_name": "*FOREST SOILS LABORATORY FOR SOIL 205",
  "course_number": "FOR 206",
  "credits": "1",
  "description": "Laboratory exercise and field trips designed to develop student competency in soil processes, description, analysis, and assessment with a particular emphasis on the role of soils in managed and unmanaged forest ecosystems. (Bacc Core Course if taken with SOIL 205)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST SOILS RECITATION",
  "course_number": "FOR 208",
  "credits": "1",
  "description": "Readings, exercises, discussions designed to develop student competency in forest soil processes, description, analysis, and assessment. A particular emphasis will be placed on the role of soils in managed and unmanaged forest ecosystems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TERRESTRIAL VERTEBRATE IDENTIFICATION AND NATURAL HISTORY",
  "course_number": "FOR 210",
  "credits": "3",
  "description": "Reviews principles used for locating, observing, and identifying terrestrial vertebrates, with an emphasis on using morphological characteristics in concert with behaviors and vegetation associations. Emphasizes on taxonomic relationships and traits used for identifying species within each terrestrial vertebrate group (i.e., birds, amphibians, reptiles, and mammals). Gains experience in species identification under field conditions and explores the relationship between animals and their environments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WILDLAND FIRE GUARD SCHOOL",
  "course_number": "FOR 252",
  "credits": "2",
  "description": "Builds solid foundation in wildland firefighting and basic fire behavior. Incorporates National Wildfire Coordinating Group (NWCG) and Federal Emergency Management Agency (FEMA) online curricula. Develops firefighting skills, including fire shelter deployment and a Work Capacity Test (WCT) opportunity, through a series of field-based exercises.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "JUNIOR SEMINAR",
  "course_number": "FOR 307",
  "credits": "1",
  "description": "College is the time to develop the skills necessary for the transition between academics and career. In conjunction with the expertise already available on campus, this course will guide students through career planning, exploration, placement, and employer expectations. CROSSLISTED as FE 307/FOR 307.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FORESTRY FIELD SCHOOL",
  "course_number": "FOR 312",
  "credits": "2",
  "description": "A hands-on experience in the major aspects of forestry, including regeneration surveys, silviculture, cruising, recreation, forest disturbances, logging site and mill visits, east and west of the Cascades Range. CROSSLISTED as FE 312/FOR 312.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST MENSURATION",
  "course_number": "FOR 321",
  "credits": "5",
  "description": "Encompasses methods used to measure tree, stand and forest-level attributes, and sample and analyze forest resources data. Provides information that support forest management decisions at the stand and forest levels. Focuses mainly on quantitative analysis of forest vegetation. Uses considerable time and effort on measuring other forest resources (e.g., wildlife habitat and riparian zones).",
  "prerequisites": [["FES 241"], ["FE 208"], ["MTH 241", "MTH 245", "MTH 251", "MTH 251H"], ["ST 201", "ST 243Z", "ST 314", "ST 314H", "ST 351", "ST 351H"]]
}, {
  "corequisites": [],
  "course_name": "FOREST MODELS",
  "course_number": "FOR 322",
  "credits": "3",
  "description": "Focuses on introduction to static and dynamic forest models: defining what they are, how they might be used, and, in general terms, how they are developed.",
  "prerequisites": [["FOR 321"], ["MTH 241", "MTH 241H", "MTH 251", "MTH 251H"], ["ST 201", "ST 243Z", "ST 314", "ST 314H", "ST 351", "ST 351H"]]
}, {
  "corequisites": [],
  "course_name": "FOREST RESOURCE ECONOMICS I",
  "course_number": "FOR 329",
  "credits": "4",
  "description": "Explores main concepts associated with the sustainable use of forest resources from an economic perspective. Introduces financial and economic aspects of forest management decision making, at both the stand and forest level. Topics including forest products markets, appraisal, rotation, thinning, uneven-aged management and forest regulation. Covers economics of timber management and harvest scheduling.",
  "prerequisites": [["ST 201", "ST 243Z", "ST 314", "ST 314H", "ST 351", "ST 351H"]]
}, {
  "corequisites": [],
  "course_name": "FOREST RESOURCE ECONOMICS II",
  "course_number": "FOR 332",
  "credits": "2",
  "description": "Utilizes tools of investment analysis and approaches to capital budgeting under risk. Explores basic wood products markets. Examines forest resource market failures and externalities. Evaluates nonmarket valuation and multiple-use forestry. Discusses impacts of forest management and public policy decisions on forest resource use. Analyzes international trade considerations.",
  "prerequisites": [["FOR 329"]]
}, {
  "corequisites": [],
  "course_name": "TOPICS IN WILDLAND FIRE",
  "course_number": "FOR 346",
  "credits": "3",
  "description": "An interdisciplinary survey of concepts relating to fire science, ecology, management, and policy. Includes case studies of several representative ecosystems, ranging from west- and eastside forests of the Pacific Northwest to shrub steppe ecosystems of the Intermountain West and chaparral ecosystems of southern California. Distance and campus-based delivery using videos, website, and discussion.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "FOR 399",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "FOR 399H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "FOR 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "FOR 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "FOR 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "FOR 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "FOR 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "FOR 408",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "FOR 410",
  "credits": "1-16",
  "description": "Full-time supervised professional experience emphasizing functional proficiency under joint sponsorship of university and agency personnel.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST PATHOLOGY",
  "course_number": "FOR 413",
  "credits": "3",
  "description": "Analyzes effects of diseases on forest ecosystems. Focuses on recognition of important groups, prediction of pathogen responses to environmental changes, and management strategies for protection of forest resources. CROSSLISTED as BOT 413/FOR 413.",
  "prerequisites": [["BI 204", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "FES 240"]]
}, {
  "corequisites": [],
  "course_name": "ECONOMICS AND POLICY OF FOREST WILDLAND FIRE",
  "course_number": "FOR 431",
  "credits": "3",
  "description": "Explores current issues in wildfire policy and management. Analyzes relevant laws and regulations, including liability standards and air quality rules. Uses an economic framework for evaluating allocation of resources, the role of incentives and risk preferences, and for valuation of forest assets under risk.",
  "prerequisites": [["FOR 330", "FOR 332", "ECON 201", "ECON 201H", "AEC 250", "AEC 250H"]]
}, {
  "corequisites": [],
  "course_name": "WILDLAND FIRE SCIENCE AND MANAGEMENT",
  "course_number": "FOR 436",
  "credits": "4",
  "description": "Principles and applications of fire as a natural resource management tool; the role of fire in conservation management, restoration, and preservation of ecosystems. Covers basic techniques and current research used to describe fire behavior and spread, fuels and fuel manipulation, and fire effects on the biota. Focus will be on fire as a natural process in ecosystem dynamics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SILVICULTURE PRINCIPLES",
  "course_number": "FOR 441",
  "credits": "4",
  "description": "Nursery operation, vegetation management, herbivores, fire, seeding and planting techniques. Introduction to principles and techniques involving vegetation control, thinning, fertilizing, and harvesting. Environmental considerations related to forest stand treatments.",
  "prerequisites": [["FES 240", "FES 240H"], ["FES 241"]]
}, {
  "corequisites": [["FOR 443"]],
  "course_name": "SILVICULTURE REFORESTATION",
  "course_number": "FOR 442",
  "credits": "4",
  "description": "Silvicultural principles and practices needed to successfully regenerate forestlands in North America. Topics include artificial and natural regeneration, genetic improvement, seed orchards, forest tree nurseries, site preparation, seedling quality and handling, vegetation management, animal damage protection, early stand management, and ecological and ecophysiological considerations. Emphasis is placed on regeneration methods applied to plantations in western Oregon. Field trips required.",
  "prerequisites": [["SOIL 205", "SOIL 205H", "CSS 205", "CSS 305"], ["FES 240", "FES 240H"]]
}, {
  "corequisites": [["FOR 442"]],
  "course_name": "SILVICULTURAL PRACTICES",
  "course_number": "FOR 443",
  "credits": "4",
  "description": "Manipulation of forest stand structure and dynamics to meet various resource management objectives. Covers key concepts and practices associated with vegetation control, thinning, fertilization, even-aged and uneven-aged regeneration systems including social and environmental considerations associated with treatments. Two-day field trip required.",
  "prerequisites": [["FES 240", "FES 240H"], ["FOR 321"]]
}, {
  "corequisites": [],
  "course_name": "PRESCRIBED FIRE PRACTICUM",
  "course_number": "FOR 452",
  "credits": "3",
  "description": "Explores prescribed fire in an ecological context and as a management tool. Emphasizes evaluating sites for prescribed fire potential/suitability, developing burn prescriptions and burn plans to meet landowner and ecological objectives, monitoring results, and accessing resources and expertise. Develops a burn plan and implements a prescribed burn.",
  "prerequisites": [["FOR 252"]]
}, {
  "corequisites": [],
  "course_name": "*INTERNATIONAL FORESTRY",
  "course_number": "FOR 456",
  "credits": "3",
  "description": "An introduction to the biological, physical, and sociological factors that shape the world's forests and the activities used to manage those forests. What influence these factors have on forest policies, practices, and outcomes. CROSSLISTED as FE 456/FOR 456.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TECHNIQUES FOR FOREST RESOURCE ANALYSIS",
  "course_number": "FOR 457",
  "credits": "4",
  "description": "Use of linear programming, nonlinear programming, dynamic programming, and simulation to solve complex forest management problems, with emphasis on intertemporal multiple-use scheduling. Forestry transportation problems, multiple-use allocation, and investment analysis. Field trips required. CROSSLISTED as FE 457/FOR 457 and FE 557.",
  "prerequisites": [["FOR 329"], ["FOR 441", "FOR 443"]]
}, {
  "corequisites": [],
  "course_name": "FOREST MANAGEMENT PLANNING AND DESIGN I",
  "course_number": "FOR 459",
  "credits": "4",
  "description": "Integration of environmental, economic, and social aspects of forestry in management planning. Development of strategic and tactical plans using diverse data types and sources. Senior capstone class projects. Lec/lab. CROSSLISTED as FE 459/FOR 459.",
  "prerequisites": [["FE 457", "FOR 457"]]
}, {
  "corequisites": [],
  "course_name": "^FOREST POLICY",
  "course_number": "FOR 460",
  "credits": "4",
  "description": "Policy formulation and analysis for forest resources. Consideration of policy affecting land management approaches to planning, management, and social and economic development. Major forestry policy areas covered include outdoor recreation, range, timber, wilderness, and wildlife and fish.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST POLICY ANALYSIS",
  "course_number": "FOR 461",
  "credits": "3",
  "description": "Explores tools and techniques for policy analysis, with an emphasis on policies impacting forest management. Uses case studies to demonstrate and practice using an analytic framework. Uses the model of an eightfold process to understand problem-solving and policy analysis in contemporary forest policy issues. Builds a multi-dimensional framework to analyze and evaluate trade-offs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^FOREST POLICY AND REGULATION",
  "course_number": "FOR 463",
  "credits": "3",
  "description": "Explores policy formulation and analysis of policies affecting land management, timber harvesting, and other forest practices on both private and public lands, particularly policies that address environmental concerns. Evaluates how regulations and policies evolve, including the role of public perceptions, forestry professionals, and other key policy players. Integrates writing appropriate in topic and style for natural resource professionals. CROSSLISTED as FE 463/FOR 463.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST MANAGEMENT PLANNING AND DESIGN II",
  "course_number": "FOR 469",
  "credits": "4",
  "description": "A team-based, project-centric course for integrated timber harvest planning. Establish tactical and operational planning goals and constraints, identify feasible harvesting and transportation systems, and design harvest units to meet objectives and constraints. Lec/lab. CROSSLISTED as FE 469/FOR 469.",
  "prerequisites": [["FE 459", "FOR 459"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "FOR 499",
  "credits": "0-16",
  "description": "Topics of current importance in forest resources issues, education, policies, economics, management, business, social values, silviculture, and biometrics. Topics will change from term to term. May be repeated with different topics for credit. Section 8: Social aspects of natural resource management (3 credits) graded.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "FOR 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "FOR 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "FOR 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "FOR 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "FOR 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "FOR 508",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "FOR 510",
  "credits": "1-9",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST PATHOLOGY",
  "course_number": "FOR 513",
  "credits": "3",
  "description": "Analyzes effects of diseases on forest ecosystems. Focuses on recognition of important groups, prediction of pathogen responses to environmental changes, and management strategies for protection of forest resources. CROSSLISTED as BOT 513/FOR 513.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GEOSPATIAL FOREST ANALYSIS",
  "course_number": "FOR 520",
  "credits": "4",
  "description": "Examines passive and active sensors used in remote sensing. Explores manipulation of geospatial data in R and classification of images using machine learning. Extract forest relevant information from lidar and photogrammetric point clouds. Sampling for accuracy assessment.",
  "prerequisites": [["FE 544", "GEOG 580"]]
}, {
  "corequisites": [],
  "course_name": "FOREST BIOMETRICS",
  "course_number": "FOR 524",
  "credits": "3",
  "description": "Advanced topics in forest biometrics, including measurement of forest structure and dynamics, application of sampling theory and methods, and statistical techniques for interpreting forestry data.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST MODELING WITH MACHINE LEARNING",
  "course_number": "FOR 525",
  "credits": "4",
  "description": "Develops forest models using regression and machine learning models. Explores techniques and assumptions used to develop static and dynamic models. Emphasizes regression analysis, random forests, and neural networks.",
  "prerequisites": [["ST 521", "ST 552"]]
}, {
  "corequisites": [],
  "course_name": "3-PG FOREST GROWTH MODEL",
  "course_number": "FOR 526",
  "credits": "2",
  "description": "Focuses on the foundations and practical use of the process-based model 3-PG (Physiological Processes Predicting Growth). Utilizes output from the 3-PG model, which includes leaf area index, stand transpiration, stem biomass and volume, quadratic mean diameter, and basal area to evaluate site potential and analyze the effects of varying growing conditions or management actions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL COMMUNICATION AND ETHICS",
  "course_number": "FOR 528",
  "credits": "2",
  "description": "Conventions of written and oral communication in forestry and related disciplines including basic narrative development. Exploration of environmental, professional, and research ethics, and the role they play in effective communication with multiple stakeholders.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SUSTAINABLE FORESTRY RESEARCH",
  "course_number": "FOR 530",
  "credits": "4",
  "description": "Focuses on foundation of the sustainable forest management research. Topics include framing a testable research question, formulation of models, and hypotheses. Selection between Bayesian and Frequentist approaches to research. Emphasizes sustainability and its influence on decision-making in forest management, with example from forest certification, climate change, biodiversity conservation, and equity. Interprets and disseminates methods and results.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECONOMICS AND POLICY OF FOREST WILDLAND FIRE",
  "course_number": "FOR 531",
  "credits": "3",
  "description": "Explores current issues in wildfire policy and management. Analyzes relevant laws and regulations, including liability standards and air quality rules. Uses an economic framework for evaluating allocation of resources, the role of incentives and risk preferences, and for valuation of forest assets under risk.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECONOMICS OF THE FOREST RESOURCE",
  "course_number": "FOR 534",
  "credits": "3",
  "description": "Topics include optimal stand and forest management for timber production, economics of ecosystem services (e.g. recreation, biodiversity, carbon sequestration, water quality and regulation), non-market valuation methods, management under risk and uncertainty, discounting, intergenerational equity, sustainability, international trade and other global issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WILDLAND FIRE SCIENCE AND MANAGEMENT",
  "course_number": "FOR 536",
  "credits": "4",
  "description": "Principles and applications of fire as a natural resource management tool; the role of fire in conservation management, restoration, and preservation of ecosystems. Covers basic techniques and current research used to describe fire behavior and spread, fuels and fuel manipulation, and fire effects on the biota. Focus will be on fire as a natural process in ecosystem dynamics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNATIONAL INTENSIVE SILVICULTURE",
  "course_number": "FOR 542",
  "credits": "2",
  "description": "Operational and ecological aspects of intensive silvicultural management of planted forests around the world. Guest speakers in different countries will describe the type of silvicultural management that is carried out in the speaker's country from species and genetic selection, to harvest and rotation length, including site preparation and planting techniques. Emphasis on comparing silvicultural practices in each country to the management of plantations in western Oregon.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SILVICULTURAL PRACTICES",
  "course_number": "FOR 543",
  "credits": "5",
  "description": "Manipulation of immature and mature forest stands for various resource management objectives. Principles and techniques involving vegetation control, thinning, fertilizing, and harvesting. Environmental considerations related to stand treatments. Two-day field trips required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SILVICULTURAL INFLUENCES ON FOREST ECOSYSTEM DYNAMICS",
  "course_number": "FOR 549",
  "credits": "3",
  "description": "Fundamental biological and ecological principles for the design and implementation of silvicultural regimes that achieve a wide diversity of forest ecosystem management objectives.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SUSTAINABLE FOREST MANAGEMENT",
  "course_number": "FOR 550",
  "credits": "3",
  "description": "Sustainable forestry as part of the global sustainability movement. History of sustainability and its influence on decision-making in forest management. Current dimensions of sustainability: forest certification, climate change, role of environmental ethics, biodiversity conservation, maintenance of long-term site productivity, conservation of soil and water resources, roles of social institutions, and links to concerns for social justice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRESCRIBED FIRE PRACTICUM",
  "course_number": "FOR 552",
  "credits": "3",
  "description": "Explores prescribed fire in an ecological context and as a management tool. Emphasizes evaluating sites for prescribed fire potential/suitability, developing burn prescriptions and burn plans to meet landowner and ecological objectives, monitoring results, and accessing resources and expertise. Develops a burn plan and implements a prescribed burn.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST POLICY ANALYSIS",
  "course_number": "FOR 561",
  "credits": "3",
  "description": "Explores tools and techniques for policy analysis, with an emphasis on policies impacting forest management. Uses case studies to demonstrate and practice using an analytic framework. Uses the model of an eightfold process to understand problem-solving and policy analysis in contemporary forest policy issues. Builds a multi-dimensional framework to analyze and evaluate trade-offs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "FOR 599",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "FOR 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "FOR 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "FOR 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "FOR 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "FOR 607",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "FOR 699",
  "credits": "1-16",
  "description": "Topics of current importance in forest resources issues, education, policies, economics, management, business, social values, silviculture, and biometrics. Topics will change from term to term. May be repeated with different topics for credit.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "FOR 808",
  "credits": "1-9",
  "description": "",
  "prerequisites": []
}]