[{
  "corequisites": [],
  "course_name": "FOOD SCIENCE ORIENTATION",
  "course_number": "FST 101",
  "credits": "1",
  "description": "For food science majors. Orientation and academic guidance toward career planning in food science and technology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "FST 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DAIRY PROCESSING",
  "course_number": "FST 212",
  "credits": "2",
  "description": "Methods of processing and preserving milk and milk products and related unit operations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DAIRY PROCESSING LABORATORY",
  "course_number": "FST 213",
  "credits": "1",
  "description": "Laboratory and field work to accompany FST 212. Field trip required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD PRESERVATION BASICS",
  "course_number": "FST 214",
  "credits": "3",
  "description": "Explores diverse food preservation techniques (freezing, thermal processing, fermentation, and reduced water activity) and explains how each approach controls foodborne hazards. Performs and reports on food preservation techniques using their own experiences. Critically evaluates recipes/instructions to determine potential risk and suggest modifications to eliminate risk. Categorizes the risk of incorrectly following validated food preservation methods.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO WINES",
  "course_number": "FST 251",
  "credits": "BEERS",
  "description": "A descriptive introduction to the history, science, sensory, economics, and societal aspects of alcoholic beverages.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*FOOD SCIENCE AND TECHNOLOGY IN WESTERN CULTURE",
  "course_number": "FST 260",
  "credits": "3",
  "description": "Exploring the sciences and technologies of food processing and preservation within the context of their historical, current, and possible future influences on what we eat, the structure of our society, and our day-to-day lives.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HALAL FOOD PRODUCTION",
  "course_number": "FST 265",
  "credits": "3",
  "description": "Introduces the basic principles and various aspects involved in halal food production. Covers halal production requirements for different foods. Describes the kosher and halal laws as they apply in the food industry. Explains the Muslim demography and global halal trade and economy. Describes all permitted and non-permitted ingredients and additives in halal food processing. Elaborates on the procedures of halal food certification and food safety guidelines. Compares halal food with kosher and vegetarian.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*WINE IN THE WESTERN WORLD",
  "course_number": "FST 273",
  "credits": "3",
  "description": "A study of wine throughout history, from its accidental discovery and refinement through today, with a focus on the profound role wine plays in agriculture, social rituals, human health, economics, and the ambivalent pursuit of pleasure.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD AND BEVERAGE FERMENTATION",
  "course_number": "FST 280",
  "credits": "2",
  "description": "Investigates different types of fermentation processes, related techniques, and products. Engages in laboratory activities on cider fermentation and sensory evaluation.",
  "prerequisites": [["CH 231", "CH 231H"], ["CH 261", "CH 261H"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "FST 299",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PILOT PLANT EXPERIENCES",
  "course_number": "FST 315",
  "credits": "2",
  "description": "Students will be working in one of the FST pilot plants (dairy, vegetables/fruit, brewing, wine making, distilling) and will be assisting with the manufacturing of foods or beverages. Students must have available blocks of time in their schedules to contribute significantly to a production run. Production schedules for each pilot plant will be determined in advance of registration for each term. Not all pilot plants will be available each term.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO SUSTAINABLE FOOD PROCESSING",
  "course_number": "FST 327",
  "credits": "3",
  "description": "Examines principles and assessment of sustainable food processing. Develops concepts of sustainable food processing technologies and food manufacture operations. Explores sustainable processing of various food commodities and products.",
  "prerequisites": [["FST 210", "FST 212", "FST 280"]]
}, {
  "corequisites": [],
  "course_name": "FOOD SAFETY MANAGEMENT: A PRACTICAL GUIDE",
  "course_number": "FST 350",
  "credits": "3",
  "description": "Focuses on holistic food safety management for preparation in working in the food processing and food service industries. Introduces microbiological, chemical, and physical hazards related to food production and mitigation strategies for their control. Introduces management strategies and tools to support the implementation and ongoing management of these programs. Discusses importance and strategies for fostering a food safety culture.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD SAFETY AND SANITATION",
  "course_number": "FST 360",
  "credits": "3",
  "description": "Principles, practices, and regulations governing and ensuring the microbiological safety of our food supply through risk assessment, surveillance, and intervention.",
  "prerequisites": [["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H"], ["CH 121", "CH 221", "CH 221H", "CH 231", "CH 231H"]]
}, {
  "corequisites": [],
  "course_name": "INDUSTRY PREPARATION/HACCP",
  "course_number": "FST 370",
  "credits": "3",
  "description": "Assists students in preparation for internships and employment in the food industry by introducing compliance with food safety regulations, HACCP, and audits.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD SAFETY AND QUALITY ASSURANCE",
  "course_number": "FST 375",
  "credits": "3",
  "description": "Focuses on the total quality management for the food industry. Describes the role of quality assurance and quality control personnel as important functions within the food processing organizations. Establishes and assesses a food safety and quality system within a food processing organization based on the total quality management principles and risk-based thinking concept. Explains statistical process control tools and laboratory control concepts for food processing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^COMMUNICATING FOOD AND FERMENTATION SCIENCE",
  "course_number": "FST 385",
  "credits": "3",
  "description": "Guides students in the investigation and critical evaluation of literature on a topic of current interest in food or fermentation science, and the development of their ability to write concisely and with precision about technical subject matter in this discipline.",
  "prerequisites": [["FST 360"], ["WR 121", "WR 121H", "WR 121Z", "WR 121H"], ["MB 302", "MB 302H"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "FST 399",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "FST 399H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "FST 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "FST 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "FST 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SENIOR SEMINAR",
  "course_number": "FST 407",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "FST 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SENSORY EVALUATION OF FOOD",
  "course_number": "FST 420",
  "credits": "3",
  "description": "Covers sensory techniques used in the evaluation of the taste, smell, texture, and appearance of foods as well as the evaluation of consumer acceptance. Examines methods for measuring sensory qualities, underlying psychological principles, and statistical methods for analyzing data.",
  "prerequisites": [["ST 351", "ST 411"], ["ST 352", "ST 412"]]
}, {
  "corequisites": [],
  "course_name": "FOOD LAW",
  "course_number": "FST 421",
  "credits": "3",
  "description": "Concepts, statutes, regulations, and agencies controlling the production, processing, and distribution and promotion of food.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD CHEMISTRY FUNDAMENTALS",
  "course_number": "FST 422",
  "credits": "4",
  "description": "An integrated course applying theories of molecular reactivity to model food systems. Lectures focus on the molecular bases of chemical phenomena that dictate the behavior of foods. Laboratories and recitations provide opportunities for students to observe, manipulate, and explore model food systems. Emphasis on major food components (water, lipids, proteins, and carbohydrates) and their behavior under conditions of particular relevance to food processing.",
  "prerequisites": [["BB 350", "BB 450", "BB 450H"], ["CH 332", "CH 336"], ["MTH 228", "MTH 252", "MTH 252H"]]
}, {
  "corequisites": [],
  "course_name": "FOOD ANALYSIS",
  "course_number": "FST 423",
  "credits": "4",
  "description": "An integrated laboratory/lecture course covering methods used for the quantitative analysis of the chemical composition of foods and agricultural products.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD SYSTEMS CHEMISTRY",
  "course_number": "FST 425",
  "credits": "4",
  "description": "The chemistry of food components in real-world food systems. Focused on water, proteins, carbohydrates, lipids, and food polymers, their interactions, and the effects of food processing and storage. Integrates writing as a learning tool and means of professional communication.",
  "prerequisites": [["FST 422"]]
}, {
  "corequisites": [],
  "course_name": "SENSORY EVALUATION OF FOOD LABORATORY",
  "course_number": "FST 428",
  "credits": "1",
  "description": "Emphasizes sensory techniques used in the evaluation of the taste, smell, texture, and appearance of foods as well as the evaluation of consumer acceptance. This includes methods for measuring sensory qualities, statistical methods for analyzing data, and proper interpretation of these results. Focuses on sample presentation, dealing with panelists, data recording, data analysis, interpretation of results, and report writing.",
  "prerequisites": [["FST 420"]]
}, {
  "corequisites": [],
  "course_name": "FOOD PRODUCT DEVELOPMENT",
  "course_number": "FST 430",
  "credits": "3",
  "description": "Provides technical background and hand-on experience in food product development and food innovation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CHEMISTRY AND BIOCHEMISTRY OF DISTILLED SPIRITS",
  "course_number": "FST 437",
  "credits": "3",
  "description": "The underlying science of the production of the distilled spirits will be discussed systematically. The course will cover the requirements for water, the major raw materials (eg. cereals, fruits, agave, syrups, and woods for maturation) and the conversion of these into fermentable extract. The scientific principles of fermentation will be explored, in the context of both ethanol and secondary metabolite production. Distillation will be considered, in terms of the physics and chemistry of liquid-liquid separations, before discussing post-fermentation options such as blending, maturation and product finishing.",
  "prerequisites": [["FST 251"], ["BB 350"]]
}, {
  "corequisites": [],
  "course_name": "PRODUCTION AND ANALYSIS OF DISTILLED SPIRITS",
  "course_number": "FST 439",
  "credits": "2",
  "description": "Compares and contrasts different approaches to the manufacture of distilled spirits by using some of the major spirit categories as examples. Discusses the management of a distilled spirits production plant in terms of legislative, safety and process/ product quality before explicit consideration of the requirements for establishing a distilled spirits production plant. Provides students with a broad understanding of the distilled spirits sector.",
  "prerequisites": [["FST 437"]]
}, {
  "corequisites": [["FST 439"]],
  "course_name": "PRODUCTION AND ANALYSIS OF DISTILLED SPIRITS LABORATORY",
  "course_number": "FST 440",
  "credits": "1",
  "description": "Building on the corequisite lecture course, the laboratory sessions focus on the essential analyses required in most if not all distillery operations and the production of final spirit products as examples of different spirit sectors. Provides students with a broad understanding of the distilled spirits sector and complements the lecture-based classes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD AND CLIMATE CHANGE",
  "course_number": "FST 455",
  "credits": "3",
  "description": "Focus on traditional regional recipes, explore and document how global change has affected food production and demand until today and how projected climate change will affect it in the future by analyzing the ingredient lists. Focus on one recipe/ingredient, find maps of past/current crop ranges, document changes, establish the carbon footprint, and identify possible replacement ingredients projecting future culinary solutions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CHEMISTRY AND BIOCHEMISTRY OF BEER",
  "course_number": "FST 460",
  "credits": "3",
  "description": "Explores the chemistry, biochemistry, microbiology and engineering of malting and brewing operations for the production of beer, including the compositional analysis of barley, malt, hops, water, and beer and their effects on beer quality.",
  "prerequisites": [["BI 205", "BI 221", "BI 221H"], ["CH 331"], ["CH 332"]]
}, {
  "corequisites": [],
  "course_name": "PRODUCTION AND ANALYSIS OF BEER",
  "course_number": "FST 463",
  "credits": "2",
  "description": "Examines the chemical, microbiological, physical, and sensory analyses for assessing beer quality.",
  "prerequisites": [["FST 460"], ["MB 302", "MB 302H"]]
}, {
  "corequisites": [["FST 463"]],
  "course_name": "PRODUCTION AND ANALYSIS OF BEER LABORATORY",
  "course_number": "FST 464",
  "credits": "1",
  "description": "Focuses on hands-on instruction of brewery operations and analytical techniques for producing and assessing beer.",
  "prerequisites": [["FST 460"], ["MB 302", "MB 302H"], ["MB 303", "MB 303H"]]
}, {
  "corequisites": [],
  "course_name": "CHEMISTRY AND BIOCHEMISTRY OF WINE",
  "course_number": "FST 466",
  "credits": "3",
  "description": "Explores principles of wine production technology from grape berry development through bottling, covering the microbiology and chemistry and biochemistry of fermentation, aging and production practices of red and white table wines as well as sparkling and dessert wines.",
  "prerequisites": [["MB 302", "MB 302H"]]
}, {
  "corequisites": [],
  "course_name": "PRODUCTION AND ANALYSIS OF WINE",
  "course_number": "FST 469",
  "credits": "2",
  "description": "Examines the fundamentals of red and white wine production including procedures and equipment used and application of key chemical, microbial, and sensory analysis techniques to assess wine.",
  "prerequisites": [["FST 466"], ["FST 479"]]
}, {
  "corequisites": [["FST 469"]],
  "course_name": "PRODUCTION AND ANALYSIS OF WINE LABORATORY",
  "course_number": "FST 470",
  "credits": "3",
  "description": "Focuses on the production of red and white wine and the key analytical techniques utilized in the wine industry (chemical, microbiological, and sensorial) during the production of wine.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD ENGINEERING AND PROCESSING I",
  "course_number": "FST 472",
  "credits": "4",
  "description": "Covers fundamental engineering principles for scientists and non-process engineers. Explores unit conversion, mass and energy balances, heat transfer, thermal processing, and lethality. Directed at food scientists and other majors who need or would like a working knowledge of food engineering principles.",
  "prerequisites": [["MTH 227", "MTH 251", "MTH 251H"], ["PH 201", "PH 211", "PH 211H"], ["FST 360"]]
}, {
  "corequisites": [],
  "course_name": "FOOD ENGINEERING AND PROCESSING II",
  "course_number": "FST 473",
  "credits": "4",
  "description": "Covers fundamental engineering principles for scientists and non-process engineers. Explores mass transfer, extrusion, filtration, osmosis, distillation, extraction, drying, and freezing.",
  "prerequisites": [["FST 472"]]
}, {
  "corequisites": [],
  "course_name": "FERMENTATION MICROBIOLOGY",
  "course_number": "FST 479",
  "credits": "3",
  "description": "Introduction to fermentation microbiology that emphasizes the evolution of key physiological traits and biochemical pathways within key microbial genera. Explores the microbial ecology of processes used to make alcoholic beverages, food ingredients, and fermented foods. CROSSLISTED as FST 479/MB 479.",
  "prerequisites": [["BB 350", "BB 450"], ["MB 302", "MB 302H"]]
}, {
  "corequisites": [],
  "course_name": "TOPICS IN FERMENTATION",
  "course_number": "FST 480",
  "credits": "0-2",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD PACKAGING",
  "course_number": "FST 495",
  "credits": "3",
  "description": "Fundamentals of food packaging covering the major packaging solutions with a focus on plastic, paper, glass, metal, and paperboard. Modeling of gas and water permeation and accelerated shelf testing. Regulations in food contact surface and related to indirect food additives.",
  "prerequisites": [["MTH 111", "MTH 111Z"], ["PH 201"], ["CH 331"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "FST 499",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "FST 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "FST 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "FST 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "FST 507",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM IN TEACHING",
  "course_number": "FST 509",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "FST 510",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SENSORY EVALUATION OF FOOD",
  "course_number": "FST 520",
  "credits": "3",
  "description": "Covers sensory techniques used in the evaluation of the taste, smell, texture, and appearance of foods as well as the evaluation of consumer acceptance. Examines methods for measuring sensory qualities, underlying psychological principles, and statistical methods for analyzing data.",
  "prerequisites": [["ST 511"], ["ST 512"]]
}, {
  "corequisites": [],
  "course_name": "FOOD LAW",
  "course_number": "FST 521",
  "credits": "3",
  "description": "Concepts, statutes, regulations, and agencies controlling the production, processing, and distribution and promotion of food.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD CHEMISTRY FUNDAMENTALS",
  "course_number": "FST 522",
  "credits": "4",
  "description": "An integrated course applying theories of molecular reactivity to model food systems. Lectures focus on the molecular bases of chemical phenomena that dictate the behavior of foods. Laboratories and recitations provide opportunities for students to observe, manipulate, and explore model food systems. Emphasis on major food components (water, lipids, proteins, and carbohydrates) and their behavior under conditions of particular relevance to food processing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD ANALYSIS",
  "course_number": "FST 523",
  "credits": "4",
  "description": "An integrated laboratory/lecture course covering methods used for the quantitative analysis of the chemical composition of foods and agricultural products.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD SYSTEMS CHEMISTRY",
  "course_number": "FST 525",
  "credits": "4",
  "description": "The chemistry of food components in real-world food systems. Focused on water, proteins, carbohydrates, lipids, and food polymers, their interactions, and the effects of food processing and storage. Integrates writing as a learning tool and means of professional communication.",
  "prerequisites": [["FST 522"]]
}, {
  "corequisites": [],
  "course_name": "SENSORY EVALUATION OF FOOD LABORATORY",
  "course_number": "FST 528",
  "credits": "1",
  "description": "Emphasizes sensory techniques used in the evaluation of the taste, smell, texture, and appearance of foods as well as the evaluation of consumer acceptance. This includes methods for measuring sensory qualities, statistical methods for analyzing data, and proper interpretation of these results. Focuses on sample presentation, dealing with panelists, data recording, data analysis, interpretation of results, and report writing.",
  "prerequisites": [["FST 520"]]
}, {
  "corequisites": [],
  "course_name": "CHEMISTRY AND BIOCHEMISTRY OF DISTILLED SPIRITS",
  "course_number": "FST 537",
  "credits": "3",
  "description": "The underlying science of the production of the distilled spirits will be discussed systematically. The course will cover the requirements for water, the major raw materials (eg. cereals, fruits, agave, syrups, and woods for maturation) and the conversion of these into fermentable extract. The scientific principles of fermentation will be explored, in the context of both ethanol and secondary metabolite production. Distillation will be considered, in terms of the physics and chemistry of liquid-liquid separations, before discussing post-fermentation options such as blending, maturation and product finishing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD AND CLIMATE CHANGE",
  "course_number": "FST 555",
  "credits": "3",
  "description": "Focus on traditional regional recipes, explore and document how global change has affected food production and demand until today and how projected climate change will affect it in the future by analyzing the ingredient lists. Focus on one recipe/ingredient, find maps of past/current crop ranges, document changes, establish the carbon footprint, and identify possible replacement ingredients projecting future culinary solutions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CHEMISTRY AND BIOCHEMISTRY OF BEER",
  "course_number": "FST 560",
  "credits": "3",
  "description": "Explores the chemistry, biochemistry, microbiology and engineering of malting and brewing operations for the production of beer, including the compositional analysis of barley, malt, hops, water, and beer and their effects on beer quality.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRODUCTION AND ANALYSIS OF BEER",
  "course_number": "FST 563",
  "credits": "2",
  "description": "Examines the chemical, microbiological, physical, and sensory analyses for assessing beer quality.",
  "prerequisites": []
}, {
  "corequisites": [["FST 463"]],
  "course_name": "PRODUCTION AND ANALYSIS OF BEER LABORATORY",
  "course_number": "FST 564",
  "credits": "1",
  "description": "Focuses on hands-on instruction of brewery operations and analytical techniques for producing and assessing beer.",
  "prerequisites": [["FST 560"]]
}, {
  "corequisites": [],
  "course_name": "CHEMISTRY AND BIOCHEMISTRY OF WINE",
  "course_number": "FST 566",
  "credits": "3",
  "description": "Explores principles of wine production technology from grape berry development through bottling, covering the microbiology and chemistry and biochemistry of fermentation, aging and production practices of red and white table wines as well as sparkling and dessert wines.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRODUCTION AND ANALYSIS OF WINE",
  "course_number": "FST 569",
  "credits": "2",
  "description": "Examines the fundamentals of red and white wine production including procedures and equipment used and application of key chemical, microbial, and sensory analysis techniques to assess wine.",
  "prerequisites": [["FST 566"], ["FST 579"]]
}, {
  "corequisites": [["FST 569"]],
  "course_name": "PRODUCTION AND ANALYSIS OF WINE LABORATORY",
  "course_number": "FST 570",
  "credits": "3",
  "description": "Focuses on the production of red and white wine and the key analytical techniques utilized in the wine industry (chemical, microbiological, and sensorial) during the production of wine.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD ENGINEERING AND PROCESSING I",
  "course_number": "FST 572",
  "credits": "4",
  "description": "Covers fundamental engineering principles for scientists and non-process engineers. Explores unit conversion, mass and energy balances, heat transfer, thermal processing, and lethality. Directed at food scientists and other majors who need or would like a working knowledge of food engineering principles.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD ENGINEERING AND PROCESSING II",
  "course_number": "FST 573",
  "credits": "4",
  "description": "Covers fundamental engineering principles for scientists and non-process engineers. Explores mass transfer, extrusion, filtration, osmosis, distillation, extraction, drying, and freezing.",
  "prerequisites": [["FST 572"]]
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF WINE PRODUCTION",
  "course_number": "FST 574",
  "credits": "3",
  "description": "Examines the fundamentals of wine production including grape and wine composition, key winemaking steps, and regulatory compliance.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WINE APPRECIATION AND ETIQUETTE",
  "course_number": "FST 575",
  "credits": "3",
  "description": "Explores wine etiquette and appreciation as a wine drinker. Examine major old and new wine regions of the world, analyze wine labels. Practice the use of sensory descriptors that are associated with major wine varieties, wine glasses, and the proper way to taste/order wine. Describe wine spoilage.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FERMENTATION MICROBIOLOGY",
  "course_number": "FST 579",
  "credits": "3",
  "description": "Introduction to fermentation microbiology that emphasizes the evolution of key physiological traits and biochemical pathways within key microbial genera. Explores the microbial ecology of processes used to make alcoholic beverages, food ingredients, and fermented foods. CROSSLISTED as FST 579/MB 579.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD PACKAGING",
  "course_number": "FST 595",
  "credits": "3",
  "description": "Fundamentals of food packaging covering the major packaging solutions with a focus on plastic, paper, glass, metal, and paperboard. Modeling of gas and water permeation and accelerated shelf testing. Regulations in food contact surface and related to indirect food additives.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "FST 599",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "FST 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "FST 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "FST 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "FST 607",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED TOPICS IN SENSORY SCIENCE",
  "course_number": "FST 620",
  "credits": "2",
  "description": "Current and/or advanced subjects in human sensory science. Includes 1) topics in human flavor perception that covers human psychophysics, neuroscience, and related fields, and 2) sensory evaluation techniques and data handling methods that are advanced in nature. Different points of view regarding above topics will be discussed.",
  "prerequisites": [["FST 520"]]
}, {
  "corequisites": [],
  "course_name": "FLAVOR CHEMISTRY",
  "course_number": "FST 628",
  "credits": "3",
  "description": "The definition of flavor, analytical methods in flavor chemistry, and mechanisms of odor interaction in food system will be discussed. In addition, an integrated approach will be used to study the flavor chemistry of economically-important agricultural products in the Pacific Northwest such as dairy products, fruits, and alcoholic beverages.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOOD POLYMER SCIENCE",
  "course_number": "FST 639",
  "credits": "3",
  "description": "Investigates the theoretical principles and structure-function relationships of food macromolecules. The theoretical principles are related, where possible, to observable phenomena during thermal processing and storage of foods.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROCESSING WHEAT AND OTHER SMALL GRAINS: A MOLECULAR VIEW",
  "course_number": "FST 641",
  "credits": "3",
  "description": "Provides a fundamental overview of wheat and other cereals from the perspective of the molecular level events that are important in milling, baking, and other processes. Uses cereal processing (focused primarily on bread-making) as the vehicle for placing elements of food chemistry, food polymer science, physical chemistry, and rheology into the cohesive framework of a single food category. Students will experience how the sciences of chemistry, physics, engineering, microbiology, biochemistry, nutrition, etc. amalgamate in the production of the selected cereal products.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED TOPICS IN ENOLOGY",
  "course_number": "FST 666",
  "credits": "3",
  "description": "An in-depth investigation of advanced wine processing techniques and wine research, focusing on their impact on production and wine quality.",
  "prerequisites": [["FST 566"], ["FST 567", "FST 569"], ["FST 570"]]
}]