[{
  "corequisites": [],
  "course_name": "ORIENTATION TO FISHERIES AND WILDLIFE",
  "course_number": "FW 107",
  "credits": "1",
  "description": "Information relevant to academic pathways and career planning in the fields of fisheries and wildlife.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO MARINE LIFE IN THE SEA-MARINE BIRDS AND MAMMALS",
  "course_number": "FW 113",
  "credits": "1",
  "description": "Introduces first- and second-year undergraduates, teachers and non-degree students to the breadth of marine science course offerings and research at Oregon State University’s Hatfield Marine Science Center located in Newport, Oregon. Using an experiential based format, students collect field data to better understand marine mammals (whales, dolphins and porpoises), seabirds, and their interactions with their environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "FW 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "FW 199H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CAREER SKILLS IN FISHERIES AND WILDLIFE SCIENCES",
  "course_number": "FW 209",
  "credits": "1",
  "description": "A foundation for life-long career development in fisheries and wildlife sciences. Practice the skills needed to search, apply, and attain internships and jobs.",
  "prerequisites": ["FW 107"]
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF FISH AND WILDLIFE CONSERVATION",
  "course_number": "FW 251",
  "credits": "3",
  "description": "History of conservation and natural resource use; ecological principles, and social and economic limitations of conservation; principles and practices of wildlife and fisheries management; role of research in management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FIELD SAMPLING OF FISH AND WILDLIFE",
  "course_number": "FW 255",
  "credits": "3",
  "description": "Introduction to sampling populations and communities of vertebrate animals emphasizing sampling design, collection and management of data, and communication of results.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMUNICATION SKILLS FOR FISHERIES AND WILDLIFE PROFESSIONALS",
  "course_number": "FW 289",
  "credits": "4",
  "description": "Introduces students to the theoretical and practical dimensions of interpersonal and public communication in a natural resource management field.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FIELD TECHNIQUES FOR MARINE MAMMAL CONSERVATION",
  "course_number": "FW 301",
  "credits": "1",
  "description": "A laboratory and hands-on experience covering field techniques, computer software for data organization and analyses, and understanding the practical management conservation application.",
  "prerequisites": ["FW 302"]
}, {
  "corequisites": [],
  "course_name": "BIOLOGY AND CONSERVATION OF MARINE MAMMALS",
  "course_number": "FW 302",
  "credits": "4",
  "description": "An examination of the biology of whales, pinnipeds, and other marine mammals, including general adaptations to a marine existence; systematics and biogeography; reproduction; diving physiology; communication and echolocation; feeding and migratory behavior; and marine mammal/human interactions; including conservation issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SURVEY OF GEOGRAPHIC INFORMATION SYSTEMS IN NATURAL RESOURCE",
  "course_number": "FW 303",
  "credits": "3",
  "description": "Concepts underlying geographic information systems, global positioning system, and remote sensing; application to management and research, data quality issues, and case studies. Not a lab/skills class.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIALIZATION DEVELOPMENT",
  "course_number": "FW 307",
  "credits": "1",
  "description": "Examine career alternatives, develop career goals, learn what knowledge, skills, and abilities are important for diverse careers in fisheries and wildlife conservation, and develop an academic and lifelong plan for achieving career goals. Intended to assist students in developing a specialization in fisheries and wildlife sciences.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ORNITHOLOGY",
  "course_number": "FW 311",
  "credits": "3",
  "description": "Survey of the adaptations of birds to a diverse array of habitats. Topics include origins, anatomy, reproductive strategies, migration, flight, behavior, physiology, nutrition, and conservation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SYSTEMATICS OF BIRDS",
  "course_number": "FW 312",
  "credits": "3",
  "description": "Describes the external anatomy of birds using scientific terminology. Evaluates the evolutionary relationships of birds using modern naming procedures, and identifies birds by sight and sound.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ICHTHYOLOGY",
  "course_number": "FW 315",
  "credits": "3",
  "description": "A survey of the diversity of biological adaptations of fishes. Topics include physiological and zoogeographical adaptations, reproduction, evolution, cladogenesis, morphology, behavior, and genetics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SYSTEMATICS OF FISHES",
  "course_number": "FW 316",
  "credits": "3",
  "description": "Phylogenetic diversity, evolution, relationships and identification of the world's fishes, with particular focus on Oregon fishes. Includes identification, anatomy, use of keys, introduction to the comparative method, systematic theory, taxonomy, field collection and specimen curation.",
  "prerequisites": ["BI 211", "BI 211H", "BI 221", "BI 221H", "BI 204", "BI 212", "BI 212H", "BI 222", "BI 222H", "BI 205", "BI 213", "BI 213H", "BI 223", "BI 223H", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "MAMMALOGY",
  "course_number": "FW 317",
  "credits": "3",
  "description": "A survey of the origins, evolution, diversity, and adaptations of mammals to diverse environments. Topics include taxonomy, reproduction, sensory perception, herbivory, population cycles and behavior.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SYSTEMATICS OF MAMMALS",
  "course_number": "FW 318",
  "credits": "3",
  "description": "Explore the diversity of mammals in temperate North America, with a focus on species in Oregon. Use skull, dentition, and pelt characteristics to classify mammals to order, family, genus and species. Describe habitat, range, diet, physical characteristics, and systematic relationships of mammal species. Learn and apply scientific skills, concepts, and terminology of mammalian systematics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY POPULATION DYNAMICS",
  "course_number": "FW 320",
  "credits": "4",
  "description": "Principles and concepts of population dynamics related to fish and wildlife populations; methods of estimating abundance, mortality, sustainable harvest levels and extinction risk; hands-on introduction to models for population analysis.",
  "prerequisites": ["BI 370", "BI 370H", "BI 371"]
}, {
  "corequisites": [],
  "course_name": "APPLIED COMMUNITY AND ECOSYSTEM ECOLOGY",
  "course_number": "FW 321",
  "credits": "3",
  "description": "Perspectives in community and ecosystem ecology, and their use in management of fisheries and wildlife resource systems.",
  "prerequisites": ["FW 320"]
}, {
  "corequisites": [],
  "course_name": "MANAGEMENT PRINCIPLES OF PACIFIC SALMON IN THE NORTHWEST",
  "course_number": "FW 323",
  "credits": "3",
  "description": "Explores the nature of the salmon problem in the Northwest. Experts from diverse disciplines describe principles of salmon biology, habitat ecology and management, socioeconomics of direct and indirect users, and government policies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*FOOD FROM THE SEA",
  "course_number": "FW 324",
  "credits": "3",
  "description": "Where does seafood come from, and how does seafood arrive on a plate? How productive are the world’s oceans, and can the oceans continue to produce enough to feed (and employ) the masses? How do different cultures, ethnicities, and regions of the world rely upon food from the sea for daily meals? Food from the Sea is an exploration of the cultural, societal, economic, practical, and environmental features of the protein that feeds billions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*FOOD FROM THE SEA",
  "course_number": "FW 324H",
  "credits": "3",
  "description": "Where does seafood come from, and how does seafood arrive on a plate? How productive are the world’s oceans, and can the oceans continue to produce enough to feed (and employ) the masses? How do different cultures, ethnicities, and regions of the world rely upon food from the sea for daily meals? Food from the Sea is an exploration of the cultural, societal, economic, practical, and environmental features of the protein that feeds billions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GLOBAL CRISES IN RESOURCE ECOLOGY",
  "course_number": "FW 325",
  "credits": "3",
  "description": "Historical and contemporary implications of the impacts of burgeoning human populations on rates and patterns of global ecological change. Changes in ecosystem processes and crises of species extinction in the context of cultural and political institutions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTEGRATED WATERSHED MANAGEMENT",
  "course_number": "FW 326",
  "credits": "3",
  "description": "A comprehensive approach to watershed management, one that includes biophysical, socioeconomic, planning and education related topics. Intended for students interested in the sustainable management of natural resources.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WILDLIFE CAPTURE AND IMMOBILIZATION",
  "course_number": "FW 328",
  "credits": "2",
  "description": "Manual and chemical restraint methods are covered with an emphasis on darting equipment, animal and human safety, drug pharmacology and species specific recommendations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECOLOGY OF MARINE AND ESTUARINE BIRDS",
  "course_number": "FW 331",
  "credits": "4",
  "description": "Focusing on how marine and estuarine birds are adapted for life at sea. Topics include morphology, physiology, foraging ecology, and biogeography as well as introductory oceanography. Field trips.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*MULTICULTURAL PERSPECTIVES IN NATURAL RESOURCES",
  "course_number": "FW 340",
  "credits": "3",
  "description": "Explores multicultural influences on development of natural resources in the American West. Effects of diverse social values on changes in the physical landscape and biodiversity.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FISH AND WILDLIFE LAW ENFORCEMENT",
  "course_number": "FW 341",
  "credits": "2",
  "description": "Introduction to the philosophy, purposes, and methods of enforcing natural resource laws, emphasizing fish and wildlife laws.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GLOBAL CHANGE BIOLOGY",
  "course_number": "FW 345",
  "credits": "3",
  "description": "Global Change Biology is the study of the impact of climate change on natural systems and actions to mitigate (slow) or adapt to climate change. Global climate change is having dramatic effects on natural resources including fish and wildlife populations and their habitats. Students will gain an understanding of the role that natural ecosystems (oceans, forests, wetlands, grasslands etc.) play in regulating the climate; how land use affects the earth’s climate; how climate change will affect fish, wildlife and their habitats; and the role that managers and researchers can play in mitigating and adapting to climate change.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GLOBAL CHANGE BIOLOGY",
  "course_number": "FW 345H",
  "credits": "3",
  "description": "Global Change Biology is the study of the impact of climate change on natural systems and actions to mitigate (slow) or adapt to climate change. Global climate change is having dramatic effects on natural resources including fish and wildlife populations and their habitats. Students will gain an understanding of the role that natural ecosystems (oceans, forests, wetlands, grasslands etc.) play in regulating the climate; how land use affects the earth’s climate; how climate change will affect fish, wildlife and their habitats; and the role that managers and researchers can play in mitigating and adapting to climate change.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ENDANGERED SPECIES",
  "course_number": "FW 350",
  "credits": "SOCIETY",
  "description": "Provides a general background to endangered species biology, and the social and economic implications of the legislation enacted to conserve endangered species (Endangered Species Act, CITES Treaty).",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL CONTAMINANTS IN FISH AND WILDLIFE",
  "course_number": "FW 366",
  "credits": "3",
  "description": "Environmental contamination is an important threat to many fish and wildlife populations and the habitats and prey upon which they rely. The field of ecotoxicology links the ecology of fish and wildlife with toxicology of environmental contaminants, and so spans political, scientific, and public relations realms. Through the pairing of introductory concepts with key case studies, this course provides students with a preparatory framework for understanding toxicological issues of importance for those focused on studying, managing or conserving fish and wildlife populations.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205"]
}, {
  "corequisites": [],
  "course_name": "CONSERVATION GENETICS",
  "course_number": "FW 370",
  "credits": "4",
  "description": "A foundational course in preparation for a degree focused on conservation of natural resources. Covers a broad range of topics associated with issues surrounding genetics that working professionals in the biological sciences should be conversant about. One of the most important aspects of the course is the development of problem-solving and critical-thinking skills.",
  "prerequisites": ["BI 211", "BI 211H", "BI 221", "BI 221H", "BI 204", "BI 212", "BI 212H", "BI 222", "BI 222H", "BI 205", "BI 213", "BI 213H", "BI 223", "BI 223H", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL PHYSIOLOGY OF FISHES",
  "course_number": "FW 371",
  "credits": "3",
  "description": "Introduces fish physiology and the interactions between physiological systems in fishes and both natural and human-modified habitats and ecosystems. Describes key aspects of fish physiology, understand how to use physiology to define fish health, and consider how large environmental factors like climate change will influence fish health. Examples and case histories will emphasize marine, estuarine, and anadromous fishes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*RIDGE TO REEF: SUSTAINABLE RESOURCE MANAGEMENT IN PALAU",
  "course_number": "FW 391",
  "credits": "4",
  "description": "How do small islands address issues of natural resource management, food security, and sustainability? What role do communities, governments, and non-profits play in addressing these issues? Can traditional ecological knowledge help solve these challenges? What about climate change on small Islands? The Republic of Palau will be our classroom. Students will work with and learn from fishers, farmers, community leaders, traditional chiefs, terrestrial and marine biologists, and policy makers. Key topics include food security/production, climate change adaptation, protected area management, biocultural conservation, sustainable forest management, watershed management, sustainable development, coral reef and fisheries management, biodiversity measurement methods and ecosystem restoration.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "FW 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "FW 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "FW 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "FW 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "FW 407H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "FW 408",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "FW 410",
  "credits": "1-6",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FISHERIES AND WILDLIFE LAW AND POLICY",
  "course_number": "FW 415",
  "credits": "3",
  "description": "Provides students with an understanding of the key legal frameworks within which they will work to conserve fish and wildlife resources. Examines federal law and policy relating to allocation and conservation of fish and wildlife resources.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "URBAN ECOLOGY",
  "course_number": "FW 418",
  "credits": "3",
  "description": "Understand how an increasing human population increases pressure on fish and wildlife communities and resources within ecosystems. Examines the interactions between humans and animal species within urban areas and the effects of urbanization on species, communities, and ecosystems. Topics include conserving biodiversity, invasive species, human health and well-being, and urban planning.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE NATURAL HISTORY OF WHALES AND WHALING",
  "course_number": "FW 419",
  "credits": "3",
  "description": "Addresses the natural history of whales as a unique example of adaptation in an evolutionary lineage, and the history of whaling as a general example of the failings of international resource management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AQUATIC BIOLOGICAL INVASIONS",
  "course_number": "FW 421",
  "credits": "4",
  "description": "An overview of the background, theory, evolution, ecology, politics and conservation of invasions by introduced species in aquatic environments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO OCEAN LAW",
  "course_number": "FW 422",
  "credits": "3",
  "description": "Examination of US law and primary international law focused on fisheries management with coverage of regulation of other ocean resources including energy, marine mammals, endangered species, pollution, and protected areas. Final project is intended to provide students with hands-on exposure to real-world fisheries and ocean management issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COASTAL ECOLOGY AND RESOURCE MANAGEMENT",
  "course_number": "FW 426",
  "credits": "5",
  "description": "Study of the ecology and management of coastal marine and freshwater ecosystems as well as natural resources, emphasizing experimental (participatory) learning in a field station setting.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF WILDLIFE DISEASES",
  "course_number": "FW 427",
  "credits": "4",
  "description": "Examines the general principles of how wildlife diseases emerge, evolve, and spread. Explores the relationships between human society, environmental change, and wildlife disease. Emphasizes how global environmental change (e.g. climate change, land use change, globalization of travel and trade) affect disease dynamics and cross-species transmission. Covers disease examples of North American mammals, birds, reptiles, and amphibians.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO SCIENTIFIC DIVING",
  "course_number": "FW 430",
  "credits": "4",
  "description": "Prepares students to manage the task loading associated with performing scientific work underwater through a combination of classroom, confined water, and open water training. Introduces the diver to basic techniques and equipment used in underwater data collection. Includes required field trips to dive in both freshwater and marine habitats (two single-day trips and one three-day trip).",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "POPULATION DYNAMICS FOR CONSERVATION",
  "course_number": "FW 433",
  "credits": "4",
  "description": "Synthesizes the principles of population dynamics from the viewpoint of a resource manager. Focuses on populations structured by age, size, or over space, and considers both fisheries and wildlife management. Uses computer programming in the R language in the laboratory work to implement examples from lecture.",
  "prerequisites": ["FW 320", "BI 483", "MTH 227", "MTH 228", "MTH 251", "MTH 251H", "MTH 252", "MTH 252H"]
}, {
  "corequisites": [],
  "course_name": "ESTUARINE ECOLOGY",
  "course_number": "FW 434",
  "credits": "4",
  "description": "Integrated and synthetic training in the ecological processes of estuarine environments, with emphases on ecological interactions among organisms and the biogeochemical cycling of carbon and nitrogen. Topics include geomorphology, estuarine physics and chemistry, primary and secondary producers, ecosystem metabolism, element cycling, food webs, fisheries, restoration, management, and impacts of climate. Field trip required, transportation fee charged. CROSSLISTED as FW 434/OC 434.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^WILDLIFE IN AGRICULTURAL ECOSYSTEMS",
  "course_number": "FW 435",
  "credits": "3",
  "description": "Examines the relationships between agricultural production and fish and wildlife populations and communities. Explores the impacts of agricultural practices on fish and wildlife. Field trips required; transportation fee charged. OSU Ecampus students are not required to attend field trips.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^HUMAN DIMENSIONS OF FISHERIES AND WILDLIFE MANAGEMENT",
  "course_number": "FW 439",
  "credits": "3",
  "description": "Examines the human dimensions of fisheries and wildlife including economics, policy, communications, and management. Focuses on the application of social scientific theories and approaches to fisheries and wildlife issues. Independent and group work with a substantial writing component.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HERPETOFAUNA CONSERVATION AND MANAGEMENT",
  "course_number": "FW 448",
  "credits": "3",
  "description": "Reviews life history traits of amphibians and reptiles and the wide variety of factors that threaten herpetofauna populations worldwide. Discusses a variety of sampling techniques and current laws and policies that directly impact herpetofauna management. Focuses on species and conservation strategies in the United States, but international conservation efforts will be discussed as well.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AVIAN CONSERVATION AND MANAGEMENT",
  "course_number": "FW 451",
  "credits": "3",
  "description": "Identification, classification, life history strategies, ecology and management of upland and migratory birds.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BIODIVERSITY CONSERVATION IN MANAGED FORESTS",
  "course_number": "FW 452",
  "credits": "3",
  "description": "Designed for students in forestry, wildlife, fisheries and related fields. Introduces the concepts of, and approaches to, managing forest stands, landscapes and regions to achieve desired habitat conditions for indicator species and conservation of biological diversity. CROSSLISTED as FES 452/FW 452.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^FISHERY BIOLOGY",
  "course_number": "FW 454",
  "credits": "4",
  "description": "Principles and methods used in studying the biology of fishes; ecological requirements of freshwater and anadromous fishes; principles and practices in sport fishery management.",
  "prerequisites": ["FW 315", "FW 320"]
}, {
  "corequisites": [],
  "course_name": "FRESHWATER ECOLOGY AND CONSERVATION",
  "course_number": "FW 456",
  "credits": "5",
  "description": "Physical, chemical, biological, and environmental concepts in continental aquatic systems. Includes techniques related to assessing aquatic resources their management and conservation.",
  "prerequisites": ["BI 370", "BI 370H", "BI 371"]
}, {
  "corequisites": [],
  "course_name": "BIOLOGY",
  "course_number": "FW 457X",
  "credits": "ECOLOGY",
  "description": "Provides a comprehensive overview of the ecology, biology, and evolution of marine mammals, which are globally distributed, shape marine ecosystems, and are inextricably linked to humans. Examines adaptations of marine mammals to the marine environment, biogeography, bioacoustics, ecological roles, social, feeding and migratory behavior, and conservation issues. Emphasizes integrative learning through lectures, group discussions and debates, field activities, lab work, analyses of real-world data, and interaction with a wide variety of professions and fields related to marine mammal science.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MAMMAL CONSERVATION AND MANAGEMENT",
  "course_number": "FW 458",
  "credits": "4",
  "description": "A thorough understanding of the management, conservation, and ecology of mammals in North America; includes population dynamics, harvest management, techniques to determine abundance, diets, reproduction, and the cultural and political variables that contribute to formulation of management programs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO MARINE BIOACOUSTICS",
  "course_number": "FW 461X",
  "credits": "3",
  "description": "Focuses on passive and active acoustic sources, sound production mechanisms, animal communication, tools used, and the impacts of human-made noise on animals. Provides experience in collecting and analyzing acoustic data based on the sounds made and used by different species to make hydrophones. Analyzes how bioacoustics can be used in conservation studies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECOSYSTEM SERVICES",
  "course_number": "FW 462",
  "credits": "3",
  "description": "Introduces students to the ecological, economic, and social/ethical issues involved in the study of ecosystem services, with a major focus on biological components involved in ecosystem services. Topics covered include: 1) an introduction to the roles that living organisms play in the provision of ecosystem services, 2) the relationship of ecosystem functions and services, 3) the societal factors that influence this relationship, 4) general categories of ecosystem services, 5) identification of potential ecosystem services in terrestrial and aquatic systems, 6) an overview of the methods of valuation, and 7) translating ecosystems functions to services. Case studies will be used to illustrate key concepts and relationships within different ecological and social contexts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MARINE CONSERVATION BIOLOGY",
  "course_number": "FW 464",
  "credits": "3",
  "description": "Lectures, group library research, and class debates on current issues regarding the conservation of biodiversity in the sea. Topics include overfishing, invasive species, eutrophication, marine pollution, and global warming, as well as means of addressing these threats.",
  "prerequisites": ["BI 370", "BI 370H"]
}, {
  "corequisites": [],
  "course_name": "BEHAVIORAL ECOLOGY OF MARINE ANIMALS",
  "course_number": "FW 466",
  "credits": "3",
  "description": "Examines how the social lives of animals contributes to solving fundamental life challenges—eat, not be eaten, reproduce—from an evolutionary and ecological perspective. Examines how group-living shape animal societies in terms of structure, organization, mating and care systems. Explores fundamental concepts of behavioral ecology, sociobiology, social evolution, with emphasis on marine megafauna (cetaceans, pinnipeds, seabirds, elasmobranchs). Combines lectures, groups discussions, field activities, and data analyses on animal societies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ANTARCTIC SCIENCE AND CONSERVATION",
  "course_number": "FW 467",
  "credits": "4",
  "description": "Explores the history, geology, climate, and ecosystems of Antarctica, with an emphasis on current research and conservation issues. Focuses on critical thinking skills developed through independent research on a topic of interest, an internal peer review project, and discussions of relevant case studies in Antarctic research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "METHODS IN PHYSIOLOGY AND BEHAVIOR OF MARINE MEGAFAUNA",
  "course_number": "FW 469",
  "credits": "4",
  "description": "An in-depth study of marine megafauna (mammals, birds, turtles) with an emphasis on methods and analyses of behavior and physiology for conservation. Lab and field exercises include investigations into the behavior–physiology nexus of diving, migration, thermoregulation, energy expenditure, and mating systems. Research techniques to be explored will include, for example, tracking and remote biotelemetry monitoring technologies, respirometry, genetics, and direct field study observation. Theoretical approaches, field techniques and statistical analyses will help prepare students for a career in fisheries or wildlife science.",
  "prerequisites": ["BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "FISH ECOLOGY",
  "course_number": "FW 473",
  "credits": "4",
  "description": "Explores how fish physiology and behavior interact with spatial and temporal heterogeneity in aquatic ecosystems. Considers emergent properties at population, community, and ecosystem levels and their implications for management and conservation.",
  "prerequisites": ["BI 370", "BI 370H", "FW 315"]
}, {
  "corequisites": [],
  "course_name": "EARLY LIFE HISTORY OF FISHES",
  "course_number": "FW 474",
  "credits": "4",
  "description": "Overview of diversity of development patterns in fishes; emphasis on morphology, life history, and evolution. Offered alternate years. CROSSLISTED as FW 474/OC 474.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WILDLIFE BEHAVIOR",
  "course_number": "FW 475",
  "credits": "4",
  "description": "Emphasizes adaptive significance of egocentric and social behavior of wildlife species. Discusses implications of behavior in sound management practice.",
  "prerequisites": ["FW 255"]
}, {
  "corequisites": [],
  "course_name": "FISH PHYSIOLOGY",
  "course_number": "FW 476",
  "credits": "4",
  "description": "Physiological specializations and adaptations of major groups of fishes.",
  "prerequisites": ["FW 315"]
}, {
  "corequisites": [],
  "course_name": "WETLANDS AND RIPARIAN ECOLOGY",
  "course_number": "FW 479",
  "credits": "3",
  "description": "Ecology of riparian freshwater and estuarine wetlands of the Pacific Northwest. Effects of land use on ecosystem structure, function, biodiversity, and restoration will be explored.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WILDLIFE ECOLOGY",
  "course_number": "FW 481",
  "credits": "3",
  "description": "Interrelationships of wildlife, environmental change. Predicting and measuring responses of wildlife to altered habitat conditions",
  "prerequisites": ["BI 370", "BI 370H", "BI 371"]
}, {
  "corequisites": [],
  "course_name": "PROBLEM SOLVING IN FISHERIES AND WILDLIFE SCIENCE",
  "course_number": "FW 488",
  "credits": "3",
  "description": "A capstone course designed to introduce students to the synthesis of scientific information on species, habitats and ecosystems and the use of such data in shaping fisheries and wildlife conservation, management and policy. Includes a group problem-solving project and case studies.",
  "prerequisites": ["FW 320", "FW 321"]
}, {
  "corequisites": [],
  "course_name": "FISH DISEASES IN CONSERVATION BIOLOGY AND AQUACULTURE",
  "course_number": "FW 491",
  "credits": "3",
  "description": "Introduction to diseases of fish including pathogens important to aquaculture and ornamental industries as well as to wild fish populations and conservation programs. CROSSLISTED as FW 491/MB 491 and FW 591/MB 591.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^AQUACULTURE",
  "course_number": "FW 497",
  "credits": "3",
  "description": "Principles and practices for the aquaculture of fish, shellfish, and algae.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AQUACULTURE LABORATORY",
  "course_number": "FW 498",
  "credits": "3",
  "description": "Biology and culture requirements of fish, shellfish, and algae. Emphasis on laboratory culture techniques and practical experience in handling organisms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN FISHERIES AND WILDLIFE",
  "course_number": "FW 499",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "FW 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEACHING METHODS IN FISHERIES AND WILDLIFE",
  "course_number": "FW 502",
  "credits": "1",
  "description": "This is a discussion course designed to help new GTAs and instructors who are learning the trials and tribulations of university-level teaching in our department. This is a great course for students who are interested in hearing more about teaching approaches, grading and assessment, student communication, problem students, and development of teaching.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "FW 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "FW 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "FW 506",
  "credits": "1-6",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "FW 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "FW 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "FW 509",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL INTERNSHIP",
  "course_number": "FW 510",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL DEVELOPMENT: MEETING COMMUNICATIONS",
  "course_number": "FW 514",
  "credits": "1-3",
  "description": "Fisheries and wildlife professionals use meetings of scientists, managers and stakeholders to communicate key findings and develop consensus recommendations for policy. This experiential learning course exposes students to a scientific or management meeting in their chosen field (fisheries, wildlife, ecology, or conservation biology) and gets them to think about how meetings function as well as their content.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "US WILDLIFE LAW",
  "course_number": "FW 515",
  "credits": "3",
  "description": "Explores US treaty and statutory law in the context of contemporary conservation of island fish and wildlife species. Includes the context of the framework’s historical evolution from the Public Trust Doctrine and other common law concepts, Tribal, State, Territorial, and Federal management and collaborations therein, examining judicial decisions to illustrate key examples of the system’s application, process, and outcomes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "URBAN ECOLOGY",
  "course_number": "FW 518",
  "credits": "3",
  "description": "Understand how an increasing human population increases pressure on fish and wildlife communities and resources within ecosystems. Examines the interactions between humans and animal species within urban areas and the effects of urbanization on species, communities, and ecosystems. Topics include conserving biodiversity, invasive species, human health and well-being, and urban planning.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE NATURAL HISTORY OF WHALES AND WHALING",
  "course_number": "FW 519",
  "credits": "3",
  "description": "Addresses the natural history of whales as a unique example of adaptation in an evolutionary lineage, and the history of whaling as a general example of the failings of international resource management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AQUATIC BIOLOGICAL INVASIONS",
  "course_number": "FW 521",
  "credits": "4",
  "description": "An overview of the background, theory, evolution, ecology, politics and conservation of invasions by introduced species in aquatic environments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO OCEAN LAW",
  "course_number": "FW 522",
  "credits": "3",
  "description": "Examination of US law and primary international law focused on fisheries management with coverage of regulation of other ocean resources including energy, marine mammals, endangered species, pollution, and protected areas. Final project is intended to provide students with hands-on exposure to real-world fisheries and ocean management issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MONITORING WILDLIFE POPULATIONS AND THEIR HABITATS",
  "course_number": "FW 523",
  "credits": "3",
  "description": "An overview of monitoring plan design and the conceptual background needed to understand and critique monitoring plans, and have the basic skills to develop and implement a monitoring program as part of an interdisciplinary team.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO FISHERIES ASSESSMENT",
  "course_number": "FW 524",
  "credits": "3",
  "description": "Fisheries management strategies rely on models that predict a population's responses to exploitation. Introduces approaches commonly used to assess and evaluate the dynamics and status of a population. Provides an overview of the terminology, data requirements, underlying rationale, assumptions, limitations and uncertainty associated with stock assessments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COASTAL ECOLOGY AND RESOURCE MANAGEMENT",
  "course_number": "FW 526",
  "credits": "5",
  "description": "Study of the ecology and management of coastal marine and freshwater ecosystems as well as natural resources, emphasizing experimental (participatory) learning in a field station setting.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF WILDLIFE DISEASES",
  "course_number": "FW 527",
  "credits": "4",
  "description": "Examines the general principles of how wildlife diseases emerge, evolve, and spread. Explores the relationships between human society, environmental change, and wildlife disease. Emphasizes how global environmental change (e.g. climate change, land use change, globalization of travel and trade) affect disease dynamics and cross-species transmission. Covers disease examples of North American mammals, birds, reptiles, and amphibians.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DIVERSITY AND IDENTIFICATION OF LARVAL FISHES",
  "course_number": "FW 528",
  "credits": "3",
  "description": "Research on early life history stages of fishes has increased considerably in recent years, due to its importance in many research fields, such as fisheries science and oceanography, species conservation, systematics and morphology. Simultaneously, the ability to identify ichthyoplankton has decreased. This course is intended to provide students with an understanding of the evolutionary diversity of ichthyoplankton of the world.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ICHTHYOPLANKTON IDENTIFICATION LABORATORY",
  "course_number": "FW 529",
  "credits": "3",
  "description": "Explores the phylogenetic diversity, relationships and the identification of samples from the Oregon State University Ichthyology collection. Covers identification based on available keys, comparison between systematic groups, comparative anatomy, interpretation of traits.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO SCIENTIFIC DIVING",
  "course_number": "FW 530",
  "credits": "4",
  "description": "Prepares students to manage the task loading associated with performing scientific work underwater through a combination of classroom, confined water, and open water training. Introduces the diver to basic techniques and equipment used in underwater data collection. Includes required field trips to dive in both freshwater and marine habitats (two single-day trips and one three-day trip).",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MACHINE LEARNING IN SPECIES DISTRIBUTION MODELING",
  "course_number": "FW 532",
  "credits": "3",
  "description": "Explores machine learning (ML) topics for building and evaluating species distribution models (SDMs). Examines ML approaches such as tree-based methods, maximum entropy methods, and cross-validation through reading and discussion of current literature as well as hands-on exercises in the R programming language. Culminates in student projects to apply the material.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "POPULATION DYNAMICS FOR CONSERVATION",
  "course_number": "FW 533",
  "credits": "4",
  "description": "Synthesizes the principles of population dynamics from the viewpoint of a resource manager. Focuses on populations structured by age, size, or over space, and considers both fisheries and wildlife management. Uses computer programming in the R language in the laboratory work to implement examples from lecture.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ESTUARINE ECOLOGY",
  "course_number": "FW 534",
  "credits": "4",
  "description": "Integrated and synthetic training in the ecological processes of estuarine environments, with emphases on ecological interactions among organisms and the biogeochemical cycling of carbon and nitrogen. Topics include geomorphology, estuarine physics and chemistry, primary and secondary producers, ecosystem metabolism, element cycling, food webs, fisheries, restoration, management, and impacts of climate. Field trip required, transportation fee charged. CROSSLISTED as FW 534/OC 534.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WILDLIFE IN AGRICULTURAL ECOSYSTEMS",
  "course_number": "FW 535",
  "credits": "3",
  "description": "Examines the relationships between agricultural production and fish and wildlife populations and communities. Explores the impacts of agricultural practices on fish and wildlife. Field trips required; transportation fee charged. OSU Ecampus students are not required to attend field trips.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STRUCTURED DECISION MAKING IN NATURAL RESOURCE MANAGEMENT",
  "course_number": "FW 537",
  "credits": "2",
  "description": "Structured decision making (SDM) is used for making natural resource management and policy decisions. It is an ideal framework for interdisciplinary teams to cooperate and identify the most effective management strategies. Graduate students from diverse backgrounds (natural resources, political science, others) are provided with an understanding of the SDM process.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMUNITY SCIENCE",
  "course_number": "FW 539",
  "credits": "3",
  "description": "Examines the growing movement of involving the public in scientific research and how community-driven projects function. Evaluates best practices of successful projects, sources and solutions for error and bias, opportunities to include diverse audiences and participants, and creation of new community science projects.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUANTITATIVE DECISION ANALYSIS FOR FISH AND WILDLIFE MANAGEMENT",
  "course_number": "FW 544",
  "credits": "4",
  "description": "Decision analysis allows decision makers to examine the expected effects of different strategies before implementation; incorporate multiple objectives and values of stakeholders; determine the relative influence of various sources of uncertainty; and estimate the value of collecting additional data. Quantitatively oriented graduate students in natural resources are provided with an in-depth overview of decision analysis and adaptive management, emphasizing animal population management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HERPETOFAUNA CONSERVATION AND MANAGEMENT",
  "course_number": "FW 548",
  "credits": "3",
  "description": "Reviews life history traits of amphibians and reptiles and the wide variety of factors that threaten herpetofauna populations worldwide. Discusses a variety of sampling techniques and current laws and policies that directly impact herpetofauna management. Focuses on species and conservation strategies in the United States, but international conservation efforts will be discussed as well.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY OF FISHERIES SCIENCE",
  "course_number": "FW 549",
  "credits": "3",
  "description": "Surveys the development of fisheries science, professionalization of the discipline, patronage, and the political, economic, and social context in which fisheries science operates.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TROPHIC CASCADES",
  "course_number": "FW 550",
  "credits": "2-3",
  "description": "Theory and empirical analysis of terrestrial carnivore effects on plants and ecosystems as mediated through herbivores. Emphasis on large carnivores, frequency/strength of trophic cascades, implications for ecosystem function, management, and restoration. Lectures, current literature, discussions, field exercise, term paper, and student presentations. CROSSLISTED as FES 550/FW 550.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AVIAN CONSERVATION AND MANAGEMENT",
  "course_number": "FW 551",
  "credits": "3",
  "description": "Identification, classification, life history strategies, ecology and management of upland and migratory birds.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST WILDLIFE HABITAT MANAGEMENT",
  "course_number": "FW 552",
  "credits": "4",
  "description": "Management of terrestrial vertebrates in forest ecosystems. Effects on silvicultural practices and landscape pattern on habitats and populations. CROSSLISTED as FES 552/FW 552.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FISHERY BIOLOGY",
  "course_number": "FW 554",
  "credits": "4",
  "description": "Principles and methods used in studying the biology of fishes; ecological requirements of freshwater and anadromous fishes; principles and practices in sport fishery management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FRESHWATER ECOLOGY AND CONSERVATION",
  "course_number": "FW 556",
  "credits": "5",
  "description": "Physical, chemical, biological, and environmental concepts in continental aquatic systems. Includes techniques related to assessing aquatic resources their management and conservation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BIOLOGY",
  "course_number": "FW 557X",
  "credits": "ECOLOGY",
  "description": "Provides a comprehensive overview of the ecology, biology, and evolution of marine mammals, which are globally distributed, shape marine ecosystems, and are inextricably linked to humans. Examines adaptations of marine mammals to the marine environment, biogeography, bioacoustics, ecological roles, social, feeding and migratory behavior, and conservation issues. Emphasizes integrative learning through lectures, group discussions and debates, field activities, lab work, analyses of real-world data, and interaction with a wide variety of professions and fields related to marine mammal science.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MAMMAL CONSERVATION AND MANAGEMENT",
  "course_number": "FW 558",
  "credits": "4",
  "description": "A thorough understanding of the management, conservation, and ecology of mammals in North America; includes population dynamics, harvest management, techniques to determine abundance, diets, reproduction, and the cultural and political variables that contribute to formulation of management programs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PSYCHOLOGY OF ENVIRONMENTAL DECISIONS",
  "course_number": "FW 560",
  "credits": "3",
  "description": "Natural resource management and conservation programs have one thing in common: to be effective, they must consider how and why humans make decisions. This course approaches this topic from a psychological lens and will cover the psychological processes associated with making individual and group decisions, common biases and heuristics in our decision-making, and how these apply to diverse natural resource management and conservation issues. Students will learn how to take these aspects of human decision making into consideration when participating in or facilitating collaborative environmental programs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO MARINE BIOACOUSTICS",
  "course_number": "FW 561X",
  "credits": "3",
  "description": "Focuses on passive and active acoustic sources, sound production mechanisms, animal communication, tools used, and the impacts of human-made noise on animals. Provides experience in collecting and analyzing acoustic data based on the sounds made and used by different species to make hydrophones. Analyzes how bioacoustics can be used in conservation studies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECOSYSTEM SERVICES",
  "course_number": "FW 562",
  "credits": "3",
  "description": "Introduces students to the ecological, economic, and social/ethical issues involved in the study of ecosystem services, with a major focus on biological components involved in ecosystem services. Topics covered include: 1) an introduction to the roles that living organisms play in the provision of ecosystem services, 2) the relationship of ecosystem functions and services, 3) the societal factors that influence this relationship, 4) general categories of ecosystem services, 5) identification of potential ecosystem services in terrestrial and aquatic systems, 6) an overview of the methods of valuation, and 7) translating ecosystems functions to services. Case studies will be used to illustrate key concepts and relationships within different ecological and social contexts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CONSERVATION BIOLOGY OF WILDLIFE",
  "course_number": "FW 563",
  "credits": "3",
  "description": "Overview of the field of conservation biology with emphasis on the relationship to conservation and management of wildlife.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MARINE CONSERVATION BIOLOGY",
  "course_number": "FW 564",
  "credits": "3",
  "description": "Lectures, group library research, and class debates on current issues regarding the conservation of biodiversity in the sea. Topics include overfishing, invasive species, eutrophication, marine pollution, and global warming, as well as means of addressing these threats.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BEHAVIORAL ECOLOGY OF MARINE ANIMALS",
  "course_number": "FW 566",
  "credits": "3",
  "description": "Examines how the social lives of animals contributes to solving fundamental life challenges—eat, not be eaten, reproduce—from an evolutionary and ecological perspective. Examines how group-living shape animal societies in terms of structure, organization, mating and care systems. Explores fundamental concepts of behavioral ecology, sociobiology, social evolution, with emphasis on marine megafauna (cetaceans, pinnipeds, seabirds, elasmobranchs). Combines lectures, groups discussions, field activities, and data analyses on animal societies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ANTARCTIC SCIENCE AND CONSERVATION",
  "course_number": "FW 567",
  "credits": "4",
  "description": "Explores the history, geology, climate, and ecosystems of Antarctica, with an emphasis on current research and conservation issues. Focuses on critical thinking skills developed through independent research on a topic of interest, an internal peer review project, and discussions of relevant case studies in Antarctic research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HUMAN DIMENSIONS OF MARINE MAMMAL CONSERVATION",
  "course_number": "FW 568",
  "credits": "4",
  "description": "Approaches for more ethical, equitable, and effective conservation of marine mammals. Issues in marine mammal conservation and key concepts related to the human (social, political, economic, and cultural) dimensions of conservation, and lessons learned from real-world examples. Topics will include: social-ecological systems; transdisciplinarity; Design Thinking; human rights-based approach to management; social science and participatory research methods; responsible community engagement; conservation evaluation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "METHODS IN PHYSIOLOGY AND BEHAVIOR OF MARINE MEGAFAUNA",
  "course_number": "FW 569",
  "credits": "4",
  "description": "An in-depth study of marine megafauna (mammals, birds, turtles) with an emphasis on methods and analyses of behavior and physiology for conservation. Lab and field exercises include investigations into the behavior–physiology nexus of diving, migration, thermoregulation, energy expenditure, and mating systems. Research techniques to be explored will include, for example, tracking and remote biotelemetry monitoring technologies, respirometry, genetics, and direct field study observation. Theoretical approaches, field techniques and statistical analyses will help prepare students for a career in fisheries or wildlife science.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FISH ECOLOGY",
  "course_number": "FW 573",
  "credits": "4",
  "description": "Explores how fish physiology and behavior interact with spatial and temporal heterogeneity in aquatic ecosystems. Considers emergent properties at population, community, and ecosystem levels and their implications for management and conservation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EARLY LIFE HISTORY OF FISHES",
  "course_number": "FW 574",
  "credits": "4",
  "description": "Overview of diversity of development patterns in fishes; emphasis on morphology, life history, and evolution. Offered alternate years. CROSSLISTED as FW 574/OC 574.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WILDLIFE BEHAVIOR",
  "course_number": "FW 575",
  "credits": "4",
  "description": "Emphasizes adaptive significance of egocentric and social behavior of wildlife species. Discusses implications of behavior in sound management practice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FISH PHYSIOLOGY",
  "course_number": "FW 576",
  "credits": "4",
  "description": "Physiological specializations and adaptations of major groups of fishes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WETLANDS AND RIPARIAN ECOLOGY",
  "course_number": "FW 579",
  "credits": "3",
  "description": "Ecology of riparian freshwater and estuarine wetlands of the Pacific Northwest. Effects of land use on ecosystem structure, function, biodiversity, and restoration will be explored.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WILDLIFE ECOLOGY",
  "course_number": "FW 581",
  "credits": "3",
  "description": "Interrelationships of wildlife, environment and humans. Evaluation of properties and habitats of wildlife populations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIES RECOVERY PLANNING AND RESTORATION",
  "course_number": "FW 583",
  "credits": "3",
  "description": "The importance of communication in science is stressed and a broad knowledge of endangered species-related information is provided. Students develop the ability to critically evaluate published information in scientific literature and to present and summarize it as part of the collaborative species recovery planning process with a varied audience of stakeholders.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FISH DISEASES IN CONSERVATION BIOLOGY AND AQUACULTURE",
  "course_number": "FW 591",
  "credits": "3",
  "description": "Introduction to diseases of fish including pathogens important to aquaculture and ornamental industries as well as to wild fish populations and conservation programs. CROSSLISTED as FW 491/MB 491 and FW 591/MB 591.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AQUACULTURE",
  "course_number": "FW 597",
  "credits": "3",
  "description": "Principles and practices for the aquaculture of fish, shellfish, and algae.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AQUACULTURE LABORATORY",
  "course_number": "FW 598",
  "credits": "3",
  "description": "Biology and culture requirements of fish, shellfish, and algae. Emphasis on laboratory culture techniques and practical experience in handling organisms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN FISHERIES AND WILDLIFE",
  "course_number": "FW 599",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "FW 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "FW 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "FW 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "FW 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "FW 607",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECOLOGICAL POLICY",
  "course_number": "FW 620",
  "credits": "3",
  "description": "Policy issues associated with ecosystem management, risk assessment, biological diversity, ecosystem health, sustainability, invasive species, bioregionalism, globalization and transnational factors, and rights, ethics, and morals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ANALYSIS OF ANIMAL POPULATIONS",
  "course_number": "FW 661",
  "credits": "5",
  "description": "Quantitative methods for estimating parameters (abundance, survival, population stability) of animal populations. Emphasis is on vertebrate animals and statistical methods of hypothesis testing, parameter estimation, and inference testing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN FISHERIES AND WILDLIFE",
  "course_number": "FW 699",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "FW 808",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]