[{
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN TOOLS AND TECHNIQUES",
  "course_number": "GD 110",
  "credits": "4",
  "description": "A foundation-level course covering software skills and production techniques aimed at building a confident understanding and demonstration of the tools of design, making, craft, and delivery.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN PRO APPLICATION",
  "course_number": "GD 126",
  "credits": "2",
  "description": "Required pre-graphic design course. Course will focus on the development of a final portfolio to be reviewed by the graphic design faculty at the end of the spring term.",
  "prerequisites": [["ART 101"], ["ART 115"], ["ART 121"], ["ART 131"]]
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN TECHNOLOGY AND PRODUCTION 1",
  "course_number": "GD 200",
  "credits": "4",
  "description": "The first of a two-course series covering software skills and production techniques aimed at building a confident understanding and demonstration of the tools of design, making, craft, and delivery.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN I",
  "course_number": "GD 210",
  "credits": "4",
  "description": "Explores the basic elements and principles of graphic design, using a variety of analog and digital techniques. Examines both visual and verbal vocabulary to describe and complete design projects with targeted intention. Introduces the practice, theory, methodologies and delivery systems of graphic design, including image making, typography, and composition, building upon technical skills gained in GD 110.",
  "prerequisites": [["GD 110"]]
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN TECHNOLOGY AND PRODUCTION 2",
  "course_number": "GD 220",
  "credits": "4",
  "description": "The second of a two-course series covering software skills and production techniques aimed at building a confident understanding and demonstration of the tools of design, making, craft, and delivery.",
  "prerequisites": [["GD 200"]]
}, {
  "corequisites": [],
  "course_name": "INTERACTIVE DESIGN 1",
  "course_number": "GD 224",
  "credits": "4",
  "description": "Introductory class to interactive design principles in the graphic design professional core.",
  "prerequisites": [["GD 126"], ["GD 226"], ["GD 228"]]
}, {
  "corequisites": [],
  "course_name": "TYPOGRAPHY 1",
  "course_number": "GD 226",
  "credits": "4",
  "description": "An introductory course in the discipline, function and tradition of typography as it relates to visual and verbal communication.",
  "prerequisites": [["GD 126"]]
}, {
  "corequisites": [],
  "course_name": "PROCESS: MAKING AND MEANING",
  "course_number": "GD 228",
  "credits": "4",
  "description": "Course utilizes creative problem solving techniques, communication theories, combined with media explorations to bring together message, meaning, medium, and form.",
  "prerequisites": [["GD 126"]]
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN PROFESSIONAL DEVELOPMENT",
  "course_number": "GD 230",
  "credits": "2",
  "description": "A required professional development course for graphic design sophomores aimed at preparing and empowering students to navigate professional opportunities ‘as students’.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN HISTORY",
  "course_number": "GD 269",
  "credits": "3",
  "description": "A historical and theoretical overview of the evolution and innovations in graphic design.",
  "prerequisites": [["GD 126"]]
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN ADVANCED TOOLS AND TECHNIQUES II",
  "course_number": "GD 300",
  "credits": "4",
  "description": "An intermediate technology course covering software skills and production techniques for interactive and motion delivery, aimed at building a confident understanding and demonstration of the industry standard tools of interactive and time-based design.",
  "prerequisites": [["GD 210"]]
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN 2: INTERMEDIATE GRAPHIC DESIGN",
  "course_number": "GD 310",
  "credits": "4",
  "description": "Explores the theory, methodologies and delivery systems of graphic design, including image making, typography, and composition, at the intermediate level of practice. Applies design thinking from brief to concept to delivery in practical, realistic scenarios of integrated media campaigns. Builds upon concepts learned in GD 210, and emphasizes integrated media projects, involving a variety of deliverables using a single visual language. Examines Print, digital, and emerging media in application of design systems, including the writing and interpretation of design briefs.",
  "prerequisites": [["GD 210"]]
}, {
  "corequisites": [],
  "course_name": "^CONTEMPORARY ISSUES IN DESIGN",
  "course_number": "GD 312",
  "credits": "3",
  "description": "For all graphic design students in the professional graphic design program. The course examines contemporary design issues through reading, research, writing, presentations and discussion.",
  "prerequisites": [["GD 126"]]
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN: COLLABORATIVE PROCESSES",
  "course_number": "GD 325",
  "credits": "4",
  "description": "Intermediate course in graphic design. Emphasis on collaborative projects exploring principles of group problem solving in typography.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TYPOGRAPHY 2",
  "course_number": "GD 326",
  "credits": "4",
  "description": "An intermediate course exploring the design of organizational typographic structures and systems.",
  "prerequisites": [["GD 126"]]
}, {
  "corequisites": [],
  "course_name": "TYPOGRAPHY 3",
  "course_number": "GD 327",
  "credits": "4",
  "description": "An intermediate course exploring the visual, expressive vocabulary of typography, using innovative experimentation.",
  "prerequisites": [["GD 126"]]
}, {
  "corequisites": [],
  "course_name": "INTERACTIVE 2",
  "course_number": "GD 328",
  "credits": "4",
  "description": "An introduction to the contemporary issues of interactive design: experience design, application design, e-publication design, and from a visual communications perspective.",
  "prerequisites": [["GD 126"]]
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN AND SUSTAINABILITY",
  "course_number": "GD 330",
  "credits": "4",
  "description": "An in-depth and hands-on exploration of the strategies, frameworks, and problem solving skills required for a sustainable and regenerative graphic design practice. Focus is on applying perspectives and systems thinking skills to design projects in the real world.",
  "prerequisites": [["GD 210"]]
}, {
  "corequisites": [],
  "course_name": "THE PHOTOGRAPHIC BOOK",
  "course_number": "GD 355",
  "credits": "4",
  "description": "Practical studio course focusing on the photographic book in all of its forms. Use appropriated imagery as well as original imagery to create a variety of zines as well as soft and hardcover photo-books. Structure, form, materials, and layout will be discussed as well as content, sequencing, and physical construction. CROSSLISTED as ART 355/GD 355.",
  "prerequisites": [["ART 263"]]
}, {
  "corequisites": [],
  "course_name": "PORTFOLIO REVIEW",
  "course_number": "GD 419",
  "credits": "3",
  "description": "A course to advise students during their final portfolio preparation. The objective is to complete the portfolio and hone presentation skills and techniques.",
  "prerequisites": [["GD 420"]]
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL PRACTICES",
  "course_number": "GD 420",
  "credits": "3",
  "description": "Professional ethics and standards, business practices and tactics, and pre-press production techniques and concerns for graphic designers.",
  "prerequisites": [["GD 126"]]
}, {
  "corequisites": [],
  "course_name": "INFORMATION AND PUBLICATION DESIGN",
  "course_number": "GD 421",
  "credits": "4",
  "description": "Theoretical and historical issues of organizing and visualizing statistics, numbers, and/or complex relationships. Emphasis on conceptualization, visual diagramming, and analysis of subtle visual relationships.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NEW MEDIA: INTERACTIVE",
  "course_number": "GD 422",
  "credits": "4",
  "description": "An advanced course designing digital experiences with emphasis on innovative navigation, architectural structures, theoretical, and historical issues of new media.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EXPERIMENTAL TYPOGRAPHY",
  "course_number": "GD 423",
  "credits": "4",
  "description": "An advanced course in experimental typography focusing on intent, meaning, and method.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BRAND IDENTITY SYSTEMS",
  "course_number": "GD 424",
  "credits": "4",
  "description": "Studio course that explores both the theory and the practice of brand identity systems, through the creation of a comprehensive visual branding project.",
  "prerequisites": [["GD 126"]]
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN CAPSTONE 1",
  "course_number": "GD 426",
  "credits": "3",
  "description": "The first in a two-course sequence of senior-level graphic design capstone courses. The focus is on applying more in-depth design research methods to graphic design senior capstone projects.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CAPSTONE 2",
  "course_number": "GD 427",
  "credits": "4",
  "description": "The second in a two-course sequence of senior-level graphic design capstone courses. The focus is on the design and development of the senior capstone project.",
  "prerequisites": [["GD 126"], ["GD 426"]]
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN STUDIO",
  "course_number": "GD 429",
  "credits": "4",
  "description": "Provides opportunity for students to work with clients on actual projects in a professional environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRAPHIC DESIGN PRACTICUM",
  "course_number": "GD 430",
  "credits": "2",
  "description": "Works from the skills and lessons learned in GD 230 to provide a system of evaluation and reflection in a structured class environment for students in a graphic design internship or project-based practicum.",
  "prerequisites": [["GD 230"]]
}, {
  "corequisites": [],
  "course_name": "SONIC ARTS",
  "course_number": "GD 439",
  "credits": "2",
  "description": "Create experimental sonic art projects using analog and digital technologies to make natural, artificial, and curated sound installations within an arts, design, or communication context. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the sound art project. Develop collaborative skills by working with people from other disciplines. Demonstrate competency through describing and applying sound art concepts including those that involve active listening practices. Explore the breadth and range of sonic-art from a historical and contemporary art practice. CROSSLISTED as ART 439/GD 439/MUS 439/NMC 439/TA 439 and ART 539/MUS 539.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "USER RESEARCH FOR GRAPHIC DESIGNERS",
  "course_number": "GD 440",
  "credits": "4",
  "description": "Examines the theory and methodology of user and audience research (qualitative and quantitative) as it relates to the graphic design discipline. Examines specific methodologies for the execution of design and user research through the conceptualization and implementation of design projects. Explores how theory can be put into practice through a student-initiated primary research project consisting of a design methodology and implementation.",
  "prerequisites": [["GD 210"]]
}, {
  "corequisites": [],
  "course_name": "VISUAL BRANDING SYSTEMS",
  "course_number": "GD 450",
  "credits": "4",
  "description": "Examines the methods, techniques, and tools for visual communication in the context of branding systems. Explores the basic principles of logo design, and implements them through the design of corporate identity systems from a defined creative brief. Examines the considerations for evaluation of logo and branding systems in use. Builds upon the principles introduced in GD 210 using integrated media and technology.",
  "prerequisites": [["GD 210"]]
}, {
  "corequisites": [],
  "course_name": "THE PHOTOGRAPHIC BOOK II",
  "course_number": "GD 455",
  "credits": "4",
  "description": "Practical studio course focusing on advanced practices and techniques in relation to the photographic book. Use appropriated imagery as well as original imagery to complete well-developed book projects. Structure, form, materials, and layout will be discussed as well as content, sequencing, and physical construction. Advanced elements such as application of blanking, slip cases, screen printing, and other construction techniques will be taught. CROSSLISTED as ART 455/GD 455.",
  "prerequisites": [["ART 355"]]
}, {
  "corequisites": [],
  "course_name": "OFF THE SCREEN - VIDEO INSTALLATION ART",
  "course_number": "GD 457",
  "credits": "2",
  "description": "Create experimental video-art installations within an arts, design, or communication context. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the video art project. Explore the breath and range of experimental approaches to video installations, multi-screen projections, immersive visual and sound environments, and projection-mapping from a historical and contemporary art perspective. Develop collaborative skills by working with people from other disciplines. CROSSLISTED as ART 457/GD 457/MUS 457/ NMC 457/TA 457 and ART 557/MUS 557.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SENSOR TECHNOLOGIES AND THE ARTS",
  "course_number": "GD 488",
  "credits": "2",
  "description": "Create interactive arts, design, or communication projects using sensor technologies in combination with sound, video, lights, video games, and generative digital art. Translate gestures of the physical world into interactive control using plug and play wireless sensors. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the sensor technologies project. Explore the breadth and range of interactive art from a historical and contemporary art practice. CROSSLISTED as ART 488/GD 488/MUS 488/NMC 488/TA 488 and ART 588/MUS 588.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "GD 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]