[{
  "corequisites": [],
  "course_name": "UNDERGRADUATE RESEARCH",
  "course_number": "GEOG 003",
  "credits": "0",
  "description": "Engage in research activities appropriate to the discipline; and through the research experience, acquire skills, techniques, and knowledge relevant to the field of study. In consultation with a faculty mentor, engage in research activity, and make and execute a plan for a project.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "GEOG 004",
  "credits": "0",
  "description": "Provides basic personal and professional skills that can be used within and outside of a work setting. Through practice, this experience guides students in building and maintaining positive professional relationships, networking/mentoring relationships, and enhances students’ understanding of the connection between theory and practice in their respective disciplines.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*CLIMATE JUSTICE",
  "course_number": "GEOG 100",
  "credits": "3",
  "description": "Unequal distribution of social, economic and political power that creates winners and losers from climate change. Case studies of climate-change-related environmental degradation, conflict, conservation, climate denial, renewable energy, and investment. Concepts and actions to promote climate justice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PHYSICAL GEOGRAPHY",
  "course_number": "GEOG 102",
  "credits": "4",
  "description": "Processes that shape the earth's surface. Weathering, mass movement, landforms, river systems, groundwater, biogeography, human effects on the landscape. Use of maps and imagery. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*THE HUMAN PLANET",
  "course_number": "GEOG 103",
  "credits": "3",
  "description": "Introduces the study of human activities, patterns, processes and institutions--globally and in specific places. Examines human behaviors and relationships, among cultures and with the environment. Demonstrates the importance of places, networks and patterns in a range of human and environmental processes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*THE HUMAN PLANET",
  "course_number": "GEOG 103H",
  "credits": "3",
  "description": "Introduces the study of human activities, patterns, processes and institutions--globally and in specific places. Examines human behaviors and relationships, among cultures and with the environment. Demonstrates the importance of places, networks and patterns in a range of human and environmental processes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PEOPLE",
  "course_number": "GEOG 105",
  "credits": "PLACES",
  "description": "Uses geographic concepts to study the places and people of the Global South. Topics covered include definitions of the “Global South;” challenges that face communities and environments in the Global South; how regions in the Global South influence global processes; and perspectives on identity, development, governance, sustainability, and well-being that emerge from various regions in the Global South.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*WESTERN TRADITION & EMERGING CHALLENGES IN THE GLOBAL NORTH",
  "course_number": "GEOG 106",
  "credits": "3",
  "description": "Explores the influence of Western Culture and Philosophy on processes of globalization. Examines western perspectives associated with developed countries on identity, development, politics, population, migration, sustainability, urbanization, and well-being. Considers challenges faced by communities and their environments in the Global North, and assesses different regions responding to these challenges.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "GEOG 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*FOUNDATIONS OF GEOSPATIAL SCIENCE AND GIS",
  "course_number": "GEOG 201",
  "credits": "4",
  "description": "Basic physical science principles underlying geospatial technologies such as GPS, mobile devices, and online mapping and navigation tools used in GIS, remote sensing, and geovisualization. Concepts and applications in government, business, and the environment. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*HUMAN-ENVIRONMENT GEOGRAPHY",
  "course_number": "GEOG 203",
  "credits": "3",
  "description": "How human societies manage resources, physical limits to sustainability, role of science in the use and management of resources, and how societal resource use adversely affects other societies, in human history and across spatial scales.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*HUMAN DIMENSIONS OF CLIMATE CHANGE",
  "course_number": "GEOG 240",
  "credits": "3",
  "description": "Examine theories regarding human institutions and behavior. Apply these theories to understand how human behavior and institutions can change to: (1) reduce vulnerability to climate change impacts through adaptation and (2) reduce greenhouse gas emissions through climate change mitigation and societal transformation at multiple scales.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*TRANSFORMING ENVIRONMENTAL CONFLICTS",
  "course_number": "GEOG 241",
  "credits": "3",
  "description": "Explores the geography of environmental conflicts; an examination of how social processes and institutions influence access and use of natural resources; and the social constructs from which difference, power, and discrimination emerge. Examines the experiences of women, minority, and under-represented communities to contemplate more integrated, equitable and sustainable approaches to resources management, in the United States and beyond. Personal skills in transforming conflicts, as well as the concepts of distributive, procedural, and restorative justice, will be explored. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*LAND USE PLANNING FOR SUSTAINABLE COMMUNITIES",
  "course_number": "GEOG 250",
  "credits": "3",
  "description": "Overview of the history and current practices of land use and community planning. Use basic geospatial tools to assess land use patterns and planning processes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GEOGRAPHIC FIELD RESEARCH",
  "course_number": "GEOG 295",
  "credits": "3",
  "description": "Introduction to field research in geography. Practice skills including observation, posing of questions, and collection and analysis of data. Focus on theory-based geographic study design, proposal development, and research critiques.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "GEOG 299",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SUSTAINABILITY FOR THE COMMON GOOD",
  "course_number": "GEOG 300",
  "credits": "3",
  "description": "Geography of human relationships to the earth's systems with an emphasis on individual impacts and collective efforts to achieve environmental sustainability.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SUSTAINABILITY FOR THE COMMON GOOD",
  "course_number": "GEOG 300H",
  "credits": "3",
  "description": "Geography of human relationships to the earth's systems with an emphasis on individual impacts and collective efforts to achieve environmental sustainability.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GEOGRAPHY OF AFRICA",
  "course_number": "GEOG 311",
  "credits": "3",
  "description": "An introduction to the physical, historical, cultural, political, and development geography of Africa south of the Sahara.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GEOGRAPHY OF LATIN AMERICA",
  "course_number": "GEOG 314",
  "credits": "3",
  "description": "Focuses on the diverse landscapes, peoples and cultural traditions of Latin America, a vast region extending from the United States-Mexican border to the southern tip of South America. (NC) (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^CLIMATOLOGY",
  "course_number": "GEOG 323",
  "credits": "4",
  "description": "Systematic analysis of global and regional climates. Physical principles of climate, climate classifications, and distribution and characteristics of climate regimes.",
  "prerequisites": ["GEOG 102", "GEO 202", "GEO 202H", "GEO 221", "GEO 221H", "ATS 201", "ATS 201H", "OC 201", "OC 201H"]
}, {
  "corequisites": [],
  "course_name": "^ECOLOGICAL BIOGEOGRAPHY",
  "course_number": "GEOG 324",
  "credits": "4",
  "description": "Spatial distributions and change over time of species, communities, and biomes. Effect of climate, tectonics, disturbance on evolution, extinction, and succession. Implications for conservation.",
  "prerequisites": ["GEOG 102", "BI 370", "BI 370H"]
}, {
  "corequisites": [],
  "course_name": "*GEOGRAPHY OF INTERNATIONAL DEVELOPMENT AND GLOBALIZATION",
  "course_number": "GEOG 330",
  "credits": "3",
  "description": "Introduction to the geography of global wealth and inequality with a focus on contemporary development, underdevelopment, and globalization problems in Asian, African, Caribbean, Latin American, and Pacific Island countries.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*POPULATION",
  "course_number": "GEOG 331",
  "credits": "CONSUMPTION",
  "description": "An examination of population patterns and trends, emphasizing historical growth and more recent demographic changes; using geographic tools to understand patterns of spatial distribution, to use and analyze data sources, and to gain experience interpreting and displaying data about population structure and dynamics; and developing the ability to evaluate the relationship between population, consumption, resources, and quality of life. Patterns of consumption, as individuals and societies will be examined and different future scenarios will be examined with reference to environmental, social and economic sustainability.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*CLIMATE AND HEALTH",
  "course_number": "GEOG 332",
  "credits": "3",
  "description": "Examines how social and environmental determinants of population health are impacted by anthropogenic climate change both spatially and temporally. Introduces theoretical approaches and methods from human-environment geography and public health to construct a cross-disciplinary framework for considering risk, vulnerability, and social justice in relationship to climate change and human health outcomes. Evaluates the influence of political and economic processes on health disparities and inequity. Central focus on the United States, while relying on international perspectives for contextual and comparative purposes. CROSSLISTED as GEOG 332/H 332.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ENVIRONMENTAL JUSTICE",
  "course_number": "GEOG 333",
  "credits": "3",
  "description": "Examines the uneven distribution of environmental resources, hazards, and risk among social groups and the emergence of the environmental justice movement in the United States.",
  "prerequisites": ["WR 121", "WR 121H", "WR 121Z", "WR 121HZ"]
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO WATER SCIENCE AND POLICY",
  "course_number": "GEOG 340",
  "credits": "3",
  "description": "Policy and science of the hydrologic cycle. Emphasis on interaction between water's natural time-space fluctuations and human uses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO WATER SCIENCE AND POLICY",
  "course_number": "GEOG 340H",
  "credits": "3",
  "description": "Policy and science of the hydrologic cycle. Emphasis on interaction between water's natural time-space fluctuations and human uses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GEOGRAPHY OF NATURAL HAZARDS",
  "course_number": "GEOG 350",
  "credits": "3",
  "description": "Introduction to the geography of risk, natural hazards, and disasters, focusing on concepts of vulnerability, adaptation and resilience of human society in the Pacific Northwest and globally.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GISCIENCE I: GEOGRAPHIC INFORMATION SYSTEMS AND THEORY",
  "course_number": "GEOG 360",
  "credits": "4",
  "description": "Fundamentals of spatial data, geographic information systems (GIS), and introductory spatial analysis, programming, and modeling.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUANTITATIVE GEOSPATIAL ANALYSIS AND MODELING",
  "course_number": "GEOG 361",
  "credits": "4",
  "description": "Develop skills in design and conduct of geospatial analyses using various spatial data structures, techniques and models. Acquire, clean, integrate, manipulate, visualize and analyze geospatial data. Explore various quantitative methods, practice investigating quantitative problems and develop competence in coding.",
  "prerequisites": ["GEOG 360", "MTH 112", "MTH 112Z", "MTH 241", "MTH 251", "MTH 251H", "ST 351", "ST 351H"]
}, {
  "corequisites": [],
  "course_name": "CARTOGRAPHY",
  "course_number": "GEOG 370",
  "credits": "4",
  "description": "Create, evaluate, and critique maps using cartographic theories and techniques for effective geovisual communication.",
  "prerequisites": ["GEOG 201", "GEOG 360", "FE 257", "CE 202"]
}, {
  "corequisites": [],
  "course_name": "WEB MAPPING",
  "course_number": "GEOG 371",
  "credits": "4",
  "description": "Concepts and techniques of web programming, digital storytelling, online project management, and web-based cartographic principles for developing, evaluating, and using web maps.",
  "prerequisites": ["GEOG 201"]
}, {
  "corequisites": [],
  "course_name": "REMOTE SENSING: PRINCIPLES AND APPLICATIONS",
  "course_number": "GEOG 380",
  "credits": "4",
  "description": "Focuses on fundamentals of satellite remote sensing and image analysis. Topics include physical principles of remote sensing from the ultraviolet to the microwave, sensors and sensor technology, and environmental applications of remote sensing through image analysis.",
  "prerequisites": ["GEOG 201"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "GEOG 399",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "GEOG 399H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "GEOG 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "GEOG 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "GEOG 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "GEOG 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "GEOG 408",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "GEOG 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SNOW HYDROLOGY",
  "course_number": "GEOG 423",
  "credits": "3",
  "description": "Fundamentals of snow hydrology. Physical principles of snow formation, snowpack accumulation, energy balance, snowcover-climate interactions, snow metamorphism, snowpack ablation, snowpack/snowmelt chemistry, remote sensing of snow, avalanches, field methods, snowmelt/runoff modeling techniques, and watershed processes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HYDROLOGY FOR WATER RESOURCES MANAGEMENT",
  "course_number": "GEOG 424",
  "credits": "3",
  "description": "Examines watershed hydrology in the context of water resources management. Examines conceptual, quantitative, and geographic analyses of the hydrologic cycle. Explores historical and enduring challenges of watershed management for water extremes, water use, and climate.",
  "prerequisites": ["ST 314", "ST 351"]
}, {
  "corequisites": [],
  "course_name": "RESILIENCE-BASED NATURAL RESOURCE MANAGEMENT",
  "course_number": "GEOG 430",
  "credits": "3",
  "description": "Causes and consequences of conflict over natural resource management at local to global scales; principles for managing social-ecological systems for resilience. Field trip(s) may be required; transportation fee charged.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CLIMATE CHANGE IMPACTS",
  "course_number": "GEOG 433",
  "credits": "ADAPTATION",
  "description": "Climate change poses challenges for human security and well-being, and for social and economic development. Evaluate how climate change impacts vary based on vulnerability, exposure, sensitivity, adaptive capacity, and risk.",
  "prerequisites": ["ATS 201", "ATS 201H", "GEOG 240", "GEOG 323"]
}, {
  "corequisites": [],
  "course_name": "CONFLICT",
  "course_number": "GEOG 440",
  "credits": "COOPERATION",
  "description": "Examine why nations rise and fall based on water availability and investigate why the United States is no exception. Explore how the US develops, protects, governs and manages its water resources and how it will cope with climate change and conflict. Discover resilience and sustainability through case studies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE WORLD'S WATER",
  "course_number": "GEOG 441",
  "credits": "3",
  "description": "Investigate why water is a critical resource that supports life, livelihoods, and the environment. Understand that where rivers crosses political boundaries, the sharing of water presents challenges and opportunities. Interpret how international basins are governed; Evaluate how dams and water development affect ecology and people; and apply water conflict management frameworks to emerging international water issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LAND USE IN THE AMERICAN WEST",
  "course_number": "GEOG 450",
  "credits": "3",
  "description": "Development of a conceptual framework for land use study; analysis of land as a resource, land use trends, land use principles, and management issues as related to planning, focusing on the American West, the fastest growing region in the nation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PLANNING PRINCIPLES AND PRACTICES FOR RESILIENT COMMUNITIES",
  "course_number": "GEOG 451",
  "credits": "4",
  "description": "Apply GIS skills and techniques to analyze and plan future land uses. Evaluate alternative models including suitability analysis to identify suitable land uses that incorporate community goals, comply with site constraints, and minimize use conflicts. Apply geodesign principles and practices to explore and analyze how land use planning decisions can impact the natural environment, local economies, and society. Assess regulatory and market-based implementation strategies. Evaluate how regional planning principles can promote smart growth and build resilient communities that minimize land use conflicts, mitigate hazard risk, and improve community livability.",
  "prerequisites": ["CE 202", "FE 257", "GEOG 360"]
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL ASSESSMENT",
  "course_number": "GEOG 452",
  "credits": "3",
  "description": "Environmental site assessment is a primary tool for environmental science professionals. Apply environmental science concepts to evaluate features of a specific natural area and conduct a land suitability analysis. Create a conceptual site design and management plan that complies with federal, state, and local regulations and environmental laws. CROSSLISTED as ENSC 452/GEOG 452.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EFFECTIVE COMMUNICATION OF ENVIRONMENTAL CHANGE SCIENCE",
  "course_number": "GEOG 453",
  "credits": "3",
  "description": "Explores the state of science on environmental change in the western United States and globally, including population and climate change, and the extent to which human behavior can affect drivers and outcomes of such changes. Develops skills in oral, visual, and written communication of science via both traditional and social media. Examines the best science available standard and addresses debates about advocacy in science.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GIS AND SPATIAL DATA SCIENCE",
  "course_number": "GEOG 460",
  "credits": "4",
  "description": "Focuses on practical applications of technologies and problem solving skills to spatial analysis within a geographic information system (GIS). Develops a foundation in spatial thinking and guides students through the process of designing and conducting spatial analyses applied to geographic problems. Builds skills using various forms of spatial data, models and techniques including spatial statistics and spatial data science. Emphasizes application and synthesis in a spatial analysis project including written and oral presentation.",
  "prerequisites": ["GEOG 360", "FE 257", "CE 202", "MTH 112", "MTH 112Z", "MTH 251", "MTH 251H", "ST 314", "ST 351", "ST 351H"]
}, {
  "corequisites": [],
  "course_name": "PROGRAMMING FOR GEOSPATIAL ANALYSIS",
  "course_number": "GEOG 462",
  "credits": "4",
  "description": "Explore the extension of geographic information systems (GIS) through programming. Examine design and writing of computer programs to automate geospatial analysis. Apply basic principles of programming languages to write, apply, and interpret results of scripts. Develop custom functions and analyze coding information to learn new skills. Emphasizes building foundations and pragmatic approaches to designing and constructing programs and scripts for geospatial analysis.",
  "prerequisites": ["GEOG 361", "GEOG 460"]
}, {
  "corequisites": [],
  "course_name": "ANALYTICAL WORKFLOWS FOR EARTH SYSTEMS SCIENCE",
  "course_number": "GEOG 463",
  "credits": "4",
  "description": "Explores data science methods used to gather, validate, organize, analyze, and summarize large amounts of environmental and ecological information. Focuses on developing analytical workflows that are efficient, reproducible, and modular using tools such as the R coding language, RStudio, GitHub, and JupyterLab. Examines case studies including climate change, biodiversity assessments, epidemic modeling, marine spatial planning, and natural resource management.",
  "prerequisites": ["ST 314", "ST 351", "ST 351H"]
}, {
  "corequisites": [],
  "course_name": "GEOSPATIAL PERSPECTIVES ON INTELLIGENCE",
  "course_number": "GEOG 464",
  "credits": "SECURITY",
  "description": "Applications and implications of geospatial science (GIS, remote sensing, and spatial analysis) in intelligence, human, environmental, and ethical domains. Concepts and practices of ethics in geospatial science, including data access, management, visualization, and decision-making.",
  "prerequisites": ["GEOG 360"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED CARTOGRAPHY",
  "course_number": "GEOG 471",
  "credits": "4",
  "description": "Explores advanced concepts, techniques, and theories of Cartography. Examines current research in color theory, typographic design, and other aspects of thematic, reference, and analytic maps. Focuses on the design, compilation, construction, and analysis of maps in multiple formats and created for diverse audiences. Constructs a professional level cartographic portfolio of work using GIS, publishing, and image editing software packages.",
  "prerequisites": ["GEOG 360"]
}, {
  "corequisites": [],
  "course_name": "INTERACTIVE CARTOGRAPHY",
  "course_number": "GEOG 472",
  "credits": "4",
  "description": "Examines concepts, theories, and techniques of web programming, digital storytelling, online project management, and web-based cartographic principles. Explores the history, present, and potential future of online mapping libraries, technologies, and data. Builds foundational concepts for compiling, constructing, and analyzing interactive maps. Creates online, interactive web visualizations using open-source tools.",
  "prerequisites": ["GEOG 361", "GEOG 370"]
}, {
  "corequisites": [],
  "course_name": "SATELLITE IMAGE ANALYSIS",
  "course_number": "GEOG 481",
  "credits": "4",
  "description": "Intermediate concepts and techniques for satellite image processing including image enhancement, clustering, classification, machine learning, change detection, and time series analysis. Hands-on experience with open-source, large volume data and geospatial programming within Google Earth engine.",
  "prerequisites": ["GEOG 380", "ST 314", "ST 351", "ST 351H"]
}, {
  "corequisites": [],
  "course_name": "FIELD GEOGRAPHY SYNTHESIS",
  "course_number": "GEOG 495",
  "credits": "3",
  "description": "Explore how geographers use field work to investigate landscapes such as mountains, forests, coasts, tundra and desert to understand how they were formed and explain how they have changed over time. Learn techniques for finding out how landscape processes impact humans and, in turn, how humans impact the environment around them. Apply geographic theories and concepts to synthesize, analyze and interpret the relationship between human communities and the environment through the planning and execution of field work.",
  "prerequisites": ["GEOG 295"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "GEOG 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "GEOG 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "GEOG 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "GEOG 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "GEOG 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "GEOG 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "GEOG 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "GEOG 510",
  "credits": "1-15",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY AND PHILOSOPHY OF GEOGRAPHY",
  "course_number": "GEOG 511",
  "credits": "3",
  "description": "The historical development of research traditions in the discipline of geography. This includes an examination of changes in conceptual structures and current trends.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL-ECOLOGICAL SYSTEMS",
  "course_number": "GEOG 512",
  "credits": "3",
  "description": "Exploration of critical debates surrounding theories associated with social-ecological systems, resilience, vulnerability, adaptation, social learning, transformation, adaptive governance.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUANTITATIVE METHODS FOR STUDYING SOCIAL-ECOLOGICAL SYSTEMS",
  "course_number": "GEOG 513",
  "credits": "3",
  "description": "Explores quantitative tools used for studying social-ecological systems. Analyzes the concepts of resilience and fragility in social-ecological systems. Introduces methods from theoretical ecology, computer science, applied math and physics, placing them in the context of sustainability and resilience theory. Introduces network theory, dynamical systems theory and economics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "POLITICAL ECOLOGY",
  "course_number": "GEOG 514",
  "credits": "3",
  "description": "Examines key theories and ideas emerging from political ecology, an interdisciplinary field that links human and physical geography by focusing on the role of multiscalar power relations in environmental change and resource access. Analyzes how political ecology frameworks can be applied in students’ own empirical research. Evaluates the field's potentials and limitations for scholars of human-environment geography.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROBLEM FORMULATION IN GEOGRAPHY AND GEOSPATIAL SCIENCE",
  "course_number": "GEOG 515",
  "credits": "3",
  "description": "Formulates research questions, research designs, expected outcomes, and significance relevant to current research areas in geography and geospatial science.",
  "prerequisites": ["GEOG 511"]
}, {
  "corequisites": [],
  "course_name": "PARTICIPATORY RESEARCH DESIGN AND METHODS",
  "course_number": "GEOG 516",
  "credits": "3",
  "description": "Explores participatory research design and methods from educating participants to engaging them as research partners. Builds practical skills for public engagement applied to quantitative, qualitative, and mixed methods-based research, and emphasizes the potential for the empowerment of marginalized voices and transformative change. Prepares students to apply participatory components and approaches to their research topic and method of interest. Encourages students to critically reflect on power dynamics and ethical considerations in participatory research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SNOW HYDROLOGY",
  "course_number": "GEOG 523",
  "credits": "3",
  "description": "Fundamentals of snow hydrology. Physical principles of snow formation, snowpack accumulation, energy balance, snowcover-climate interactions, snow metamorphism, snowpack ablation, snowpack/snowmelt chemistry, remote sensing of snow, avalances, field methods, snowmelt/runoff modeling techniques, and watershed processes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HYDROLOGY FOR WATER RESOURCES MANAGEMENT",
  "course_number": "GEOG 524",
  "credits": "3",
  "description": "Examines watershed hydrology in the context of water resources management. Examines conceptual, quantitative, and geographic analyses of the hydrologic cycle. Explores historical and enduring challenges of watershed management for water extremes, water use, and climate.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESILIENCE-BASED NATURAL RESOURCE MANAGEMENT",
  "course_number": "GEOG 530",
  "credits": "3",
  "description": "Causes and consequences of conflict over natural resource management at local to global scales; principles for managing social-ecological systems for resilience. Field trip(s) may be required; transportation fee charged.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CLIMATE CHANGE IMPACTS",
  "course_number": "GEOG 533",
  "credits": "ADAPTATION",
  "description": "Climate change poses challenges for human security and well-being, and for social and economic development. Evaluate how climate change impacts vary based on vulnerability, exposure, sensitivity, adaptive capacity, and risk.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CONFLICT",
  "course_number": "GEOG 540",
  "credits": "COOPERATION",
  "description": "Examine why nations rise and fall based on water availability and investigate why the United States is no exception. Explore how the US develops, protects, governs and manages its water resources and how it will cope with climate change and conflict. Discover resilience and sustainability through case studies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE WORLD'S WATER",
  "course_number": "GEOG 541",
  "credits": "3",
  "description": "Investigate why water is a critical resource that supports life, livelihoods, and the environment. Understand that where rivers crosses political boundaries, the sharing of water presents challenges and opportunities. Interpret how international basins are governed; Evaluate how dams and water development affect ecology and people; and apply water conflict management frameworks to emerging international water issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LAND USE IN THE AMERICAN WEST",
  "course_number": "GEOG 550",
  "credits": "3",
  "description": "Development of a conceptual framework for land use study; analysis of land as a resource, land use trends, land use principles, and management issues as related to planning, focusing on the American West, the fastest growing region in the nation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PLANNING PRINCIPLES AND PRACTICES FOR RESILIENT COMMUNITIES",
  "course_number": "GEOG 551",
  "credits": "4",
  "description": "Apply GIS skills and techniques to analyze and plan future land uses. Evaluate alternative models including suitability analysis to identify suitable land uses that incorporate community goals, comply with site constraints, and minimize use conflicts. Apply geodesign principles and practices to explore and analyze how land use planning decisions can impact the natural environment, local economies, and society. Assess regulatory and market-based implementation strategies. Evaluate how regional planning principles can promote smart growth and build resilient communities that minimize land use conflicts, mitigate hazard risk, and improve community livability.",
  "prerequisites": ["GEOG 560"]
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL ASSESSMENT",
  "course_number": "GEOG 552",
  "credits": "3",
  "description": "Environmental site assessment is a primary tool for environmental science professionals. Apply environmental science concepts to evaluate features of a specific natural area and conduct a land suitability analysis. Create a conceptual site design and management plan that complies with federal, state, and local regulations and environmental laws.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EFFECTIVE COMMUNICATION OF ENVIRONMENTAL CHANGE SCIENCE",
  "course_number": "GEOG 553",
  "credits": "3",
  "description": "Explores the state of science on environmental change in the western United States and globally, including population and climate change, and the extent to which human behavior can affect drivers and outcomes of such changes. Develops skills in oral, visual, and written communication of science via both traditional and social media. Examines the best science available standard and addresses debates about advocacy in science.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GISCIENCE I: INTRODUCTION TO GEOGRAPHIC INFORMATION SCIENCE",
  "course_number": "GEOG 560",
  "credits": "4",
  "description": "Introduction to modern spatial data processing, development, and functions of geographic information systems (GIS); theory, concepts and applications of geographic information science (GIScience).",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GISCIENCE II: ANALYSIS AND APPLICATIONS",
  "course_number": "GEOG 561",
  "credits": "4",
  "description": "Applications-based course. Development and conduct of geospatial analyses using various spatial data structures, techniques and models. Students acquire, clean, integrate, manipulate, visualize and analyze geospatial data through laboratory work.",
  "prerequisites": ["GEOG 560"]
}, {
  "corequisites": [],
  "course_name": "PROGRAMMING FOR GEOSPATIAL ANALYSIS",
  "course_number": "GEOG 562",
  "credits": "4",
  "description": "Explore the extension of geographic information systems (GIS) through programming. Examine design and writing of computer programs to automate geospatial analysis. Apply basic principles of programming languages to write, apply, and interpret results of scripts. Develop custom functions and analyze coding information to learn new skills. Emphasizes building foundations and pragmatic approaches to designing and constructing programs and scripts for geospatial analysis.",
  "prerequisites": ["GEOG 561"]
}, {
  "corequisites": [],
  "course_name": "ANALYTICAL WORKFLOWS FOR EARTH SYSTEMS SCIENCE",
  "course_number": "GEOG 563",
  "credits": "4",
  "description": "Explores data science methods used to gather, validate, organize, analyze, and summarize large amounts of environmental and ecological information. Focuses on developing analytical workflows that are efficient, reproducible, and modular using tools such as the R coding language, RStudio, GitHub, and JupyterLab. Examines case studies including climate change, biodiversity assessments, epidemic modeling, marine spatial planning, and natural resource management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GEOSPATIAL PERSPECTIVES ON INTELLIGENCE",
  "course_number": "GEOG 564",
  "credits": "SECURITY",
  "description": "Applications and implications of geospatial science (GIS, remote sensing, and spatial analysis) in intelligence, human, environmental, and ethical domains. Concepts and practices of ethics in geospatial science, including data access, management, visualization, and decision-making.",
  "prerequisites": ["GEOG 560"]
}, {
  "corequisites": [],
  "course_name": "SPATIO-TEMPORAL VARIATION IN ECOLOGY AND EARTH SCIENCE",
  "course_number": "GEOG 565",
  "credits": "4",
  "description": "Objectives and techniques of spatial and temporal analysis. Point patterns, geostatistics, spectral analysis, wavelet analysis, interpolation, and mapping.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED SPATIAL STATISTICS AND GISCIENCE",
  "course_number": "GEOG 566",
  "credits": "4",
  "description": "Provides advanced graduate students from a variety of disciplines in earth science and ecology the opportunity to structure and conduct spatio-temporal analyses using available software tools and their own datasets for their graduate research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED CARTOGRAPHY",
  "course_number": "GEOG 571",
  "credits": "4",
  "description": "Explores advanced concepts, techniques, and theories of Cartography. Examines current research in color theory, typographic design, and other aspects of thematic, reference, and analytic maps. Focuses on the design, compilation, construction, and analysis of maps in multiple formats and created for diverse audiences. Constructs a professional level cartographic portfolio of work using GIS, publishing, and image editing software packages.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERACTIVE CARTOGRAPHY",
  "course_number": "GEOG 572",
  "credits": "4",
  "description": "Examines concepts, theories, and techniques of web programming, digital storytelling, online project management, and web-based cartographic principles. Explores the history, present, and potential future of online mapping libraries, technologies, and data. Builds foundational concepts for compiling, constructing, and analyzing interactive maps. Creates online, interactive web visualizations using open-source tools.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "REMOTE SENSING I: PRINCIPLES AND APPLICATIONS",
  "course_number": "GEOG 580",
  "credits": "4",
  "description": "Fundamentals of satellite remote sensing and image analysis. Topics include physical principles of remote sensing from the ultraviolet to the microwave, sensors and sensor technology, and environmental applications of remote sensing through image analysis.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SATELLITE IMAGE ANALYSIS",
  "course_number": "GEOG 581",
  "credits": "4",
  "description": "Intermediate concepts and techniques for satellite image processing including image enhancement, clustering, classification, machine learning, change detection, and time series analysis. Hands-on experience with open-source, large volume data and geospatial programming within Google Earth engine.",
  "prerequisites": ["GEOG 580"]
}, {
  "corequisites": [],
  "course_name": "FIELD GEOGRAPHY OF OREGON",
  "course_number": "GEOG 595",
  "credits": "3",
  "description": "Investigate how geographers use field work to study landscapes such as mountains, forests, coasts, tundra and desert to understand how they were formed and explain how they have changed over time Apply techniques for finding out how landscape processes impact humans and, in turn, how humans impact the environment around them. Apply geographic theories and concepts to synthesize, analyze and interpret the relationship between human communities and the environment through the planning and execution of field work in Oregon.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FIELD RESEARCH IN GEOMORPHOLOGY AND LANDSCAPE ECOLOGY",
  "course_number": "GEOG 596",
  "credits": "3",
  "description": "Natural history interpretation of disturbance and recovery processes and management implications in forest-stream landscapes of western Oregon. Course consists of field experience and several seminars. Transportation and lodging fee charged.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "GEOG 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "GEOG 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "GEOG 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "GEOG 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "GEOG 607",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "GEOG 608",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MANAGEMENT OF SPONSORED RESEARCH",
  "course_number": "GEOG 616",
  "credits": "1",
  "description": "Prepare for fundamental pre-award and post-award administration of research projects as expected of principal investigators. Explore the process of matching proposal solicitations and proposed research. Examine similarities and difference among grants, cooperative agreements, and contracts; budget development and tracking, including facilities and administrative costs; major topics in research integrity; and hiring. Discuss navigation of conflicts among project personnel. Recognize major differences between research administration within and outside of academia.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "GEOG 699",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]