[{
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "GPH 501",
  "credits": "1-16",
  "description": "Original research work that will not be part of the data used in a thesis.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "GPH 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "GPH 505",
  "credits": "1-16",
  "description": "Independent reading and library research on specialized topics in geophysics, guided by discussions with supervising faculty. A written report may be required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "GPH 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "GPH 601",
  "credits": "1-16",
  "description": "Original research work that will not be part of the data used in a thesis.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "GPH 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "GPH 605",
  "credits": "1-16",
  "description": "Independent reading and library research on specialized topics in geophysics guided by discussions with supervising faculty. A written report may be required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "GPH 607",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELEMENTS OF SEISMOLOGY",
  "course_number": "GPH 630",
  "credits": "4",
  "description": "Survey of basic concepts in global seismology: world seismicity; elastic structure of the earth; seismic wave paths in the earth; locating earthquakes; earthquake focal mechanisms, magnitudes, stress drop, energy; stress and strain, elasticity, wave equation, plane waves in homogeneous and layered media, surface waves, free oscillations; ray theory; seismometry; earthquake prediction. Laboratory exercises include interpretation and analysis of seismograms from global seismographic networks.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELECTROMAGNETIC METHODS IN GEOPHYSICS",
  "course_number": "GPH 641",
  "credits": "3",
  "description": "Survey of electromagnetic (EM) methods in geophysics. Review of electromagnetic theory, Maxwell's equations in the quasi-static limit, the diffusion of EM fields in a layered conductor, qualitative discussion of EM fields in 2- and 3-D conductors. EM techniques, including DC resistivity, magnetotellurics, controlled source EM, induced polarization, and long-period magnetometer array methods. Applications to exploration, to basic research on crustal structure and to studies of upper-mantel conductivity.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EARTH MAGNETISM",
  "course_number": "GPH 642",
  "credits": "3",
  "description": "Geomagnetism and magnetic potential: general morphology and secular change; internal and external sources; principles of paleomagnetism, including field and laboratory procedures; origin of remnant magnetism in rocks and the controlling physical and chemical processes; the origin of the Earth's magnetic field.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GEOPHYSICAL INVERSE THEORY",
  "course_number": "GPH 650",
  "credits": "4",
  "description": "Survey of the theory and applications of inverse methods currently used in the geophysical sciences for the interpretation of inaccurate and inadequate data. Backus-Gilbert inverse theory, resolution, regularization methods (such as damped least squares) for linear and non-linear problems, stochastic inversion, and extremal models. Applications to seismic, gravity, magnetic and electromagnetic data.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GEODYNAMICS I",
  "course_number": "GPH 651",
  "credits": "3",
  "description": "Application of the techniques of continuum mechanics to geological problems. Thermal and subsidence history of the lithosphere; stress and strain in the earth; elasticity and flexure of the lithosphere; gravitational compensation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GEOPHYSICAL FIELD TECHNIQUES",
  "course_number": "GPH 665",
  "credits": "3",
  "description": "Instrumentation, field methods and interpretation of gravimetric, magnetic, electrical and seismic prospecting techniques. Students will be required to collect, reduce, analyze, and interpret data.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN GEOPHYSICS",
  "course_number": "GPH 689",
  "credits": "1-4",
  "description": "Special topics of current interest in geophysics, not covered in detail in other courses. May be repeated on different topics for credit.",
  "prerequisites": []
}]