[{
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "GRAD 402",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRADUATE SCHOOL PREPARATION",
  "course_number": "GRAD 420",
  "credits": "1",
  "description": "Applying for graduate or professional school can be a daunting task. How and where to apply, how to choose an advisor, what to look for in a school, and how to obtain funding are hurdles to overcome during the application process. Supplemental materials will be provided as part of the course materials.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "GRAD 499",
  "credits": "4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "GRAD 502",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "GRAD 505",
  "credits": "1-16",
  "description": "Reading and discussions on special topics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "GRAD 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "GRAD 509",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CURRENT ISSUES IN HIGHER EDUCATION",
  "course_number": "GRAD 512",
  "credits": "3",
  "description": "Explores current, work-relevant issues in higher education nationally. Development of plan to stay current with important issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROFESSIONAL DEVELOPMENT IN COLLEGE AND UNIVERSITY TEACHING",
  "course_number": "GRAD 513",
  "credits": "1-3",
  "description": "Self-directed learning experience, providing structure and context for professional development opportunities in teaching, such as workshops, seminars, webinars, symposia, and other relevant programming. Designed to encourage and reward continuing investment in the development of knowledge and skill sets as educators. Consists of participating in self-selected teaching-related programming (in-person or online), as well as reading, writing, and reflecting on your chosen experiences.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO GRADUATE WRITING",
  "course_number": "GRAD 514",
  "credits": "3",
  "description": "Covers the expectations for writing at the graduate level. Examines features of successful, graduate-level academic writing to produce documents for program, courses, advisors, and colleagues. Explores topics related to information literacy, proposal and grant writing, and general graduate writing strategies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CREATING HAPPINESS: PERSONAL AND PROFESSIONAL APPLICATIONS OF WELL BEING",
  "course_number": "GRAD 515",
  "credits": "1",
  "description": "Examines theories and practices of well-being and explores the application of these concepts to their academic course of study, career planning, and as a general blueprint for ongoing health and healing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRADUATE TEACHING SEMINAR",
  "course_number": "GRAD 516",
  "credits": "1",
  "description": "Provides pedagogy and teaching support for graduate students across OSU’s academic disciplines who teach site-based, hybrid, and online courses. Topics will emerge based on graduate students’ needs and the classes they are instructing. Focuses on problem solving and evidence-based practices related to graduate students’ teaching duties.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRADUATE CAREER BUILDING",
  "course_number": "GRAD 517",
  "credits": "3",
  "description": "Assesses graduate students’ professional skills and explores a range of diverse career pathway options. Provides practical guidance on how to leverage academic, research, and co-curricular experiences to enhance employability and will support students in developing personalized career plans tailored to their individual goals and aspirations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESPONSIBLE CONDUCT OF RESEARCH",
  "course_number": "GRAD 520",
  "credits": "2",
  "description": "Covers 10 topics in responsible conduct of research: ethical decision making; human subjects; animal welfare; data acquisition, sharing and ownership; research misconduct; conflicts of interest; authorship; peer review; mentor/trainee responsibilities; and collaborative science. Weekly writing assignments. Useful to all students who conduct scholarly activity. Provides transcript-visible training in research ethics relevant to the Graduate Learning Outcome established by Faculty Senate to be able to conduct scholarly and professional activities in an ethical manner.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH DATA MANAGEMENT",
  "course_number": "GRAD 521",
  "credits": "2",
  "description": "Careful examination of all aspects of research data management best practices. Designed to prepare students to exceed funder mandates for performance in data planning, documentation, preservation and sharing in an increasingly complex digital research environment. Open to students of all disciplines.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PREPARING AN IRB SUBMISSION",
  "course_number": "GRAD 522",
  "credits": "1",
  "description": "Workshop-style course resulting in applications that are ready for IRB review. Ethical issues in research will be discussed. Students will draft all submission materials outside of class and participate in the critique of each other's protocols and consent forms. IRB approval will not be granted as part of this class.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE INCLUSIVE CLASSROOM: DIFFERENCE",
  "course_number": "GRAD 542",
  "credits": "POWER",
  "description": "An examination of multidisciplinary scholarship on difference, power, and discrimination; critical pedagogies; and curriculum transformation. Discussions of theory and research are coupled with practical hands-on opportunities for students to develop and hone their teaching and course development skills. CROSSLISTED as GRAD 542/WGSS 542.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DIALOGUE FACILITATION IN PROFESSIONAL CONTEXTS: SKILLS AND PRACTICE FOR GRADUATE STUDENTS",
  "course_number": "GRAD 543",
  "credits": "3",
  "description": "Offers a professional learning experience for graduate students looking to grow as a dialogue facilitator and integrate dialogue practices in their current or future professional responsibilities related to teaching, research, leadership, and/or service.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO ONLINE COURSE DEVELOPMENT AND FACILITATION",
  "course_number": "GRAD 550",
  "credits": "3",
  "description": "Prepares students to develop and teach online and hybrid courses that foster community, promote engagement, and support learner success. Explores practical aspects of course investigates course design principles; develops activities and assessments that engage adult learners; active learning; and discusses how online instruction, in addition to offering flexibility and convenience, also offers distinct pedagogical benefits.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THEORIES OF TEACHING AND LEARNING IN HIGHER EDUCATION",
  "course_number": "GRAD 560",
  "credits": "3",
  "description": "Examination and analysis of theories and research related to teaching and learning in higher education contexts with emphasis on theoretical applications for GTAs, instructors, and other who teach in the college and university classroom.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COURSE DESIGN AND METHODS FOR COLLEGE & UNIVERSITY TEACHING",
  "course_number": "GRAD 561",
  "credits": "3",
  "description": "Exploration of research and research-based practices related to teaching and learning in higher education contexts with emphasis on course design, facilitation, and other instructional techniques for GTAs, instructors, and others who teach in the college and university classroom.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "GRAD 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "GRAD 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "GRAD 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CAPSTONE SEMINAR",
  "course_number": "GRAD 607",
  "credits": "3",
  "description": "Provides a culminating experience required for all graduate students pursuing the Graduate Certificate in College and University Teaching and for other graduate students seeking a structured opportunity to develop their teaching portfolio.",
  "prerequisites": ["GRAD 560", "GRAD 561"]
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "GRAD 609",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "GRAD 610",
  "credits": "3",
  "description": "Provides a framework for the in-depth internship experiences required of all graduate students pursuing the Graduate Certificate in College and University Teaching and for other graduate students seeking a structured opportunity to reflect on and improve their teaching.",
  "prerequisites": ["GRAD 560", "GRAD 561"]
}]