[{
  "corequisites": [],
  "course_name": "LEADERSHIP",
  "course_number": "H 002",
  "credits": "0",
  "description": "Provides students with basic personal and interpersonal leadership skills that can be used within and outside of a work setting. Through practice, the leadership experience help students explore motivation, decision-making, time management, power, team building, conflict, ethics, dealing with change, communication skills, and diversity issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO PUBLIC HEALTH",
  "course_number": "H 100",
  "credits": "4",
  "description": "A basic overview of public health. Uses a mix of lectures, guest speakers, classroom activities and homework to help students understand the role of public health in eliminating health disparities, understanding epidemics, and setting policy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO PUBLIC HEALTH",
  "course_number": "H 100H",
  "credits": "4",
  "description": "A basic overview of public health. Uses a mix of lectures, guest speakers, classroom activities and homework to help students understand the role of public health in eliminating health disparities, understanding epidemics, and setting policy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "IMPERFECT & THRIVING",
  "course_number": "H 111",
  "credits": "2",
  "description": "Explores information and opportunities consistent with a positive transition to OSU in general, and the College of Health in particular. Emphasizes principles of health and wellness, enhancing a sense of belonging and engagement, resources that contribute to student success, as well as personal growth and development. CROSSLISTED as H 111/HDFS 111/KIN 111/NUTR 111.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "H 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "H 201",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "H 206",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO THE HEALTH CARE SYSTEM",
  "course_number": "H 210",
  "credits": "3",
  "description": "Provides tools to understand and critically assess the health care delivery system, its components, and the challenges created by its structure. The health care system will be considered from the perspective of several main players [e.g., patients, hospitals, doctors, health plans]. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HEALTH DATA ANALYSIS",
  "course_number": "H 220",
  "credits": "3",
  "description": "Introduction to the application of biostatistics and probability to the health sciences. Topics include quantitative analysis and inference, statistical methods in the biosciences, and quantitative study to evaluate and control health problems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "+*SOCIAL DETERMINANTS OF HEALTH",
  "course_number": "H 225",
  "credits": "4",
  "description": "Explores how social conditions, factors, institutions, and systems where we are born, grow, work, live, and age influence health. Explores historical and contemporary examples of health determinants to examine why different risks of poor health and premature mortality persist. Applies selected models to demonstrate the complex interplay between individual, interpersonal, organizational, community, and societal factors.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RACISM AND HEALTH EQUITY",
  "course_number": "H 230",
  "credits": "3",
  "description": "Explores how racism and systemic oppression drive health disparities and are engrained in public health and human sciences institutions. Analyzes racism in theory and practice drawing on examples related to public health and human health. Explores how BIPOC scholars have advanced the field.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HEALTH CARE MANAGEMENT",
  "course_number": "H 250",
  "credits": "3",
  "description": "Participants will learn key principles, practices and personalities of health care management. The content is broadly applicable to health care enterprises of every kind: public health organizations, physician practices and clinics, hospitals and health systems, agencies and service organizations, for-profit firms, not-for-profit enterprises, etc.",
  "prerequisites": [["H 210"]]
}, {
  "corequisites": [],
  "course_name": "HEALTH FIELD EXPERIENCES",
  "course_number": "H 310",
  "credits": "3-6",
  "description": "Introductory field experience in a health or health-related worksite.",
  "prerequisites": [["H 210"]]
}, {
  "corequisites": [],
  "course_name": "*HIV/AIDS AND STIS IN MODERN SOCIETY",
  "course_number": "H 312",
  "credits": "3",
  "description": "Fundamental principles relating to etiology, nature, prevention, and control of AIDS and other sexually transmitted diseases in contemporary society; emphasis on social, psychological, legal, economic, and ethical issues surrounding these diseases.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HEALTH POLICY",
  "course_number": "H 319",
  "credits": "3",
  "description": "Describe the policy development process, including problem conceptualization, agenda setting, role of interest groups and public opinion, analysis of alternatives and selection of policy alternative.",
  "prerequisites": [["H 210"]]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HUMAN DISEASE",
  "course_number": "H 320",
  "credits": "3",
  "description": "Fundamental principles relating to etiology, nature, prevention, and control of communicable and noncommunicable diseases in human populations. Special emphasis on disease prevention and health promotion in the high risk diseases of modern, industrialized society.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*CLIMATE AND HEALTH",
  "course_number": "H 332",
  "credits": "3",
  "description": "Examines how social and environmental determinants of population health are impacted by anthropogenic climate change both spatially and temporally. Introduces theoretical approaches and methods from human-environment geography and public health to construct a cross-disciplinary framework for considering risk, vulnerability, and social justice in relationship to climate change and human health outcomes. Evaluates the influence of political and economic processes on health disparities and inequity. Central focus on the United States, while relying on international perspectives for contextual and comparative purposes. CROSSLISTED as GEOG 332/H 332.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GLOBAL PUBLIC HEALTH",
  "course_number": "H 333",
  "credits": "3",
  "description": "Introduction to the field of global health, its history, methods, and key principle; understanding global health inequities through case studies; overview of major global health prevention programs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GLOBAL PUBLIC HEALTH",
  "course_number": "H 333H",
  "credits": "3",
  "description": "Introduction to the field of global health, its history, methods, and key principle; understanding global health inequities through case studies; overview of major global health prevention programs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*FOUNDATIONS OF ENVIRONMENTAL HEALTH",
  "course_number": "H 344",
  "credits": "3",
  "description": "Identifies environmentally-linked disease, population growth, and health concerns associated with toxic substances, food quality, air pollution, water pollution, noise, solid and hazardous waste, and pesticide use. Explores scientific topics related to environmental health in a global context that impact our collective environment. Compares and contrasts select environmental problems in the US to those that occur in the global community.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRUGS",
  "course_number": "H 364",
  "credits": "SOCIETY",
  "description": "Explores historical trends, prevalence of use and policies to control legal (e.g. alcohol, tobacco, prescription) and illegal drugs (e.g. cocaine, heroin, psychedelics). Examines health effects, theories of addiction, and the role of social determinants of health and racial inequalities on differential drug penalties and access to treatment services. Reviews public health evidence-based programming and policies for the prevention and treatment of drug use.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRUGS",
  "course_number": "H 364H",
  "credits": "SOCIETY",
  "description": "Explores historical trends, prevalence of use and policies to control legal (e.g. alcohol, tobacco, prescription) and illegal drugs (e.g. cocaine, heroin, psychedelics). Examines health effects, theories of addiction, and the role of social determinants of health and racial inequalities on differential drug penalties and access to treatment services. Reviews public health evidence-based programming and policies for the prevention and treatment of drug use.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EVIDENCE-BASED HEALTH PROMOTION",
  "course_number": "H 376",
  "credits": "3",
  "description": "Future health professionals will learn what makes a successful health promotion program. Students will lean about research-tested programs that are effective for promoting health in community, clinical, and educational settings. Students will begin to develop the skills needed to critically examine evidence in the field and select programs to address current public health issues.",
  "prerequisites": [["H 100", "H 100H"], ["H 225"]]
}, {
  "corequisites": [],
  "course_name": "SAFETY AND HEALTH STANDARDS AND LAWS",
  "course_number": "H 385",
  "credits": "3",
  "description": "Emphasis on the Occupational Safety and Health Act; study includes the scope and duties under the act, enforcement, and adjudication procedures and OSHA litigation; components of Oregon-OSHA.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GLOBAL ENVIRONMENTAL HEALTH",
  "course_number": "H 388",
  "credits": "3",
  "description": "An overview of global environmental issues, including climate change, air pollution, water, e-waste, and metals, and their impacts on human health.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "H 399",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "H 399H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "H 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "H 402",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "H 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "H 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "H 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "H 407",
  "credits": "1-16",
  "description": "Seminar to prepare students for their internship in public health. Focus is on professionalism, leadership skills, identifying strengths, and transitioning from college to graduate school or the working world.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "H 407H",
  "credits": "1-16",
  "description": "Seminar to prepare students for their internship in public health. Focus is on professionalism, leadership skills, identifying strengths, and transitioning from college to graduate school or the working world.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "H 408",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "H 409",
  "credits": "1-6",
  "description": "Supervised work experience in a public health or health care administration setting. Open to majors in public health.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "H 410",
  "credits": "1-12",
  "description": "Directed field experience with participation in a community, worksite, or health agency program. Experience is individually arranged to meet student needs.",
  "prerequisites": [["H 407"]]
}, {
  "corequisites": [],
  "course_name": "BE THE CHANGE FOR GLOBAL HEALTH TRANSFORMATION",
  "course_number": "H 414",
  "credits": "3",
  "description": "Learn how stigma and discrimination create differences in access to resources and lead to health injustice and disparities. Draw on social justice and community mobilization frameworks to explore health-related social movements and social change necessary to improve public health throughout the world. Contextualize local work to eliminate health disparities in the United States within a global context and as part of global processes. Learn how community mobilization can lead to the transformation of structures, systems, and ideologies that drive discrimination and health disparities.",
  "prerequisites": [["H 100", "H 100H"]]
}, {
  "corequisites": [],
  "course_name": "PEOPLE ON THE MOVE: MIGRATION AND GLOBAL HEALTH",
  "course_number": "H 415",
  "credits": "3",
  "description": "Overview of migration as an issue of global health importance; social determinants of migrant health and disparities; migrant health and sustainable development.",
  "prerequisites": [["H 100", "H 100H"]]
}, {
  "corequisites": [],
  "course_name": "GLOBAL POVERTY AND HEALTH DISPARITIES",
  "course_number": "H 416",
  "credits": "3",
  "description": "Learn why poverty remains a primary factor in poor health outcomes around the world, driving limited access to clean water and sanitation, healthful food, education, safety, basic rights, and health care. Examine global poverty, including the causes and consequences of global poverty and the ways in which social structures, identities, and policies shape wealth and health. Discuss global distribution of wealth, the wealth-health gradient and social determinants of health in a global context, causes and consequences of global poverty, and policy and programmatic intervention strategies aimed at reducing material hardship and global inequality.",
  "prerequisites": [["H 100", "H 100H"]]
}, {
  "corequisites": [],
  "course_name": "PRE-INTERNSHIP SEMINAR",
  "course_number": "H 419",
  "credits": "2",
  "description": "Prepares public health students for their internship and career. Provides a focus on leadership skills, professional development, internship site requirements and identification, and career and graduate school exploration.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MENTAL HEALTH: A PUBLIC HEALTH PERSPECTIVE",
  "course_number": "H 421",
  "credits": "3",
  "description": "Explores mental health from a public health perspective, from diagnosis to treatment and prevention. Examines a variety of topics including prevalence of mental illness, past and current mental health policy, mental illness and the legal/criminal justice systems, stigma surrounding mental illness and treatment, social determinants of mental health, mental health inequities, and evidence-based interventions and policies to promote mental health.",
  "prerequisites": [["H 225"]]
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF EPIDEMIOLOGY",
  "course_number": "H 425",
  "credits": "3",
  "description": "Explores and facilitates student practice of foundational concepts in epidemiology, including measures of disease frequency; surveillance; measures of association; causal theory; sources of inaccuracy; experimental and observational study designs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECONOMIC ISSUES IN HEALTH AND MEDICAL CARE",
  "course_number": "H 432",
  "credits": "3",
  "description": "Application of economic principles to the health care field: the demand for medical care and insurance, health care suppliers, health care markets.",
  "prerequisites": [["ECON 201", "ECON 201H"], ["H 210"]]
}, {
  "corequisites": [],
  "course_name": "^HEALTH CARE LAW AND REGULATION",
  "course_number": "H 434",
  "credits": "3",
  "description": "Legal aspects of health care delivery; tort law and its applications; professional liability and liability insurance; laws relative to health care institutions, cost controls, antitrust and access.",
  "prerequisites": [["H 210"], ["H 250"], ["WR 222", "WR 222H", "WR 323", "WR 323H"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED TOPICS IN HEALTH CARE MANAGEMENT",
  "course_number": "H 436",
  "credits": "3",
  "description": "Covers how health services are governed and organized; how health care organizations assess and adapt to change; constraints/opportunities in shaping organizational performance; leadership; strategic decision-making and the use of evidence-based management in health care.",
  "prerequisites": [["H 210"], ["H 250"]]
}, {
  "corequisites": [],
  "course_name": "GENERAL PUBLIC HEALTH INTERNSHIP",
  "course_number": "H 439",
  "credits": "6,12",
  "description": "Provides an opportunity for public health students to gain a field experience under the guidance of the preceptor at a public health-related organization and apply health equity lens. Allows students to choose an internship in local, domestic and global settings in order to their needs and specific interests.",
  "prerequisites": [["H 419"]]
}, {
  "corequisites": [],
  "course_name": "*OCCUPATIONAL HEALTH",
  "course_number": "H 445",
  "credits": "3",
  "description": "Current and historical topics in the area of occupational health, with particular emphasis on the types of materials that produce human health effects; clinical and epidemiologic data used to assess the public health importance of occupational pollutants and to evaluate control strategies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PUBLIC HEALTH TOXICOLOGY",
  "course_number": "H 448",
  "credits": "3",
  "description": "Introduction to the concepts and principles of toxicology as they apply to environmental and occupational health.",
  "prerequisites": [["H 344"]]
}, {
  "corequisites": [],
  "course_name": "MEDIA",
  "course_number": "H 449",
  "credits": "COMMUNICATION",
  "description": "Examines the effects of media on population health from the impact of advertising to the impact of public health campaigns. Explores the theory and practice of public health communication through the examination of commercial and social advertising, program and editorial content, media advocacy, and social marketing. Develops skills through the development of communication campaigns for behavior change.",
  "prerequisites": [["H 225"]]
}, {
  "corequisites": [],
  "course_name": "FINANCIAL MANAGEMENT OF HEALTH CARE ORGANIZATIONS",
  "course_number": "H 457",
  "credits": "3",
  "description": "Utilization of standard financial tools needed to manage the capital resources of health care organizations. Includes funding capital projects, product costing, budgeting methods, capital formation and investment strategies.",
  "prerequisites": [["H 210"], ["H 250"], ["BA 315"]]
}, {
  "corequisites": [],
  "course_name": "REIMBURSEMENT MECHANISMS",
  "course_number": "H 458",
  "credits": "3",
  "description": "Introduces and analyzes the different types of healthcare reimbursement methodologies used in the U.S. health care system.",
  "prerequisites": [["H 210"]]
}, {
  "corequisites": [],
  "course_name": "HEALTH MANAGEMENT AND POLICY INTERNSHIP",
  "course_number": "H 459",
  "credits": "6,12",
  "description": "Emphasizes directed field experience with a focus on health management and policy projects and activities that are completed with a public health related organization including health departments, hospitals, schools, shelters, and other community organizations. Provides individually arranged experience to meet student needs and specific health management and policy interests.",
  "prerequisites": [["H 419"], ["H 436"]]
}, {
  "corequisites": [],
  "course_name": "INFECTIOUS DISEASE EPIDEMIOLOGY",
  "course_number": "H 462",
  "credits": "3",
  "description": "Describes the broad trends in national and global burden of infectious diseases. Explores epidemiologic methods specific to investigation and control of infectious diseases. Introduces data sources and analysis methods for infectious disease surveillance, outbreak investigations, and epidemiologic research. Discusses individual- and population-level risk factors for infection and role of infectious disease epidemiologists on public health response teams.",
  "prerequisites": [["H 425"]]
}, {
  "corequisites": [],
  "course_name": "HEALTH PROMOTION AND HEALTH BEHAVIOR INTERNSHIP",
  "course_number": "H 469",
  "credits": "6,12",
  "description": "Emphasizes directed field experience with a focus on health promotion and health behavior projects and activities that are completed with a public health related organization including health departments, hospitals, schools, shelters, and other community organizations. Provides individually arranged experience to meet student needs and specific health promotion and health behavior interests.",
  "prerequisites": [["H 419"], ["H 476"]]
}, {
  "corequisites": [],
  "course_name": "+PUBLIC HEALTH EQUITY & SOCIAL JUSTICE IN THE U.S.",
  "course_number": "H 470",
  "credits": "4",
  "description": "Examines promising practices for addressing health inequities in the US by analyzing theories, interventions, activist movements, and research initiatives that might interrupt manifestations of racialization and social stratification. Emphasizes reflection, active learning, and inclusive activities and strategies that support skill development related to health justice, equity, diversity, and inclusion.",
  "prerequisites": [["H 225"]]
}, {
  "corequisites": [],
  "course_name": "^PLANNING AND EVALUATING HEALTH PROMOTION PROGRAMS",
  "course_number": "H 476",
  "credits": "4",
  "description": "A systematic approach to planning, implementing and evaluating health promotion programs in a variety of health related settings. Write a series of drafts to effectively develop a health promotion program plan.",
  "prerequisites": [["H 225"], ["H 320"], ["H 376"]]
}, {
  "corequisites": [],
  "course_name": "UNDERGRADUATE EOH SEMINAR",
  "course_number": "H 480",
  "credits": "1",
  "description": "Explores current topics in environmental health and safety. EOH faculty will discuss their current research interests; EOH graduate student speakers will share their environmental health and safety internship experiences. Documentaries will be viewed to introduce topics of discussion. Features will be discussions relating directly to ongoing, current environmental/occupational health crises, both in the United States and around the world.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EMERGENCY AND DISASTER MANAGEMENT",
  "course_number": "H 489",
  "credits": "3",
  "description": "Study of preparedness, response, recovery and business resumption strategies, activities and applications needed to effectively deal with emergency and disaster incidents.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "REPRODUCTIVE EPIDEMIOLOGY",
  "course_number": "H 493",
  "credits": "3",
  "description": "Explores the epidemiology of human fertility and pregnancy. Assesses and critiques current research, controversial issues, and methodological challenges encountered when studying reproductive health from a population perspective. Discusses the role of epidemiologists in addressing bias and inequities in maternity care.",
  "prerequisites": [["H 425"]]
}, {
  "corequisites": [],
  "course_name": "APPLIED ERGONOMICS",
  "course_number": "H 494",
  "credits": "3",
  "description": "Principles of occupational ergonomics for managing optimal worker performance and well-being.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "H 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "H 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "H 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "H 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "H 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "H 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "H 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "H 509",
  "credits": "1-16",
  "description": "Supervised work experience in a public health or health care administration setting. Open to majors in public health.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "H 510",
  "credits": "1-16",
  "description": "Directed field experience with participation in a community, worksite, or health agency program. Experience is individually arranged to meet student needs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMUNITY",
  "course_number": "H 511",
  "credits": "CULTURE",
  "description": "Overview of health issues across cultures, ethnic groups, and regional/national boundaries from a critical and interdisciplinary perspective. Special emphasis on understanding social and behavioral factors that influence health in underserved communities/groups, especially ethnic/racial minorities, women, children, and migrants.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO ENVIRONMENTAL AND OCCUPATIONAL HEALTH SCIENCES",
  "course_number": "H 512",
  "credits": "3",
  "description": "Introduction to environmental and occupational health. Hazards affecting human health are examined in the context of current social, political and regulatory pressures.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTEGRATED APPROACH TO PUBLIC HEALTH",
  "course_number": "H 513",
  "credits": "12",
  "description": "An integrated approach to introduce students to the core knowledge and methods used in public health, including evidence-based approaches to public health, public health and health care systems, planning and management to promote health, and policy in public health.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENT",
  "course_number": "H 514",
  "credits": "SAFETY",
  "description": "One-credit graduate seminar on current topics of interest and importance to the environmental health and occupational safety field. Critical reading of research publications, discussion of controversial issues facing ESH professionals, and/or presentation of current ESH research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH METHODS IN SOCIAL AND BEHAVIORAL HEALTH SCIENCES",
  "course_number": "H 515",
  "credits": "4",
  "description": "Introduces quantitative research methods and design. Topics include definition of research problems and questions, hypothesis generation, research design, sampling, variable definition and measurement, data collection, and evaluating the research literature.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH METHODS IN GLOBAL HEALTH",
  "course_number": "H 516",
  "credits": "3",
  "description": "Overview of research methods used to understand health, illness, health care, and health-seeking behavior in international settings. Special emphasis on the use of qualitative and mixed methods in international health research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PUBLIC HEALTH LEADERSHIP AND PROJECT MANAGEMENT",
  "course_number": "H 517",
  "credits": "2",
  "description": "Develop and practice leadership, project management, and partnership skills that are required by public health professionals. Develop and manage a project using best practices in project management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PUBLIC HEALTH ETHICS AND ISSUES",
  "course_number": "H 518",
  "credits": "3",
  "description": "Explores key ethical issues in the context of public health practice; codes and guidelines for ethical conduct of public health practice; issues related to social accountability, vulnerable populations, and ethical framework for community engagement.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DISPLACEMENT",
  "course_number": "H 519",
  "credits": "MIGRATION",
  "description": "Critical examination of health of displaced/migrant populations with an emphasis on health disparities and social determinants. Understanding intersections of humanitarianism, migration, vulnerability, and displacement from a global health perspective.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTH DISPARITIES",
  "course_number": "H 520",
  "credits": "3",
  "description": "Health disparities based on race/ethnicity, culture, social class, and rural/urban residence, among others; strategies to reduce disparities, promote health, and prevent disease in diverse populations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MENTAL HEALTH: A PUBLIC HEALTH PERSPECTIVE",
  "course_number": "H 521",
  "credits": "3",
  "description": "Explores mental health from a public health perspective, from diagnosis to treatment and prevention. Examines a variety of topics including prevalence of mental illness, past and current mental health policy, mental illness and the legal/criminal justice systems, stigma surrounding mental illness and treatment, social determinants of mental health, mental health inequities, and evidence-based interventions and policies to promote mental health.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF PUBLIC HEALTH",
  "course_number": "H 523",
  "credits": "4",
  "description": "Fundamental principles, concepts and tools used in public health to promote the health of populations. Using a combination of case study method, lecture and discussion, students will develop a broad understanding of public health and recognition of how discipline-specializations address the social, behavioral and environmental determinants of public health.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO BIOSTATISTICS",
  "course_number": "H 524",
  "credits": "4",
  "description": "Quantitative analysis and interpretation of health data including probability distributions, estimation of effects, and hypothesis-tests such as Chi-square, one-way ANOVA, and simple linear regression.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EPIDEMIOLOGIC METHODS I",
  "course_number": "H 525",
  "credits": "3",
  "description": "Examines fundamental concepts and methods in epidemiology including measures of disease occurrence in populations, measures of validity and reliability for screening tests, and measures for expressing prognosis. Differentiates various epidemiologic study designs and examines issues of interpretation including bias, confounding, interaction and causation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EPIDEMIOLOGIC METHODS II",
  "course_number": "H 526",
  "credits": "3",
  "description": "Concepts and methods of epidemiological analysis; standardization; stratified analysis; confounding and its control; planning and conducting epidemiologic research; role of multivariate analysis in epidemiologic research.",
  "prerequisites": [["H 524"], ["H 525"]]
}, {
  "corequisites": [],
  "course_name": "CRITICAL ASSESSMENT OF INTERNATIONAL HEALTH PROGRAMS",
  "course_number": "H 527",
  "credits": "3",
  "description": "Introduces the critical evaluation framework of assessing international health development programs, based on self-determination and community ownership principles. The framework of assessment method includes three levels: upstream evaluation, midstream evaluation, and downstream evaluation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GLOBAL HEALTH ISSUES",
  "course_number": "H 528",
  "credits": "3",
  "description": "Examines major issues in health developments of global significance, their causes and impacts on international health, and methods and strategies to address them.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNATIONAL HEALTH",
  "course_number": "H 529",
  "credits": "3",
  "description": "Overview of the epidemiological, economic, political, sociological, and cultural factors that impact on international health. Special emphasis on the methods of prevention/intervention utilized in coping with health problems on an international level.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTH POLICY ANALYSIS AND POLITICS",
  "course_number": "H 530",
  "credits": "3",
  "description": "Examines current health policy issues affecting health care programs, services, and organization as well as the role of politics in public health and health policy. Explores processes by which health policy proposals are generated, promoted, defeated, modified and implemented.",
  "prerequisites": [["HHS 523"]]
}, {
  "corequisites": [],
  "course_name": "ECONOMIC ISSUES IN HEALTH AND MEDICAL CARE",
  "course_number": "H 532",
  "credits": "3",
  "description": "Application of economics principles to the health care field: the demand for medical care and insurance, health care suppliers, health care markets.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTH SYSTEMS ORGANIZATION",
  "course_number": "H 533",
  "credits": "3",
  "description": "Examines the nature of health and health care services and reviews the role of government and the free market on health services. Alternative ways of organizing, financing, and delivery of health care services are explored.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTH CARE LAW AND REGULATION",
  "course_number": "H 534",
  "credits": "3",
  "description": "Legal aspects of health care delivery; tort law and its applications; professional liability and liability insurance; laws relative to health care institutions, cost controls, antitrust and access.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERPRETING EPIDEMIOLOGIC EVIDENCE",
  "course_number": "H 535",
  "credits": "3",
  "description": "Intended for students in the human sciences and allied health fields. Introduces basic epidemiology concepts. Topics will include measures of disease frequency, assessing population health, causal logic, quantifying associations between exposures and health outcomes, epidemiologic study design, and threats to study validity (random error, bias, confounding). Examples focus on application of epidemiological methods to a variety of health-related fields.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTHCARE ORGANIZATION LEADERSHIP THEORY AND BEHAVIOR",
  "course_number": "H 536",
  "credits": "3",
  "description": "Explores organization theory and behavior in health care organizations. Emphasizes developing and analyzing the factors and forces that influence the structures, behaviors, and operations of health care delivery organizations. Examines and evaluates the emphasis through consideration of organizations, their environments, and the roles of individuals working in management.",
  "prerequisites": [["HHS 523"]]
}, {
  "corequisites": [],
  "course_name": "INJURY EPIDEMIOLOGY",
  "course_number": "H 537",
  "credits": "3",
  "description": "Reviews the distribution and determinants of injuries at the individual and community level. Applies basic epidemiologic methods to issues specific to injury epidemiology, and integrates epidemiologic skills into the analysis of injury data. Compares different approaches to epidemiologic investigation required for the full range of injury exposures and outcomes. Applies epidemiologic findings to the development and evaluation of injury control efforts. Integrates issues of ethics and equity into the study of injury and the development of injury control measures.",
  "prerequisites": [["HHS 523", "H 525"]]
}, {
  "corequisites": [],
  "course_name": "PUBLIC AND PRIVATE HEALTH INSURANCE",
  "course_number": "H 538",
  "credits": "3",
  "description": "Introduction to the principles and practices of public or social and commercial health insurance, and their financial reimbursement mechanisms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MPH INTERNSHIP",
  "course_number": "H 539",
  "credits": "1-16",
  "description": "Synthesizes coursework through an applied practice experience that is tailored to meet individual student needs. Develops at least two products for a community, worksite, or health agency.",
  "prerequisites": [["H 517"]]
}, {
  "corequisites": [],
  "course_name": "WATER AND HUMAN HEALTH",
  "course_number": "H 540",
  "credits": "3",
  "description": "Critically examine the complex relationship between water quality, human activities, and population health.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AIR QUALITY AND HUMAN HEALTH",
  "course_number": "H 541",
  "credits": "3",
  "description": "Examination of the major sources of air pollution, its impact on ecosystems and climate change, and population health. Will also discuss technologies and introduce regulations that are used to control air pollutants.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL AND OCCUPATIONAL HEALTH RISK ASSESSMENT",
  "course_number": "H 542",
  "credits": "3",
  "description": "Understand concepts, principles and practices in modern environmental and occupational risk analysis and how they are utilized to make evidence-based decisions by regulatory agencies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EXPOSURE SCIENCE I",
  "course_number": "H 543",
  "credits": "4",
  "description": "Overview of the concepts, principles and practices in modern environmental and occupational exposure assessment. Exposure Science I provides a broad introduction to environmental and occupational exposure assessment methods, while Exposure Science II focuses on sampling and measurement methods.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL AND OCCUPATIONAL EPIDEMIOLOGY",
  "course_number": "H 544",
  "credits": "3",
  "description": "Examines exposure assessment methodology and epidemiological study designs that are commonly used in environmental and occupational health science in order to characterize the impact of environmental and occupational exposures on population health.",
  "prerequisites": [["H 525"]]
}, {
  "corequisites": [],
  "course_name": "PHYSICAL AGENTS AND HUMAN HEALTH",
  "course_number": "H 546",
  "credits": "3",
  "description": "Focus on physical agents (heat, noise, vibration, radiation) and health risks associated with these agents. It covers the range and sources of exposure to physical agents, methods of characterizing these exposures, effects on human health, and the regulations/standards that set limits for physical agents. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GIS AND PUBLIC HEALTH",
  "course_number": "H 547",
  "credits": "4",
  "description": "Applications of geographic information systems (GIS) to public health are reviewed, including mapping, spatial analysis methods, estimating access, and exposure assessment. This course is geared toward individuals involved in public health who have no (or introductory level) knowledge of GIS. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PUBLIC HEALTH TOXICOLOGY",
  "course_number": "H 548",
  "credits": "3",
  "description": "Introduction to the concepts and principles of toxicology as they apply to environmental and occupational health.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MEDIA",
  "course_number": "H 549",
  "credits": "COMMUNICATION",
  "description": "Examines the effects of media on population health from the impact of advertising to the impact of public health campaigns. Explores the theory and practice of public health communication through the examination of commercial and social advertising, program and editorial content, media advocacy, and social marketing. Develops skills through the development of communication campaigns for behavior change.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED EPIDEMIOLOGICAL ANALYSIS OF SECONDARY DATA",
  "course_number": "H 551",
  "credits": "3",
  "description": "Practical experience performing a hypothesis-driven epidemiological analysis utilizing secondary surveillance or other appropriate data set, writing an analytical plan, appropriate programming for the analysis (using STATA or SAS), understanding the analysis output, preparing tables, and interpreting results.",
  "prerequisites": [["H 526"], ["H 560"], ["H 580"]]
}, {
  "corequisites": [],
  "course_name": "DISASTER EPIDEMIOLOGY",
  "course_number": "H 552",
  "credits": "3",
  "description": "Describes the impact of natural and manmade disasters on human health. Examines epidemiologic methods specific to disasters. Applies fundamental epidemiologic methods to identify and characterize the morbidity and mortality associated with disasters including surveillance, rapid health/needs assessments, tracking and registries, and descriptive and analytic epidemiologic studies.",
  "prerequisites": [["HHS 523", "H 525"]]
}, {
  "corequisites": [],
  "course_name": "STRATEGIC MANAGEMENT OF HEALTH SERVICE ORGANIZATIONS",
  "course_number": "H 556",
  "credits": "3",
  "description": "Theories and methodologies of long-range planning and strategic management in health care organizations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FINANCIAL MANAGEMENT OF HEALTH CARE ORGANIZATIONS",
  "course_number": "H 557",
  "credits": "3",
  "description": "Utilization of standard financial tools needed to manage the capital resources of health care organizations. Includes funding capital projects, product costing, budgeting methods, capital formation and investment strategies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "REIMBURSEMENT MECHANISMS",
  "course_number": "H 558",
  "credits": "3",
  "description": "Introduces and analyzes the different types of healthcare reimbursement methodologies used in the U.S. health care system.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PUBLIC HEALTH SURVEILLANCE",
  "course_number": "H 560",
  "credits": "3",
  "description": "An introduction to public health surveillance systems (national and international) for chronic and infectious diseases. Utility of existing surveillance systems for secondary epidemiological data analysis.",
  "prerequisites": [["H 524"], ["H 525"]]
}, {
  "corequisites": [],
  "course_name": "INFECTIOUS DISEASE EPIDEMIOLOGY",
  "course_number": "H 562",
  "credits": "3",
  "description": "Describes the broad trends in national and global burden of infectious diseases. Explores epidemiologic methods specific to investigation and control of infectious diseases. Introduces data sources and analysis methods for infectious disease surveillance, outbreak investigations, and epidemiologic research. Discusses individual- and population-level risk factors for infection and role of infectious disease epidemiologists on public health response teams.",
  "prerequisites": [["H 525", "HHS 523"]]
}, {
  "corequisites": [],
  "course_name": "PHYSICAL ACTIVITY EPIDEMIOLOGY",
  "course_number": "H 563",
  "credits": "3",
  "description": "Explores the epidemiology of physical activity, exercise, and health in human populations. Assesses and critiques current research, controversial issues, and methodological problems encountered when studying physical activity in humans, including an extensive exploration of measurement methods and unique study designs.",
  "prerequisites": [["HHS 523", "H 525"]]
}, {
  "corequisites": [],
  "course_name": "COMPUTING TOOLS AND HEALTH DATA ANALYSIS",
  "course_number": "H 564",
  "credits": "3",
  "description": "Develops programming and data analysis skills in statistical computing software R and SAS. Emphasizes data input, data manipulation, data management, inferential statistics, and data visualization as relevant to public health research. Analyzes real public health data and interprets the statistical results from R and SAS output.",
  "prerequisites": [["H 524"]]
}, {
  "corequisites": [],
  "course_name": "BEHAVIORAL & SOCIAL SCIENCE THEORY FOR PUBLIC HEALTH",
  "course_number": "H 571",
  "credits": "4",
  "description": "Examines how behavioral and social science theories are used to understand health behavior and population health. Applies knowledge of theories and theoretical constructs toward development of health promotion interventions. Emphasizes use of an ecological framework and application to public health practice, including use of theories, models, and frameworks to develop, adapt, and sustain health promotion interventions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMUNITY ORGANIZATION FOR HEALTH PROMOTION AND EDUCATION",
  "course_number": "H 572",
  "credits": "3",
  "description": "History, theory, and practice of community organizing for health advocacy; focus on group processes, use of media, leadership, coalitions, grass roots methods and social change.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO MULTILEVEL/HIERARCHICAL MODELS",
  "course_number": "H 573",
  "credits": "3",
  "description": "Introduction to the theory and application of hierarchical models to problems in epidemiology and public health. Hierarchical models will be dealt with using both frequentist and Bayesian frameworks.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EVALUATION OF HEALTH PROMOTION PROGRAMS",
  "course_number": "H 575",
  "credits": "4",
  "description": "Provides theoretical and practical bases for program evaluation. Develops basic skills in a variety of approaches to evaluation, including techniques that are suitable for evaluating health promotion, community health improvement, public health programs, and related health and social services programs. Synthesizes course learning through designing a program plan including an evaluation framework, methodology, stakeholder and cross-sector partners identification, measurement and assessment tools, and analytical plan for a relevant program. Discusses and reflects on data justice to ensure equity-focused data prioritization, collection, interpretation, and ownership.",
  "prerequisites": [["HHS 523", "H 515", "HHS 533", "HHS 534"]]
}, {
  "corequisites": [],
  "course_name": "PROGRAM PLANNING FOR HEALTH/HUMAN SERVICES",
  "course_number": "H 576",
  "credits": "4",
  "description": "Design program plans for health impact with a focus on evidence-based public health and human service practices. Identify, adapt, implement, and evaluate a behavior change program that will improve targeted risk behavior and/or health.",
  "prerequisites": [["H 571"], ["H 575"]]
}, {
  "corequisites": [],
  "course_name": "LINEAR REGRESSION AND ANALYSIS OF TIME TO EVENT DATA",
  "course_number": "H 580",
  "credits": "4",
  "description": "Multiple linear regression analysis for measurement data and survival analysis methods for time to event health data, including modes of inference, diagnostics, model selection, and reporting conclusions. Lec/lab.",
  "prerequisites": [["H 524", "HDFS 530"]]
}, {
  "corequisites": [],
  "course_name": "GENERALIZED LINEAR MODELS AND CATEGORICAL DATA ANALYSIS",
  "course_number": "H 581",
  "credits": "4",
  "description": "Biostatistical methods focusing on binary and count data will provide a foundation for understanding and implementing generalized linear regression and categorical data models that are commonly used to analyze epidemiological and public health data from cohort, case-control, and clinical trial study designs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ANALYSIS OF CORRELATED HEALTH DATA",
  "course_number": "H 582",
  "credits": "3",
  "description": "Biostatistical methods for clustered, repeated measures, and longitudinal correlated health data, with an introduction to applications of linear and generalized linear mixed models and generalized estimating equations.",
  "prerequisites": [["H 581"]]
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL AND OCCUPATIONAL HEALTH AND SAFETY MANAGEMENT",
  "course_number": "H 583",
  "credits": "4",
  "description": "Studies the design and management principles and practices in the environment, safety and health field.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENT",
  "course_number": "H 585",
  "credits": "SAFETY",
  "description": "Survey of the environment, safety and health policy and law in the United States. Furnishes the basic knowledge and general understanding about policy and law-related issues important to all environmental health and safety professionals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BAYESIAN BIOSTATISTICS IN PUBLIC HEALTH",
  "course_number": "H 586",
  "credits": "3",
  "description": "An examination of methods for designing and implementing Bayesian analysis to address scientific questions through hands-on experience with health data. This survey course also covers proper interpretation and communication of results from practical Bayesian methods for biostatistics data analysis, with illustrations of the utility of Bayesian ideas in public health.",
  "prerequisites": [["H 581"]]
}, {
  "corequisites": [],
  "course_name": "TIME TO EVENT ANALYSIS OF HEALTH DATA",
  "course_number": "H 587",
  "credits": "3",
  "description": "Biostatistical models and methods for survival analysis of time to event data that are routinely encountered in biomedical and health research.",
  "prerequisites": [["H 524", "HDFS 530"]]
}, {
  "corequisites": [],
  "course_name": "APPLIED OCCUPATIONAL SAFETY AND HEALTH",
  "course_number": "H 588",
  "credits": "3",
  "description": "The management and technical aspects of a workplace safety and health program are identified and assessed. Students completing the course receive a 30-hour OSHA General Industry card.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EMERGENCY AND DISASTER MANAGEMENT",
  "course_number": "H 589",
  "credits": "3",
  "description": "Study of preparedness, response, recovery and business resumption strategies, activities and applications needed to effectively deal with emergency and disaster incidents.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OCCUPATIONAL ERGONOMICS AND BIOMECHANICS",
  "course_number": "H 590",
  "credits": "3",
  "description": "Examines the advanced theories, applications, and contemporary topics of occupational ergonomics and biomechanics. Topics include muscle physiology, work-related musculoskeletal disorders, assessing biomechanical exposure in the workplace, various material handling assessment tools, 3-Dimensional Static Strength Prediction Program, human vibrations, and implementing ergonomic interventions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "REPRODUCTIVE EPIDEMIOLOGY",
  "course_number": "H 593",
  "credits": "3",
  "description": "Explores the epidemiology of human fertility and pregnancy. Assesses and critiques current research, controversial issues, and methodological challenges encountered when studying reproductive health from a population perspective. Discusses the role of epidemiologists in addressing bias and inequities in maternity care.",
  "prerequisites": [["HHS 523", "H 525"]]
}, {
  "corequisites": [],
  "course_name": "APPLIED ERGONOMICS",
  "course_number": "H 594",
  "credits": "3",
  "description": "Principles of occupational ergonomics for managing optimal worker performance and well-being.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTHCARE EPIDEMIOLOGY",
  "course_number": "H 596",
  "credits": "3",
  "description": "Explores healthcare from an epidemiologic perspective, including current research, controversial issues, and methodological problems. Covers a variety of healthcare-related topics such as evidence-based medicine, institutional infection control, medical errors, screening and diagnostic testing, cost-effectiveness, randomized controlled trials and the FDA approval process, and others related to the delivery and assessment of healthcare. Focuses on the US healthcare system specifically, including how biases and inequities currently inherent in that system affect outcomes and care received.",
  "prerequisites": [["HHS 523"]]
}, {
  "corequisites": [],
  "course_name": "EPIDEMIOLOGIC METHODS IN FOODBORNE DISEASE OUTBREAK INVESTIGATION",
  "course_number": "H 597",
  "credits": "3",
  "description": "Explores the practical basis for developing and implementing methods for foodborne disease outbreak detection, investigation and control. Discusses biological characteristics of major foodborne disease pathogens, clinical features of the illnesses they cause and epidemiologic presentations of foodborne outbreaks. Discusses the implications of these characteristics and strategies to promote timely decision-making during an effective outbreak investigation.",
  "prerequisites": [["HHS 523", "H 525"]]
}, {
  "corequisites": [],
  "course_name": "HEALTH POLICY ANALYSIS METHODS",
  "course_number": "H 598",
  "credits": "3",
  "description": "Develops skills for evaluating and synthesizing health policy research literature, selecting health policy data sources, designing and performing quantitative empirical analyses, and presenting findings.",
  "prerequisites": [["HHS 523"], ["HHS 533"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "H 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "H 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "H 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "H 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "H 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "H 607",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "H 608",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "H 610",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO SYSTEMATIC LITERATURE REVIEWS",
  "course_number": "H 611",
  "credits": "3",
  "description": "Students will learn how to apply systematic review methodology to a research question of their choice and understand how literature reviews inform evidence-based decision-making. Examples will focus on applying literature reviews to public health, clinical science, and biomedical research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DOCTORAL SEMINAR IN PUBLIC HEALTH: RESEARCH AND PRACTICE",
  "course_number": "H 612",
  "credits": "1",
  "description": "Contemporary research and professional issues specific to the discipline of public health. Includes responsible conduct of research, writing for publication, professional development and leadership, and faculty research in public health.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT RESEARCH PROJECT",
  "course_number": "H 613",
  "credits": "1-9",
  "description": "Independent research project for PhD students, including research design, execution or research, and the formal presentation of findings in written form. Student will develop an original research topic based on knowledge and review of the literature in a public health-relevant area of inquiry.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH MANUSCRIPT",
  "course_number": "H 614",
  "credits": "4",
  "description": "PhD students write a manuscript to submit to a peer-reviewed journal as part of the course requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED EVALUATION AND RESEARCH DESIGN",
  "course_number": "H 615",
  "credits": "3",
  "description": "Provides an in-depth examination of advanced research designs and methods for establishing causal statements about the efficacy, effectiveness and generalizability of public health and social service interventions designed to alter public health and social risk or protective factors.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED TOPICS IN GLOBAL HEALTH INTERVENTION AND PRACTICE",
  "course_number": "H 620",
  "credits": "3",
  "description": "Examines the processes and tools involved in planning and evaluating culturally competent health and human service prevention and intervention programs in the global context. Special considerations in program decision-making in the global context (community engagement, cultural competence, sustainability, feasibility, political/ethical issues) will be explored. Provides a key forum for doctoral students to share ongoing developments in their research and practice drawing from fieldwork as well as attended conferences and meetings.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GLOBAL HEALTH SYSTEMS",
  "course_number": "H 622",
  "credits": "POLICY",
  "description": "Focuses on learning to identify key stakeholders in the politics of global health, and to be able to describe political and policy processes involved in negotiating global health decisions. Employment of theories and evidence from both the global North and South to explain political processes affecting public health practice and programs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GLOBAL HEALTH SYSTEM FINANCE AND STRENGTHENING",
  "course_number": "H 626",
  "credits": "3",
  "description": "Introduces an analytical framework of health system finance strengthening for global health, from local community to national level and international level. Develops the analytical skill and knowledge for examining the source and mechanism of financing health systems and identify, mobilize, organize, and manage domestic and global health resources. Provides training to examine equity and efficiency of financial burden in a health system, and the strategies to strengthen it.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUANTITATIVE HEALTH POLICY RESEARCH METHODS I",
  "course_number": "H 630",
  "credits": "4",
  "description": "Contemporary doctoral-level quantitative health policy/services research methods emphasizing linear regression models, data sources for health policy research, and health policy research literature.",
  "prerequisites": [["H 524"]]
}, {
  "corequisites": [],
  "course_name": "COST EFFECTIVENESS ANALYSIS IN HEALTH AND MEDICAL CARE",
  "course_number": "H 635",
  "credits": "3",
  "description": "The primary objective of this course is to introduce students to cost-effectiveness studies in health and medical care. Covers the core concepts of CEA, quality adjusted life years, cost calculations, and decision rules.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PUBLIC AND PRIVATE HEALTH INSURANCE",
  "course_number": "H 638",
  "credits": "3",
  "description": "Introduction to the principles and practices of public or social and commercial health insurance, their finance mechanisms, and theoretical foundation behind the selection of certain system of health insurance and finance method.",
  "prerequisites": [["H 533"]]
}, {
  "corequisites": [],
  "course_name": "COMMUNITY-BASED PARTICIPATORY RESEARCH",
  "course_number": "H 639",
  "credits": "4",
  "description": "Focuses on initiating and conducting research in partnership with communities. Includes in-depth examination of community-based participatory research (CBPR) elements, principles, theories, and approaches; how researchers can successfully partner with communities; and research with minority and/or underprivileged communities; with examples from environmental health, gerontology, and health promotion.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "REPORTING RESULTS: WRITING FOR EPIDEMIOLOGY",
  "course_number": "H 650",
  "credits": "3",
  "description": "Applied experience writing a scientific paper to disseminate results, including deciding on authorship, preparing a lay summary, revising and responding to peer review, and serving as a reviewer.",
  "prerequisites": [["H 526"], ["H 551"], ["H 580"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED EPIDEMIOLOGICAL METHODS",
  "course_number": "H 651",
  "credits": "4",
  "description": "Covers advanced topics in epidemiology. Course expands on many of the same topics as H 526, and explores them in greater breadth and depth. Topics include causal theory, measures of disease and association, confounding, selection bias, predictive models, directed acyclic graphs, effect modification, mediation, indirect and direct effects, study design, and other contemporary topics.",
  "prerequisites": [["H 526"], ["H 581"]]
}, {
  "corequisites": [],
  "course_name": "QUANTITATIVE HEALTH POLICY RESEARCH METHODS II",
  "course_number": "H 659",
  "credits": "4",
  "description": "Advanced doctoral-level quantitative health policy/services research methods emphasizing health care utilization, expenditures, and outcomes data.",
  "prerequisites": [["H 630"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED THEORIES OF HEALTH BEHAVIOR",
  "course_number": "H 671",
  "credits": "3",
  "description": "Provides an in-depth examination of major theories of health behavior (both health compromising and health enhancing).",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED QUALITATIVE METHODS IN HEALTH BEHAVIOR",
  "course_number": "H 672",
  "credits": "3",
  "description": "Provides an in-depth examination of the use of qualitative methods in health behavior research and practice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MEASUREMENT OF HEALTH BEHAVIOR CONCEPTS",
  "course_number": "H 673",
  "credits": "4",
  "description": "Provides in-depth study and field work for graduate students in public health and related fields of the methods used in the conceptualization, development, and evaluation of quantitative measures of health behavior and related concepts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DEVELOPMENT OF HEALTH BEHAVIOR INTERVENTIONS",
  "course_number": "H 675",
  "credits": "3",
  "description": "Examines the application of social/behavioral theories in health promotion interventions and in conducting intervention research in diverse populations. The course will focus on program development, on implementation strategies, and on translation into practice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED TOPICS IN HEALTH PROMOTION AND HEALTH BEHAVIOR",
  "course_number": "H 676",
  "credits": "3",
  "description": "Examines topics of relevance to health promotion and health behavior. Specific topics include current issues and emerging research findings, with a focus on social and behavior science perspectives, analysis of public health problems, and application of principles and practices of health promotion and health behavior.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL STUDIES",
  "course_number": "H 699",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]