[{
  "corequisites": [],
  "course_name": "LEADERSHIP",
  "course_number": "HHS 002",
  "credits": "0",
  "description": "Provides basic personal and interpersonal leadership skills that can be used within and outside of a work setting. Through practice, the leadership experience helps explore motivation, decision-making, time management, power, team building, conflict, ethics, dealing with change, communication skills, and diversity issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "UNDERGRADUATE RESEARCH",
  "course_number": "HHS 003",
  "credits": "0",
  "description": "Engage in research activities appropriate to the discipline; and through the research experience, acquire skills, techniques, and knowledge relevant to the field of study. In consultation with a faculty mentor, engage in research activity, and make and execute a plan for a project.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HHS 199",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "HHS 206",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MY CAREER MATTERS",
  "course_number": "HHS 222",
  "credits": "3",
  "description": "Explores development in academic and career preparation techniques. Develops skills in career assessment, practical life-skills, critical thinking tools, and career development techniques to improve success in the working world. Applies related assessments to identify potential career pathways.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MY CAREER MATTERS",
  "course_number": "HHS 222X",
  "credits": "3",
  "description": "Highlights academic and career preparation techniques for CPHHS students. Begins with career assessment, then adds practical life-skills, critical thinking tools, and career development techniques to improve success in the working world. Geared towards first- and second-year students, but open to all students.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*LIFETIME FITNESS FOR HEALTH",
  "course_number": "HHS 231",
  "credits": "2",
  "description": "Provides up-to-date and relevant health and wellness information; practical strategies to implement positive behavior change in physical activity, nutrition, and stress management throughout college and the lifespan.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*LIFETIME FITNESS FOR HEALTH",
  "course_number": "HHS 231H",
  "credits": "2",
  "description": "Provides up-to-date and relevant health and wellness information; practical strategies to implement positive behavior change in physical activity, nutrition, and stress management throughout college and the lifespan.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*LIFETIME FITNESS",
  "course_number": "HHS 241",
  "credits": "1",
  "description": "Assessment, evaluation and practice of physical fitness and health behaviors leading to the development of a personal fitness program. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HHS 399",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLICATION OF PUBLIC HEALTH DATA",
  "course_number": "HHS 420",
  "credits": "3",
  "description": "Introduces how to conduct descriptive analyses, interpret and visualize/present data using Microsoft Excel software. Focuses on data and analysis methods and data interpretation and presentation relevant to public health and human health.",
  "prerequisites": ["H 220", "ST 201", "ST 243Z"]
}, {
  "corequisites": [],
  "course_name": "^REPORTING OF PUBLIC HEALTH DATA",
  "course_number": "HHS 421",
  "credits": "4",
  "description": "Introduces how to summarize and report descriptive data in the field of public health and how to communicate the data report to varied audiences in order to advance health equity.",
  "prerequisites": ["HHS 420", "H 425"]
}, {
  "corequisites": [],
  "course_name": "GLOBAL NUTRITION",
  "course_number": "HHS 440",
  "credits": "3",
  "description": "Examines causes and consequences of nutritional problems including malnutrition, both under- and overnutrition, that impact health, developmental capacity, and economic well-being of populations in developing societies. Explores policies, practices, and cultural approaches to improving nutritional status at the household, local and international levels.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTEGRATED APPROACH TO PUBLIC HEALTH I",
  "course_number": "HHS 513",
  "credits": "6",
  "description": "An integrated approach to introduce students to the core knowledge and methods used in public health, including evidence-based approaches to public health, public health and health care systems, planning and management to promote health, and policy in public health. This course is the first of a two-part course sequence.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTEGRATED APPROACH TO PUBLIC HEALTH II",
  "course_number": "HHS 514",
  "credits": "6",
  "description": "An integrated approach to introduce students to the core knowledge and methods used in public health, including: evidence-based approaches to public health; public health and health care systems; planning and management to promote health; and policy in public health. This course is the second of a two part course sequence.",
  "prerequisites": ["HHS 513"]
}, {
  "corequisites": [],
  "course_name": "CASE STUDIES IN PUBLIC HEALTH PRACTICE",
  "course_number": "HHS 517",
  "credits": "3",
  "description": "Case-based learning to illustrate the complexity of public health issues and to demonstrate the need for integrated approaches for developing and implementing successful strategies in public health practice. Students will apply a wide range of knowledge and skills essential to public health practice that relate to outbreak investigation, policy analysis, regulatory decision-making, ethics, program development, program evaluation, research synthesis, screening programs, working with stakeholders, health risk communication, and disaster preparedness.",
  "prerequisites": ["H 513", "HHS 514"]
}, {
  "corequisites": [],
  "course_name": "APPLICATION OF PUBLIC HEALTH DATA",
  "course_number": "HHS 520",
  "credits": "3",
  "description": "Introduces how to conduct descriptive analyses, interpret and visualize/present data using Microsoft Excel software. Focuses on data and analysis methods and data interpretation and presentation relevant to public health and human health.",
  "prerequisites": ["H 513", "HHS 513", "H 524", "ST 511"]
}, {
  "corequisites": [],
  "course_name": "REPORTING OF PUBLIC HEALTH DATA",
  "course_number": "HHS 521",
  "credits": "4",
  "description": "Introduces how to summarize and report descriptive data in the field of public health and how to communicate the data report to varied audiences in order to advance health equity.",
  "prerequisites": ["HHS 520", "H 513", "HHS 513", "H 523"]
}, {
  "corequisites": [],
  "course_name": "PUBLIC HEALTH IMPACT",
  "course_number": "HHS 523",
  "credits": "4",
  "description": "Apply foundational knowledge and methods to critically appraise current and emerging public health issues through both disciplinary and integrated lenses. Identify and address structural inequities that impact public health. Link determinants and outcomes to actions for public health priorities. Inspire vital action to address pressing public health challenges.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PUBLIC HEALTH SOLUTIONS",
  "course_number": "HHS 524",
  "credits": "3",
  "description": "Focuses on in-depth examination of current public health challenges and potential solutions. Provides an immersive project and team-based experience exploring diverse approaches for addressing complex problems. Emphasizes evidence-based practices; stakeholder analysis; appraisal of the social, economic and political landscape; advanced systems thinking approaches; and engagement of interdisciplinary partners.",
  "prerequisites": ["HHS 523"]
}, {
  "corequisites": [],
  "course_name": "LINEAR REGRESSION IN PUBLIC HEALTH",
  "course_number": "HHS 526",
  "credits": "2",
  "description": "Biostatistical tools for scientific applications in public health using linear regression analysis. Confounding, effect modification, variable selection, assessing model fit, observational studies, and exploratory data analysis. Emphasis on the use of statistical packages for analyzing public health data.",
  "prerequisites": ["H 524"]
}, {
  "corequisites": [],
  "course_name": "LOGISTIC REGRESSION IN PUBLIC HEALTH",
  "course_number": "HHS 527",
  "credits": "2",
  "description": "Biostatistical tools for scientific applications in public health using logistic regression analysis. Confounding, effect modification, variable selection, assessing model fit, exploratory data analysis, and observational studies. Emphasis on the use of statistical packages for analyzing public health data.",
  "prerequisites": ["H 524"]
}, {
  "corequisites": [],
  "course_name": "COMPUTING FOR POPULATION HEALTH DATA",
  "course_number": "HHS 533",
  "credits": "2",
  "description": "Applies a statistical computing package for importing, cleaning, managing, describing, and analyzing population health data. Emphasizes generation and interpretation of numerical summaries and graphical visualizations appropriate for the measurement scale of the data. Illustrates best practices for coding.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUALITATIVE METHODS FOR HEALTH EQUITY",
  "course_number": "HHS 534",
  "credits": "3",
  "description": "Explore foundational approaches, such as grounded theory, extended case method and community-based participatory research. Develop culturally informed research questions to uncover the effects of systemic oppression and advance health equity. Practice data collection and analysis techniques.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EVIDENCE-BASED LEADERSHIP IN PUBLIC HEALTH",
  "course_number": "HHS 537",
  "credits": "3",
  "description": "Examines how collaboration differs from working together, and offer opportunities to develop skills for successful and effective group functioning. Students will be challenged to examine personal strengths (and the strengths of others) as they relate to leadership and followership. Explores evidence-based management – identifying and using organizational and scientific data in decision making.",
  "prerequisites": ["H 536"]
}, {
  "corequisites": [],
  "course_name": "GLOBAL NUTRITION",
  "course_number": "HHS 540",
  "credits": "3",
  "description": "Examines causes and consequences of nutritional problems including malnutrition, both under- and overnutrition, that impact health, developmental capacity, and economic well-being of populations in developing societies. Explores policies, practices, and cultural approaches to improving nutritional status at the household, local and international levels.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PUBLIC HEALTH PERSPECTIVE ON GLOBAL FOOD SECURITY",
  "course_number": "HHS 541",
  "credits": "3",
  "description": "Explore food insecurity and hunger in the U.S. and global contexts, including examination of the causes, correlates, and consequences of hunger and community, national, and international food safety nets.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMUNICATING FOR PUBLIC HEALTH POLICY IMPACT",
  "course_number": "HHS 550",
  "credits": "3",
  "description": "Successful public health professionals communicate clearly and in compelling ways with non-scientific audiences. In this hands-on course, the theory and practice of effective public health communication will be explored, with a focus on advancing a public health policy. Through a selected public health policy topic, students will develop and enhance skills in planning and implementing impactful public health communications, including message development, data visualization, media interviewing, engaging through social media and presenting to policymakers. Professionals in the field, including those in legislative and media roles, will share examples of effective communication and provide constructive feedback on students’ work.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EVIDENCE-BASED PUBLIC HEALTH I",
  "course_number": "HHS 578",
  "credits": "3",
  "description": "Examine evidence-based public health and the process of integrating science-based interventions with community preferences to improve the health of populations. Identify and evaluate evidence-based research including programs, surveillance and policies. Develop skills to select, implement, and adapt evidence-based public health programming integrating input from the community. Align program fit with public health issue and community needs.",
  "prerequisites": ["HHS 523"]
}, {
  "corequisites": [],
  "course_name": "EVIDENCE-BASED PUBLIC HEALTH II",
  "course_number": "HHS 579",
  "credits": "3",
  "description": "Explores evidence-based public health as the process of integrating science-based interventions with community preferences to improve the health of populations. Applies science and adaptation frameworks to planning and evaluating health promotion programs. Synthesizes learning through the development of a grant proposal for an adapted public-health program plus evaluation plan.",
  "prerequisites": ["HHS 578"]
}, {
  "corequisites": [],
  "course_name": "GRANT WRITING FOR PUBLIC HEALTH PRACTITIONERS",
  "course_number": "HHS 580",
  "credits": "4",
  "description": "Provides an introduction to principles of grant writing, with an emphasis on grants seeking funding from national, regional, or local entities (e.g., CDC, foundations) that support research and program that aim to improve community health through health promotion. There will be a focus on grants that MPH-level practitioners seek to conduct research, enhance practice, and/or support delivery of programs within communities. Students will have the opportunity to integrate skills developed through prior courses in the context of writing a grant proposal.",
  "prerequisites": ["H 515", "H 575", "H 576"]
}, {
  "corequisites": [],
  "course_name": "SURVEILLANCE AND FIELD EPIDEMIOLOGY FOR PUBLIC HEALTH",
  "course_number": "HHS 584",
  "credits": "3",
  "description": "Review public health surveillance systems, and the continuum of communicable disease surveillance and field epidemiology. Evaluate a public health surveillance system and their contribution to the prevention and control of adverse health-related events. Describe ethical considerations of and cultural bias in public health surveillance.",
  "prerequisites": ["H 524", "H 525"]
}, {
  "corequisites": [],
  "course_name": "PUBLIC HEALTH LAW",
  "course_number": "HHS 590",
  "credits": "2",
  "description": "Explore the use of law and policy tools to promote access to health and healthy living conditions. Examines the legal powers and duties of government at the federal, state, and local levels to ensure the conditions required for people to be healthy. Discuss individual rights as limitations on the power of the government to act in furtherance of public health goals.",
  "prerequisites": ["HHS 523"]
}, {
  "corequisites": [],
  "course_name": "GLOBAL HEALTH SYSTEMS",
  "course_number": "HHS 597",
  "credits": "3",
  "description": "Explores key components of global health systems, using case studies of institutions, processes, and health outcomes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HHS 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DOCTORAL GRANT WRITING SEMINAR",
  "course_number": "HHS 620",
  "credits": "4",
  "description": "Guides graduate students in any discipline through the process of developing a successful grant proposal for funding to perform research for any agency, including government agencies and non-profits. Examines how grant proposals are evaluated and guides students how to provide comprehensive peer review and proposal evaluation. Applies learning to create a grant proposal and evaluate proposals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HHS 699",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]