[{
  "corequisites": [],
  "course_name": "INTRODUCTION TO HOSPITALITY",
  "course_number": "HM 101",
  "credits": "4",
  "description": "Introduction to the food-service, lodging, and tourism components of the hospitality industry, and the essential leadership and management skills necessary for success in the field. Background information, current issues, and future challenges in various segments of the industry are included.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HOSPITALITY INTERNSHIP",
  "course_number": "HM 210",
  "credits": "3",
  "description": "Students are required to complete this internship so that OSU and the sponsoring company can offer a platform from where students can apply the management concepts learned in class and acquire the necessary hands-on experience in a hotel, restaurant/food service and/or tourism industry to eventually qualify for a supervisory of managerial level role.",
  "prerequisites": ["HM 101"]
}, {
  "corequisites": [],
  "course_name": "LODGING MANAGEMENT",
  "course_number": "HM 230",
  "credits": "4",
  "description": "Provides a comprehensive introduction to the management of hotels and lodging properties. Focuses on operations, service, management and financials of the lodging industry.",
  "prerequisites": ["HM 101"]
}, {
  "corequisites": [],
  "course_name": "HOSPITALITY LAW AND LABOR RELATIONS",
  "course_number": "HM 235",
  "credits": "4",
  "description": "Provides insight into the laws and regulations governing the hospitality industry with an emphasis on labor relations and human resources best practices. Addresses the general concepts of tort, contracts, liability, risk management, employment practices, licensing and insurance needs. Explores the legal issues that today's hospitality professionals face such as privacy, labor laws, the common law system for innkeepers and newer hospitality products in the shared economy such as AirBnB or VRBO.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP II",
  "course_number": "HM 310",
  "credits": "3",
  "description": "Hospitality Internship II builds on the knowledge students have gained from their course work internship (HM 210). Students are required to complete this internship in a hotel, restaurant/food service and/or related hospitality sector. In cooperation with OSU and the sponsoring company, students will apply the HM concepts learned in class to a real-world business environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SERVICE AUTOMATION AND TECHNOLOGY",
  "course_number": "HM 320",
  "credits": "4",
  "description": "Students discover the basic concepts of hospitality technology and service automation. The hospitality industry continues to see significant changes in all facets of business due to changing customer expectations, new and cheaper technology, and a challenging labor market. The result of these forces has led the hospitality industry to increasingly turn to automation of basic job tasks to stay competitive. Examines new technologies shaping the hospitality industry and how industry leaders are taking advantage of these new technologies to improve efficiency and service.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HOSPITALITY TECHNOLOGY LABORATORY",
  "course_number": "HM 321",
  "credits": "4",
  "description": "Technology is critical to attracting, servicing and retaining hospitality customers. The Hospitality Technology Lab course introduces the student to each facet of technology in the industry. The course provides an opportunity for hands-on practical experience with the latest technology. At the end of the course, the student will have a basic working knowledge of Food 3D printers, hotel property management systems, global distribution systems, booking engines, revenue management solutions and other automation tools like Botlr.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ONLINE MARKETING AND REPUTATION MANAGEMENT",
  "course_number": "HM 325",
  "credits": "4",
  "description": "Students are introduced to Online Internet Marketing techniques in the hospitality industry. The course will focus on online marketing, advertising strategies and the importance of a strong internet presence in order to maximize revenue. The course will show how organizations can encourage & capitalize on customer generated content practices to effectively retain customers and generate recurring revenue streams.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "VACATION PROPERTY MANAGEMENT",
  "course_number": "HM 340",
  "credits": "4",
  "description": "The vacation property market is one of the largest segments of the hospitality industry and is forecast to grow further over the next ten years. This course looks at each facet of this market including property development, contracts, management, promotion and financing. The course also explores the additional challenges and opportunities associated with the shared economy such as managing owner relations, homeowner associations, renovations and public policy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HM 399",
  "credits": "4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HOSPITALITY INTERNSHIP III",
  "course_number": "HM 410",
  "credits": "3",
  "description": "Hospitality Internship III builds on the knowledge the students have gained from their course work and their previous internships (HM 210 & HM 310). Students are required to complete this internship in a hotel, restaurant/food service and/or related hospitality sector. In cooperation with OSU and the sponsoring company, students apply the HM concepts learned in class to a real-world environment.",
  "prerequisites": ["HM 310"]
}, {
  "corequisites": [],
  "course_name": "REVENUE MANAGEMENT AND PRICING",
  "course_number": "HM 420",
  "credits": "4",
  "description": "Revenue management is critical to the hospitality industry due to the perishable nature of a service-based product. The fundamental principles and concepts of revenue management covered are capacity management, duration control, demand and revenue forecasting, discounting, overbooking practices, displacement analysis, channel management, and pricing execution.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED RESTAURANT MANAGEMENT AND OWNERSHIP",
  "course_number": "HM 425",
  "credits": "4",
  "description": "Covers concept development, design and funding of a new restaurant, and best practices in operations and management of a full-service foodservice operation. Intended for students wishing to develop their knowledge of foodservice entrepreneurialism, creation, operations and management/ownership.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SERVICE MANAGEMENT",
  "course_number": "HM 430",
  "credits": "4",
  "description": "With growing access to information and alternative products, customers can choose where to do business based on the level of service they receive. This course will study and analyze service delivery systems for the hospitality industry with particular emphasis on implementing a consumer driven quality service program. This course will review customer service philosophy and techniques. Quality issues, service design and delivery, customer interaction systems, complaint handling and service recovery are also addressed.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^ADVANCED HOSPITALITY",
  "course_number": "HM 470",
  "credits": "4",
  "description": "Provides students with an in-depth understanding of the importance of core competencies in the hospitality and tourism industry. A broader interpretation of the hospitality industry is gained and the student will discover new and innovative practices within the industry. Students will apply the knowledge gained in this course and the program as a whole to a capstone project with an industry partner.",
  "prerequisites": []
}]