[{
  "corequisites": [],
  "course_name": "SERVICE LEARNING",
  "course_number": "HORT 001",
  "credits": "0",
  "description": "Engage in a service-learning or community engagement experience where skills and knowledge are applied to meet an authentic community-identified need. The experience will integrate meaningful community service with reflection. Through readings and discussions, critically reflect on the service in order to increase understanding of the discipline, gain a broader appreciation of the discipline, enhance a sense of civic responsibility, and strengthen connections with communities.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEADERSHIP",
  "course_number": "HORT 002",
  "credits": "0",
  "description": "Provides students with basic personal and interpersonal leadership skills that can be used within and outside of a work setting. Through practice, the leadership experience help students explore motivation, decision-making, time management, power, team building, conflict, ethics, dealing with change, communication skills, and diversity issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "UNDERGRADUATE RESEARCH",
  "course_number": "HORT 003",
  "credits": "0",
  "description": "Engage in research activities appropriate to the discipline; and through the research experience, acquire skills, techniques, and knowledge relevant to the field of study. In consultation with a faculty mentor, engage in research activity, and make and execute a plan for a project.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HORTICULTURAL SYSTEMS",
  "course_number": "HORT 112",
  "credits": "PRACTICES",
  "description": "Overview of horticultural systems and practices, with an emphasis on the Pacific Northwest. Exploration of career opportunities in horticulture. Includes viticulture, environmental landscaping, turf management, greenhouse and nursery production, farming, education, and research. Required field trips.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HEMP",
  "course_number": "HORT 120",
  "credits": "3",
  "description": "Introduces principles and latest research information on greenhouse and field crop production, phytochemistry, propagation, growing, harvesting, postharvest operations such as drying and extraction. Examines different types of hemp, history and products.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HORT 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HORT 199H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO ORGANIC AGRICULTURAL SYSTEMS",
  "course_number": "HORT 212",
  "credits": "4",
  "description": "An introduction to organic agricultural systems with a focus on history, regulations, principles and practices, performance, trends, and careers.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SOCIAL IMPACTS OF SCIENCE",
  "course_number": "HORT 217",
  "credits": "3",
  "description": "Contemporary societies provide funding for scientific research, at the same time they struggle with existing and emerging societal problems. This course will discuss how social problems can be addressed by science and technology, and how the impacts of research are quantified.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LANDSCAPE PLANT MATERIALS I: DECIDUOUS HARDWOODS AND CONIFERS",
  "course_number": "HORT 226",
  "credits": "4",
  "description": "Identification of trees, shrubs, vines, and ground covers used in landscape horticulture. Basic plant taxonomy, nomenclature, anatomy, and use of plants in the landscape. Diverse plant material covered with an emphasis on deciduous hardwoods and conifers.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LANDSCAPE PLANT MATERIALS II: SPRING FLOWERING TREES AND SHRUBS",
  "course_number": "HORT 228",
  "credits": "4",
  "description": "Identification of trees, shrubs, vines, and ground covers used in landscape horticulture. Basic plant taxonomy, nomenclature, anatomy, and use of plants in the landscape. Diverse plant material covered with an emphasis on spring flowering trees and shrubs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEMPERATE TREE FRUIT",
  "course_number": "HORT 251",
  "credits": "BERRIES",
  "description": "Covers fruit and nut crops for temperate zones. Emphasis placed on scientific and common names, plant adaptation, basic morphology, major cultivars, and markets. Offered alternate years.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HERBACEOUS ORNAMENTAL PLANT MATERIALS",
  "course_number": "HORT 255",
  "credits": "3",
  "description": "Identification and culture of herbaceous plants used in the landscape.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ORGANIC FARMING AND GARDENING",
  "course_number": "HORT 260",
  "credits": "3",
  "description": "Organic farming and gardening methods are discussed in class and practiced in the field. The philosophical background of organic farming as well as the biological, environmental and social factors involved in organic food production are covered. Emphasis is on hands-on application of scientific principles to create sustainable food production systems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO THERAPEUTIC HORTICULTURE",
  "course_number": "HORT 270",
  "credits": "3",
  "description": "Introduces the horticultural therapy profession. Provides an overview of program models for clinical and non-clinical settings. Explores working within an interdisciplinary treatment team in a healthcare setting. Covers basic medical terminology and core concepts of group therapy. Introduces community health and wellness connections, diversity, and stress reduction into the practice of therapeutic horticulture.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THERAPEUTIC HORTICULTURE TECHNIQUES AND ADAPTIVE STRATEGIES",
  "course_number": "HORT 271",
  "credits": "2",
  "description": "Covers the design and development of wellness activities associated with therapeutic horticulture gardens and programs incorporating indoor, outdoor, and seasonal adaptations, strategies, and techniques. Focuses on special needs populations in retirement and long term care communities, vocational and medical rehabilitation facilities, and developmental disabilities settings.",
  "prerequisites": ["HORT 270"]
}, {
  "corequisites": [],
  "course_name": "THERAPEUTIC HORTICULTURE SKILLS I",
  "course_number": "HORT 272",
  "credits": "2",
  "description": "Introduces therapeutic models and skills, task analysis of treatment issues, medical terminology, goal setting, activity planning, assessment, documentation and evaluation, and safety as applied in a therapeutic horticulture milieu. Covers professional and therapeutic topics including learning styles, motivational management, group dynamics, therapeutic use of self, counseling basics, roles within an interdisciplinary team, the leadership role of the therapist, professional ethics, and writing, listening and communication skills.",
  "prerequisites": ["HORT 271"]
}, {
  "corequisites": [],
  "course_name": "THERAPEUTIC HORTICULTURE PROGRAMMING",
  "course_number": "HORT 273",
  "credits": "2",
  "description": "Introduces therapeutic horticulture, human development, and intergenerational program models. Covers issues in aging, frailty, dementia, the continuum of care, assessment, documentation, and treatment planning. Includes thematic and seasonal planning; programming for children and seniors; case study writing; marketing and public relations; examples of therapeutic horticulture programs; and characteristics of therapeutic garden design and maintenance.",
  "prerequisites": ["HORT 272"]
}, {
  "corequisites": [],
  "course_name": "THERAPEUTIC HORTICULTURE SKILLS II",
  "course_number": "HORT 274",
  "credits": "2",
  "description": "Covers therapeutic and professional skills to work in pediatric, geriatric, developmental disabilities, psychiatric, and offender programs. Includes advanced skills in designing and evaluating 12-month therapeutic activities and programming for frail elderly, pediatric, developmentally disabled, neurologically impaired, and other special needs populations. Focuses on professional skill mastery and continuing education planning.",
  "prerequisites": ["HORT 273"]
}, {
  "corequisites": [],
  "course_name": "THERAPEUTIC GARDENS",
  "course_number": "HORT 275",
  "credits": "3",
  "description": "Focuses on the design, maintenance and programming of natural and horticultural therapeutic gardens. Includes working with an interdisciplinary team, garden assessment using therapeutic gardening standards, designing restorative settings, planning and conducting group and seasonal sessions, and sensory goals programming for dementia clients. Covers patio and strolling gardens for assisted living facility programs and special needs gardens.",
  "prerequisites": ["HORT 274", "HORT 380"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO URBAN AGRICULTURE",
  "course_number": "HORT 283",
  "credits": "3",
  "description": "Focuses on the adaption of agricultural principles to the urban environment, specifically the production of plant crops. Topics include: (I) urban environments and infrastructure, (II) urban crop production practices, (III) urban markets and farm management. Exposes students to the breadth of items that they should consider in order to be a successful urban grower.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PERMACULTURE DESIGN AND THEORY: CERTIFICATE COURSE",
  "course_number": "HORT 285",
  "credits": "4",
  "description": "Permaculture design course meets internationally recognized standards for certification. Lectures, hands-on activities, experiential learning, group discussions, readings, student projects and presentations. Two mandatory weekend days. Design intensive, utilizing graphic and verbal presentation skills. Research into other functioning permaculture systems through literature, websites, and as observed on field trips.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PERMACULTURE WATER MANAGEMENT",
  "course_number": "HORT 286",
  "credits": "4",
  "description": "Teaches assessment, mapping, and site designs for installing water retention landscapes using integrated water management strategies. Introduces assessment and analysis of rainwater runoff patterns and calculation of runoff quantities and water usage amounts. Teaches principles of water harvesting used to create functional site designs. Examines rainwater harvesting systems case study designs and teaches to identify both water and solar site resources. Creates an integrated permaculture site design based on design principles, water flow and quantity analysis, and overall site condition assessment. Covers rainwater harvesting cisterns, water harvesting earthworks, their integration with greywater treatment, passive solar design, and planning for vegetation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HORT 299",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HORT 299H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CROP PRODUCTION IN PACIFIC NORTHWEST AGROECOSYSTEMS",
  "course_number": "HORT 300",
  "credits": "4",
  "description": "Relation of crop production to human culture and the natural environment. Origins of agriculture and the processes of agricultural change, and productivity and sustainability of specific crop production systems in the Pacific Northwest. History, geography, resource requirements, and key challenges faced are presented. Fundamental crop production practices in relation to productivity and sustainability. CROSSLISTED as CROP 300/HORT 300.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GROWTH AND DEVELOPMENT OF HORTICULTURAL CROPS",
  "course_number": "HORT 301",
  "credits": "3",
  "description": "Gain fundamental knowledge of plant growth and development of horticultural crops from a micro- to macro-level starting at double fertilization through fruit growth--covering seed-to-seed. The last section specifically examines how environmental factors affect growth and development.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HORTICULTURAL PROJECTS",
  "course_number": "HORT 303",
  "credits": "2",
  "description": "Student-managed crop production projects with emphasis on container grown, greenhouse crops. Crop scheduling, propagation and planting, selecting temperature and lighting regimes, specifying growth regulator applications, nutrient management, irrigation management, pest monitoring, and problem diagnosis and correction.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INPUTS IN ORGANIC CROPPING SYSTEMS: SOURCING AND EFFICACY",
  "course_number": "HORT 306",
  "credits": "2",
  "description": "Applied course focused on the regulation, sourcing, and efficacy of organic inputs including soil amendments, fertilizers, and pesticides. Gain experience using science-, practice-, and regulation-based information to source and determine effectiveness of inputs in certified organic cropping systems.",
  "prerequisites": ["HORT 212", "CROP 355"]
}, {
  "corequisites": [],
  "course_name": "ORGANIC SYSTEM PREDICAMENTS",
  "course_number": "HORT 307",
  "credits": "3",
  "description": "Analyze controversial organic agriculture and systems issues while developing critical- and systems-thinking skills. Synthesis of information from diverse sources and application of scientific knowledge will be required to recommend possible solutions to real world organic agriculture predicaments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WEED MANAGEMENT IN ORGANIC CROPPING SYSTEMS",
  "course_number": "HORT 308",
  "credits": "3",
  "description": "Applied organic weed identification and management course. Learn real-world application of science-, practice-, and regulation-based weed management information while designing and evaluating organic weed management plans for certified organic farming systems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PLANT PROPAGATION",
  "course_number": "HORT 310",
  "credits": "3",
  "description": "Discusses horticultural and physiological principles of plant propagation, and explores the methods and techniques used for laboratory, nursery, greenhouse, orchards, and other agricultural environments. Focuses on the major issues facing plant propagators.",
  "prerequisites": ["HORT 301", "CROP 200"]
}, {
  "corequisites": [],
  "course_name": "PLANT PROPAGATION LABORATORY",
  "course_number": "HORT 312",
  "credits": "1",
  "description": "Conducts laboratory exercises to learn methods of plant propagation for a variety of plant types to maintain the appropriate level of genetic variation. Focuses on regeneration of plants from vegetative and reproductive tissues and organs, while maintaining their genetic potential. Explores the methods and techniques used for laboratory, nursery, greenhouse, orchards, and other agricultural environments to address some of the major issues facing plant propagators.",
  "prerequisites": ["HORT 310"]
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF TURFGRASS MAINTENANCE",
  "course_number": "HORT 314",
  "credits": "4",
  "description": "Identification and adaptation of common turfgrasses. Physiology of turfgrass growth and response to cultural and environmental stresses. Cultural practices including establishment, general maintenance, and pest control. Field trips required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SUSTAINABLE LANDSCAPES: MAINTENANCE",
  "course_number": "HORT 315",
  "credits": "CONSERVATION",
  "description": "Sustainable care and maintenance practices for non-turf landscape areas. Low input pruning, planting, fertilization, and pest control with an emphasis on IPM. Plant responses to stress, particularly those encountered in the urban environment. Outdoor labs required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PLANT NUTRITION",
  "course_number": "HORT 316",
  "credits": "4",
  "description": "Basic concepts and principles of plant mineral nutrition that provide a basis for solving practical nutritional problems in horticultural crops. Areas covered include mineral nutrients, nutrient availability in the soil and plant uptake, nutrient deficiencies and toxicities and their causes and remedies, and plant and soil analysis.",
  "prerequisites": ["CSS 205", "SOIL 205", "SOIL 205H"]
}, {
  "corequisites": [],
  "course_name": "^APPLIED ECOLOGY OF MANAGED ECOSYSTEMS",
  "course_number": "HORT 318",
  "credits": "3",
  "description": "Survey of ecological processes in managed ecosystems emphasizing ecological management techniques. Ecosystem services; biodiversity management; weed dynamics; agroecology; urban ecology; restoration and mitigation; landscape management. Field trip required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESTORATION HORTICULTURE",
  "course_number": "HORT 319",
  "credits": "3",
  "description": "As world population increases to some 9 billion plus by 2044, the importance of ecologically sound horticultural practices becomes increasingly apparent. Integration of ecological concepts and theory in management and development of created landscapes is critical for the preservation of many ecological services currently provided by undeveloped areas.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PESTS",
  "course_number": "HORT 330",
  "credits": "PLAGUES",
  "description": "Explores the interaction between humans and insects over the course of history up to the modern era. Examines the interaction of entomology with other aspects of society including agriculture, natural resources, engineering, public health, humanities, business, and geopolitics. Explores how entomology has been inextricably linked with, and contributes to, technological advancements by human society. Develops the ability to analyze relationships among science, technology, and society and to articulate critical perspectives on how those relationships have shaped human society. CROSSLISTED as ENT 300/HORT 330.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*POLLINATORS IN PERIL",
  "course_number": "HORT 331",
  "credits": "3",
  "description": "Pollinators, human influences on pollination systems, and the potential consequences of pollinator decline. An introduction to the skills needed to investigate media reports and multidisciplinary scientific research. Effects of pesticides, habitat fragmentation, climate change, invasive species, pests, pathogens, and other threats to pollinators in critical natural and agricultural systems around the world. CROSSLISTED as ENT 331/HORT 331.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSECT AND DISEASE MANAGEMENT IN ORGANIC CROPPING SYSTEMS",
  "course_number": "HORT 344",
  "credits": "3",
  "description": "Emphasizes basic concepts of applied entomology and plant pathology. Focuses on real-world application of science-, practice-, and regulation-based insect and disease management information in certified organic cropping systems. Designs and evaluates organic insect and disease management toolboxes and plans using the National Organic Program as a starting point as well as detailed farm case studies and research-based management information.",
  "prerequisites": ["BOT 220", "CROP 200", "HORT 301", "BI 211", "BI 211H", "BI 212", "BI 212H", "BI 213", "BI 213H", "BI 221", "BI 221H", "BI 222", "BI 222H", "BI 223", "BI 223H", "BI 204", "BI 205", "BI 206"]
}, {
  "corequisites": [],
  "course_name": "DIAGNOSING PLANT PROBLEMS",
  "course_number": "HORT 349",
  "credits": "3",
  "description": "Basic principles of problem diagnosis in crop, garden, and landscape plants are covered. Problems caused by cultural and environmental issues, plant diseases, insect pests, and other causes are addressed. Students will gain familiarity with resources for plant problem diagnosis.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "URBAN FORESTRY",
  "course_number": "HORT 350",
  "credits": "3",
  "description": "Introduction to principles and practices of planting and managing trees as a system of urban environment; understanding the economic, environmental, social aspects of urban forests, and an overview of contemporary land use issues and societal perspectives between people and plants. CROSSLISTED as FES 350/HORT 350.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FLORICULTURE AND GREENHOUSE SYSTEMS",
  "course_number": "HORT 351",
  "credits": "4",
  "description": "For students interested in growing plants in commercial or educational greenhouses. Actively explores the production and scheduling of floriculture crops for various markets. Combines the practical aspects of growing floral crops under environments created by traditional and technologically advanced greenhouses. Greenhouse structures and crop environment manipulation will be emphasized. Students actively manage a floriculture crop and are responsible for developing and implementing production schedules, and for making key decisions on the culture of diverse floral crops.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LANDSCAPE CONSTRUCTION TECHNIQUES",
  "course_number": "HORT 358",
  "credits": "4",
  "description": "Study of landscape construction process from initial site analysis to finished landscape. Techniques used in building hardscape and landscape areas. Field trips required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "IRRIGATION AND DRAINAGE",
  "course_number": "HORT 360",
  "credits": "4",
  "description": "Familiarizes students with the principles and practices of irrigation and drainage systems. Optimum use of water, irrigation and drainage system design, installation, repairs, and troubleshooting are emphasized.",
  "prerequisites": ["CSS 205", "SOIL 205", "SOIL 205H", "SOIL 206", "SOIL 206H", "FOR 206"]
}, {
  "corequisites": [],
  "course_name": "PLANT NURSERY SYSTEMS",
  "course_number": "HORT 361",
  "credits": "4",
  "description": "Covers how to grow shrubs and trees, and herbaceous annuals and perennials in nurseries for use in urban landscapes and managed ecosystems such as forestry and restoration. Plant nursery systems are diverse and require intensive management involving a dynamic decision making process. This course actively explores field and container production systems as well as the marketing of plants, an overview of plant growth regulation and post-production handling, the influence of efficient production practices on plant quality, integrating pest management strategies, and natural resource utilization.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SUSTAINABLE LANDSCAPE DESIGN",
  "course_number": "HORT 380",
  "credits": "3",
  "description": "The assessment of design problems/situations, the development of solutions and the communication of those solutions to the client through the design. Specific topics include designing for ecosystem maintenance/enhancement, introduction to computer-aided design (CAD), using color in landscape designs and rendering section/elevation views.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HORT 399",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "HORT 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "HORT 402",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "HORT 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "HORT 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "HORT 405H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS: DATA PRESENTATIONS",
  "course_number": "HORT 406",
  "credits": "1",
  "description": "For any student doing research, to learn to develop and evaluate poster and slide presentations containing scientific data. Students are exposed to a variety of scientific disciplines as they prepare and critique their own and other students' posters and oral presentations. Students improve written and oral communication skills. Letter grade is based on participation, improvement, and the quality of a final poster project and oral presentation. Offered winter term. CROSSLISTED as BRR 406/HORT 406.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "HORT 407",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "HORT 408",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "HORT 409",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "HORT 410",
  "credits": "1-12",
  "description": "Work internship to acquaint horticulture majors with the practices of the horticulture industry. Under direction of departmental internship committee. Requires approved statement of intent, submission of employer and employee evaluation forms and written report.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HORTICULTURE BOOK CLUB",
  "course_number": "HORT 411",
  "credits": "1",
  "description": "Reading and discussion of noteworthy books and associated topics relating to agriculture, society and the environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CAREER EXPLORATION: INTERNSHIPS AND RESEARCH PROJECTS",
  "course_number": "HORT 412",
  "credits": "1",
  "description": "Provides orientation to the horticulture major internship and research project requirement. Covers procedures for selecting, performing, and reporting on an internship or research project. Includes guidance and skill development valuable in the pursuit of horticultural career goals, such as cover letter and resume preparation and interviewing experience.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRECISION AGRICULTURE",
  "course_number": "HORT 414",
  "credits": "4",
  "description": "Provides insight into the technology available to support precision agriculture and data management planning applications. Examines the concepts and applications of precision agriculture to teach practical use of hardware, equipment and software. An overview of current technology including autonomous vehicles, GPS, soil and crop proximal sensors, imagery and mapping, variable rate control systems, and yield monitors. CROSSLISTED as CROP 414/HORT 414.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GOLF COURSE MAINTENANCE",
  "course_number": "HORT 418",
  "credits": "4",
  "description": "Basic aspects of golf course maintenance under temperate zone conditions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HERBS",
  "course_number": "HORT 421",
  "credits": "SPICES",
  "description": "Principles of crop ecology, morphology, chemistry and utilization of natural products of herbs, spices, and medicinal plants (HSMP). Examines the history and importance of HSMP, their historic and modern uses, current market trends, botany, collection in the wild, fundamentals of production systems for HSMP, harvesting, drying, and other postharvest operations, natural products and their uses, regulations and legal concerns of herbal products.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SYSTEMATICS AND ADAPTATION OF VEGETABLE CROPS",
  "course_number": "HORT 433",
  "credits": "4",
  "description": "Covers the botanical and taxonomic relationships, breeding systems and adaptation of vegetable crops. Fresh material is used to illustrate varietal differences and traits of importance. CROSSLISTED as CROP 433/HORT 433.",
  "prerequisites": ["BI 102", "BI 213", "BI 213H", "BI 223", "BI 223H", "BI 311", "BI 311H", "PBG 430", "PBG 450"]
}, {
  "corequisites": [],
  "course_name": "INSECT AGROECOLOGY",
  "course_number": "HORT 444",
  "credits": "3",
  "description": "Agroecology incorporates ecological concepts and principles to the design and management of sustainable agricultural systems. Topics include: the role of insects in sustainable agricultural systems; application of the principles of insect ecology to better manage insect pests and maximize crop yield; conserving beneficial insects and other natural resources in agroecosystems and the surrounding landscape. CROSSLISTED as ENT 444/HORT 444.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ARBORICULTURE",
  "course_number": "HORT 447",
  "credits": "4",
  "description": "The principles and practices of arboriculture, the art and science of selecting, planting, establishing and maintaining trees in urban, suburban, commercial and residential landscapes. CROSSLISTED as FES 447/HORT 447.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GRAPEVINE GROWTH AND PHYSIOLOGY",
  "course_number": "HORT 453",
  "credits": "3",
  "description": "The physiological aspects of grapevine growth and development including dormancy, flowering and fruit set, vegetative growth, fruit development and water relations. Additional topics include taxonomy, morphology and physiological influences of vineyard mesoclimate and vine microclimate.",
  "prerequisites": ["HORT 301"]
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES AND PRACTICES OF VINEYARD PRODUCTION",
  "course_number": "HORT 454",
  "credits": "3",
  "description": "The relationship of vineyard and canopy management to grapevine physiology and fruit quality. Nutrient/water relations within the soil/vine continuum. Vineyard microclimate, floor management, and pests will also be discussed.",
  "prerequisites": ["HORT 301"]
}, {
  "corequisites": [],
  "course_name": "URBAN FOREST PLANNING",
  "course_number": "HORT 455",
  "credits": "POLICY",
  "description": "Examination of planning, policy, and management strategies used in the stewardship of urban natural resources. Fundamentals for developing effective programs to maximize the economic, environmental, and social values and benefits of urban forest landscapes. CROSSLISTED as FES 455/HORT 455.",
  "prerequisites": ["FES 350", "HORT 350"]
}, {
  "corequisites": [],
  "course_name": "PHYSIOLOGY AND PRODUCTION OF BERRY CROPS",
  "course_number": "HORT 456",
  "credits": "4",
  "description": "Physiology and production systems of blueberries, red and black raspberries, blackberries, and other berry crops. Emphasis on plant growth and development; flower and fruit development; cultivars; pruning and training systems; irrigation; harvesting; nutrient management; and conventional and organic production systems.",
  "prerequisites": ["HORT 301"]
}, {
  "corequisites": [],
  "course_name": "SEED BIOLOGY",
  "course_number": "HORT 463",
  "credits": "3",
  "description": "Information about reproductive development of plants such as pollination and fertilization, which is important for the initiation of seed formation, will be provided. Embryo and endosperm development as well as accumulation of seed storage materials, which are major events during seed development, will be covered, as well as the dormancy and germination mechanisms in mature seeds. CROSSLISTED as CROP 463/HORT 463.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CASE STUDIES IN CROPPING SYSTEMS MANAGEMENT",
  "course_number": "HORT 480",
  "credits": "4",
  "description": "Analyzes decision cases involving the production of field and horticultural crops; individual and group activities; discussion of the decision-making process. CROSSLISTED as CROP 480/HORT 480.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DESIGN AND MANAGEMENT OF ORGANIC CROPPING SYSTEMS",
  "course_number": "HORT 482",
  "credits": "3",
  "description": "Iteratively design and evaluate organic farming system management plans. Apply real-world science-, practice-, and regulation-based information to the design and management of organic farming systems.",
  "prerequisites": ["HORT 212", "CROP 355", "HORT 306", "HORT 307", "HORT 308", "HORT 344", "SOIL 360"]
}, {
  "corequisites": [],
  "course_name": "CASE STUDIES IN URBAN AGRICULTURE",
  "course_number": "HORT 483",
  "credits": "3",
  "description": "Provides an overview of the diversity of endeavors that are available to potential urban agriculturists. These include urban and peri-urban farms (for profit and non-profit), community and school gardens, controlled climate facilities, rooftop farms and gardens, and more. For each case study, we will specifically examine: (1) the market where the farmer sells goods, (2) methods of achieving growth, particularly while avoiding debt, (3) increasing livelihood reliance upon on-farm income.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED PERMACULTURE DESIGN TOOLS FOR CLIMATE RESILIENCE",
  "course_number": "HORT 485",
  "credits": "3",
  "description": "Understand how permaculture as a design system can create sustainable human habitation that is beneficial to the natural world. Use tools specific to permaculture designers to assess, analyze, and project future climate scenarios and respond to them with appropriate design. Climate analogue identification and climate change forecasting provide the basis for a student assessment project that addresses current and future climatic conditions. Assessment and mapping assignments utilize Google Earth Pro, Google Docs, and Google Sheets.",
  "prerequisites": ["HORT 285"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HORT 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "HORT 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "HORT 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "HORT 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "HORT 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "HORT 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "HORT 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "HORT 509",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "HORT 510",
  "credits": "1-12",
  "description": "Offered via Ecampus only.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND EDUCATIONAL PERSPECTIVES IN HORTICULTURE",
  "course_number": "HORT 511",
  "credits": "2",
  "description": "Introduces beginning graduate students to the faculty in horticulture and provides an in-depth discussion of their research and education programs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CURRENT TOPICS IN ENTOMOLOGY",
  "course_number": "HORT 518",
  "credits": "2",
  "description": "Provides an advanced understanding of entomology and its relationship to other disciplines through critical analysis of the scientific literature. Practice synthesizing information and presenting findings to peers. Instructors, topics, and specific learning objectives vary from term to term. CROSSLISTED as ENT 518/HORT 518.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CURRENT TOPICS IN PLANT BREEDING AND GENETICS",
  "course_number": "HORT 519",
  "credits": "2",
  "description": "Provides an advanced understanding of plant breeding and genetics and their relationship to other disciplines through critical analysis of the scientific literature. Practice synthesizing information and presenting findings to peers. Instructors, topics, and specific learning objectives vary from term to term. CROSSLISTED as HORT 519/PBG 519.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CURRENT TOPICS IN HORTICULTURAL RESEARCH",
  "course_number": "HORT 520",
  "credits": "2",
  "description": "Provides an advanced understanding of horticulture science and its relationship to other disciplines through critical analysis of the scientific literature. Practice synthesizing information and presenting findings to peers. Instructors, topics and specific learning objectives vary from term to term.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HERBS",
  "course_number": "HORT 521",
  "credits": "SPICES",
  "description": "Principles of crop ecology, morphology, chemistry and utilization of natural products of herbs, spices, and medicinal plants (HSMP). Examines the history and importance of HSMP, their historic and modern uses, current market trends, botany, collection in the wild, fundamentals of production systems for HSMP, harvesting, drying, and other postharvest operations, natural products and their uses, regulations and legal concerns of herbal products.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SYSTEMATICS AND ADAPTATION OF VEGETABLE CROPS",
  "course_number": "HORT 533",
  "credits": "4",
  "description": "Covers the botanical and taxonomic relationships, breeding systems and adaptation of vegetable crops. Fresh material is used to illustrate varietal differences and traits of importance. CROP 533/HORT 533.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSECT AGROECOLOGY",
  "course_number": "HORT 544",
  "credits": "3",
  "description": "Agroecology incorporates ecological concepts and principles to the design and management of sustainable agricultural systems. Topics include: the role of insects in sustainable agricultural systems; application of the principles of insect ecology to better manage insect pests and maximize crop yield; conserving beneficial insects and other natural resources in agroecosystems and the surrounding landscape. CROSSLISTED as ENT 544/HORT 544.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ARBORICULTURE",
  "course_number": "HORT 547",
  "credits": "4",
  "description": "The principles and practices of arboriculture, the art and science of selecting, planting, establishing and maintaining trees in urban, suburban, commercial and residential landscapes. CROSSLISTED as FES 547/HORT 547.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "URBAN FOREST PLANNING",
  "course_number": "HORT 555",
  "credits": "POLICY",
  "description": "Examination of planning, policy, and management strategies used in the stewardship of urban natural resources. Fundamentals for developing effective programs to maximize the economic, environmental, and social values and benefits of urban forest landscapes. CROSSLISTED as FES 555/HORT 555.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHYSIOLOGY AND PRODUCTION OF BERRY CROPS",
  "course_number": "HORT 556",
  "credits": "4",
  "description": "Physiology and production systems of blueberries, red and black raspberries, blackberries, and other berry crops. Emphasis on plant growth and development; flower and fruit development; cultivars; pruning and training systems; irrigation; harvesting; nutrient management; and conventional and organic production systems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEED BIOLOGY",
  "course_number": "HORT 563",
  "credits": "3",
  "description": "Information about reproductive development of plants such as pollination and fertilization, which is important for the initiation of seed formation, will be provided. Embryo and endosperm development as well as accumulation of seed storage materials, which are major events during seed development, will be covered, as well as the dormancy and germination mechanisms in mature seeds. CROSSLISTED as CROP 563/HORT 563.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "VINEYARD OPERATIONS",
  "course_number": "HORT 573",
  "credits": "3",
  "description": "Examines operations lifecycle of a grape farm (vineyard) from the annual production cycle to the productive life of a vineyard from pre-development to termination. Emphasizes wine grape vineyards and links the annual and lifetime operations to winery production and marketing. Develops a solid understanding of the process timeline and inputs required in commercial vineyard production. Explores decision-making about vineyard development planning, planning for annual management practices, planning for in-season production, and practices that occur in the pre-planting, development, and management stages.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CASE STUDIES IN CROPPING SYSTEMS MANAGEMENT",
  "course_number": "HORT 580",
  "credits": "4",
  "description": "Analyzes decision cases involving the production of field and horticultural crops; individual and group activities; discussion of the decision-making process. CROSSLISTED as CROP 580/HORT 580.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HORT 599",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "HORT 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DISSERTATION",
  "course_number": "HORT 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING & CONFERENCE",
  "course_number": "HORT 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "HORT 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "HORT 607",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "HORT 608",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "HORT 699",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]