[{
  "corequisites": [],
  "course_name": "FOUNDATION LISTENING/SPEAKING",
  "course_number": "IEPA 002NC",
  "credits": "6",
  "description": "Engages students in activities that familiarize them with English pronunciation and conversation models. They learn to participate in basic conversations on everyday topics using formulaic expressions and understand and give basic instructions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TEST PREPARATION",
  "course_number": "IEPA 005NC",
  "credits": "3",
  "description": "Become familiar with the components and question types of standardized math (ALEKS), English language (IELTS), and graduate school examinations (varies by section). Learn test-taking strategies and focus on the language skills that are essential for success on the examinations. Graded P/N only. This course is Level 5 or above.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOUNDATION READING/VOCABULARY",
  "course_number": "IEPA 007NC",
  "credits": "6",
  "description": "Engages students in activities that familiarize them with the English alphabet and the most common sight words building up to sentence-level understanding. Extensive practice with activities designed to help students identify and scan for details in adapted materials.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOUNDATION WRITING/GRAMMAR",
  "course_number": "IEPA 009NC",
  "credits": "6",
  "description": "Engages students in activities that familiarize them with English spelling and writing conventions. They learn to write simple sentences with basic grammar for everyday purposes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACADEMIC LISTENING/SPEAKING 1",
  "course_number": "IEPA 011NC",
  "credits": "6",
  "description": "Development of basic listening and speaking skills. Extensive practice with activities designed to help students listen and respond to authentic and adapted texts about everyday topics and classroom language.",
  "prerequisites": ["IEPA 002NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC READING/VOCABULARY 1",
  "course_number": "IEPA 014NC",
  "credits": "6",
  "description": "Development of basic reading and vocabulary skills. Extensive practice with activities designed to help students read adapted texts about everyday topics.",
  "prerequisites": ["IEPA 007NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC WRITING/GRAMMAR 1",
  "course_number": "IEPA 018NC",
  "credits": "6",
  "description": "Development of forms and patterns of basic English grammar used in simple sentences and paragraphs. Extensive practice with activities designed to help students understand and produce grammatical structures necessary for achievement of Level 1 learning outcomes.",
  "prerequisites": ["IEPA 009NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC LISTENING/SPEAKING 2",
  "course_number": "IEPA 021NC",
  "credits": "6",
  "description": "Development of listening and speaking skills with a movement beyond the basic level. Extensive practice with activities designed to help students comprehend longer listening texts on a wider range of topics and improve conversational skills.",
  "prerequisites": ["IEPA 011NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC READING/VOCABULARY 2",
  "course_number": "IEPA 024NC",
  "credits": "6",
  "description": "Development of reading and vocabulary skills with a movement beyond the basic level. Extensive practice with activities designed to help students comprehend longer texts on a wider range of topics.",
  "prerequisites": ["IEPA 014NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC WRITING/GRAMMAR 2",
  "course_number": "IEPA 028NC",
  "credits": "6",
  "description": "Development of forms and patterns of English grammar used in paragraphs and compositions. Extensive practice with activities designed to help students understand and produce grammatical structures necessary for achievement of Level 2 learning outcomes.",
  "prerequisites": ["IEPA 018NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC LISTENING/SPEAKING 3",
  "course_number": "IEPA 031NC",
  "credits": "6",
  "description": "Development of listening and speaking skills with a movement toward academic tasks and projects at Level 3. Extensive practice in longer and more varied listening with a focus on developing listening and note taking strategies in addition to presentational skills.",
  "prerequisites": ["IEPA 021NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC READING/VOCABULARY 3",
  "course_number": "IEPA 034NC",
  "credits": "6",
  "description": "Development of reading and vocabulary skills with a movement toward academic tasks at Level 3. Extensive practice in longer and more varied reading with a focus on developing reading and vocabulary acquisition strategies.",
  "prerequisites": ["IEPA 024NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC WRITING/GRAMMAR 3",
  "course_number": "IEPA 038NC",
  "credits": "6",
  "description": "Development of writing and grammar skills with a movement toward academic tasks and projects at Level 3. Extensive practice with activities designed to help students develop syntax and composition skills.",
  "prerequisites": ["IEPA 028NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC LISTENING/SPEAKING 4",
  "course_number": "IEPA 041NC",
  "credits": "6",
  "description": "Further development of academic listening and speaking skills with a strong emphasis on critical thinking in the listening of lengthier, more complex listenings appropriate to Level 4. Extensive practice in listening and note taking to adapted lectures as well as discussions and presentations in small and large groups.",
  "prerequisites": ["IEPA 031NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC READING/VOCABULARY 4",
  "course_number": "IEPA 044NC",
  "credits": "6",
  "description": "Further development of reading and vocabulary skills with a strong emphasis on critical thinking in the reading of lengthier, more complex material appropriate to Level 4. Extensive practice on developing reading fluency and vocabulary acquisition strategies.",
  "prerequisites": ["IEPA 034NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC WRITING/GRAMMAR 4",
  "course_number": "IEPA 048NC",
  "credits": "6",
  "description": "Development of formal, academic writing skills including researching, analyzing and organizing the standard academic essay, using paraphrases, summaries, and quotations at Level 4. Introduction of the concept of intellectual property and referencing. Extensive practice with activities designed to help students develop more complex sentences appropriate to academic writing.",
  "prerequisites": ["IEPA 038NC"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "IEPA 049NC",
  "credits": "3",
  "description": "Topics may include English Through Photography, English Through Movies, The World of Video Games, English Through Drama, Critical Listening and Speaking, News and Views, Intermediate Vocabulary Building, English for Engineers, Academic Success, English for Business, INTO Adventure. All sections open to Level 4 and above.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACADEMIC READING/WRITING 5",
  "course_number": "IEPA 050NC",
  "credits": "6",
  "description": "Primary focus on more sophisticated development and greater accuracy in writing essays and research papers, with accountability for sources of information at Level 5. Introduction of authentic college-level material to be read with increasingly discriminating ability, including an expanding awareness of opposing viewpoints.",
  "prerequisites": ["IEPA 044NC", "IEPA 048NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC LISTENING/SPEAKING 5",
  "course_number": "IEPA 051NC",
  "credits": "6",
  "description": "Primary focus on developing listening and speaking skills for use in an academic context at Level 5. Assignments include researched expository and persuasive class presentations. Emphasis is on developing note-taking skills using authentic lectures at normal speed and on listening to guest speakers.",
  "prerequisites": ["IEPA 041NC"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED GRAMMAR THROUGH WRITING",
  "course_number": "IEPA 057NC",
  "credits": "3",
  "description": "Increase the ability to recognize and use correct advanced grammar structures at Level 5 or 6. Develop increased fluency and accuracy in writing. Practice and perfect more complex grammatical structures, particularly those used frequently in university-level writing. May be taken for two consecutive terms. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "IEPA 059NC",
  "credits": "3",
  "description": "Topics may include Advanced Vocabulary Building, Creative Nonfiction, English Through History, Critical Thinking Through Reading and Writing, Critical Thinking Through Listening and Speaking, English for Business, All About Oregon. All sections open to Level 5 or 6.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACADEMIC READING/WRITING 6",
  "course_number": "IEPA 060NC",
  "credits": "6",
  "description": "Development of reading and writing skills and strategies at Level 6 to prepare students for reading tasks based on academic content as encountered in university classes. Focused on skills such as analyzing, synthesizing, evaluating and critical thinking. Emphasis on skills required to produce a university-level research paper. Work focuses on writing critical reactions to readings, summarizing and paraphrasing. Evaluation and synthesis of information from a variety of sources, including library and online resources.",
  "prerequisites": ["IEPA 050NC"]
}, {
  "corequisites": [],
  "course_name": "ACADEMIC LISTENING/SPEAKING 6",
  "course_number": "IEPA 061NC",
  "credits": "6",
  "description": "Focus on comprehending university-level material at Level 6. Note-taking skills are enhanced through a variety of listening activities including lectures. Students learn to analyze, synthesize, evaluate and respond to information through class discussions and oral reports. Emphasis on improving ability to demonstrate competent presentation skills for use in an undergraduate or graduate setting. Focus on incorporating outside sources from library and online research into presentations. Activities include group discussion, presentations, fluency exercises and practice developing compensatory strategies. Strong focus on self-evaluation and peer critique.",
  "prerequisites": ["IEPA 051NC"]
}, {
  "corequisites": [],
  "course_name": "COMMUNICATION FOR IGTAs",
  "course_number": "IEPA 098NC",
  "credits": "3",
  "description": "Enhance communication with American university students by practicing the skills IGTAs need to deliver materials in their fields: pronunciation, presentation skills and intercultural communication. Make presentations applying the language and communication skills learned in class. An independent panel of students and faculty evaluate the final presentations.",
  "prerequisites": []
}]