[{
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "IEPG 029NC",
  "credits": "3,6",
  "description": "ST/ENGLISH THROUGH ANIMATION (6): Develops the ability to understand authentic spoken English. By watching animated popular TV segments, students will learn to understand English as it is really spoken. In addition to developing listening skills, students develop their speaking ability, expand their vocabulary base, and deepen their understanding of culture in the U.S. and in the countries of classmates. Conversation and speaking will be emphasized through the use of dialogue. Graded P/N. ST/ENGLISH THROUGH MUSIC (6): Course focus is on strengthening listening and idiomatic vocabulary skills through music in English. Goals of vocabulary activities with song lyrics include increasing students' knowledge of idiomatic, slang, and cultural expressions, as well as how more common, familiar words are used in expressive, poetic, and unique ways. English through Music will significantly enhance and strengthen students' listening skills through a variety of activities. Graded P/N. ST/ENGLISH FOR TOURISM (6): Learn vocabulary and commonly spoken English for working in the tourism industry and for traveling. Prepare to manage a restaurant, work for an airline, give tours or share the history and culture of your country with others. Graded P/N. ST/ENGLISH FOR PROFESSIONAL SUCCESS (6): Students learn the conventions of business and professional demonstrations. Focus is on specialized vocabulary for communicating professional information clearly and fluently. Students practice creating job resumes and cover letters, as well as hold mock interviews and business conferences. Graded P/N. ST/GLORIOUS FOOD (3): Course focuses on the vocabulary of cooking and food preparation. Primary emphasis is on cross-cultural communication. Students share culinary traditions from their home countries and learn about American food culture. Students present on traditional foods and diets. Class discussions also involve conversations about nutrition, healthy, and unhealthy eating. Graded P/N. ST/PRESENT YOURSELF (6): Focuses on learning the necessary skills in for giving effective presentations on a range of topics in a variety of situations. Graded P/N. ST/AMERICAN UNIVERSITY CULTURE (6): Focuses on helping students adapt to university culture. Students learn and practice everyday language used on a college campus, explore cultural differences in communication, and learn about services and programs available on and near campus. Graded P/N. ST/SPELLING (3): Focuses on fundamental rules for correct spelling. Students learn and practice rules to help them improve spelling, learn spelling rules about consonant and vowel sounds, and understand links between pronunciation and spelling. In addition, students practice computer skills to improve writing. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "IEPG 039NC",
  "credits": "6",
  "description": "ST/ENGLISH THROUGH MOVIES (6): Designed to explore culture and English language through the careful viewing of major motion pictures. Using theme-related background material and vocabulary, students enhance their appreciation of movies from various genres. Comprehension tasks aid in deepening understanding of characters, plot actions, and themes. Classroom activities also include opportunities for small group and class discussion. ST/FANFICTION (6): Explore an important movie or short novel/short story. Develop comprehension skills, vocabulary and grammar structures while learning about the culture of the story. Then use the story as a base to write original fiction by practicing writing structures and literary elements important in creative writing. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "IEPG 049NC",
  "credits": "6",
  "description": "ST/ALL ABOUT OREGON (6): Introduces students to the diversity of Oregon culture, geography, geology, history and folklore. The course is both content based, teaching general information about Oregon, and language focused, with an emphasis on content-related vocabulary, listening strategies and reading skills. Students are encouraged to actively participate in learning by taking a field trip to a relevant site of interest. ST/ENGLISH THROUGH POPULAR SCIENCE CULTURE (6): Designed to develop skills in reading, writing, listening, and speaking through current scientific discoveries and innovations. Insights learned from recent advances in science will provide practical knowledge for the workplace environment and relevant relational dynamics. Graded P/N. ST/AMERICAN STUDIES (6): Introduces students to the culture and history of America through diverse readings, videos, audio recordings, and first-hand experiences. Skill emphases include vocabulary acquisition and reading comprehension. Students create presentations to share what they learn about American traditions and customs. Class discussions explore the culture and history of the United States and its international relations with students' home countries. Graded P/N. ST/OUTDOOR PURSUITS (6): Designed to develop skills in reading, writing, listening, and speaking through interaction with common outdoor activities. Learn about how to live a healthy and environmentally aware lifestyle from insights from local experts in the university and local community. Graded P/N. ST/STRATEGIES FOR INTERPERSONAL COMMUNICATION (6): Develops the necessary skills for effective communication in small groups. This course will help students learn helpful language for collaborating with a team, provides strategies for navigating complicated discussions, and builds confidence in communication in English. Graded P/N. ST/CROSS-CULTURAL COMMUNICATION (6): Explore what culture is, what influences it, and how it affects the way people understand the world and communicate with others. Students learn about American culture, behaviors, norms, and values, and those of their classmates by comparing them to each other through a variety of interactive activities. Students have the opportunity to share a classroom with American university students. Graded P/N. ST/IT'S NEWS TO ME (6): Course focuses on reading and vocabulary comprehension skills and conversation skills through the use of adapted and authentic news media sources, including print newspapers, news radio, and news video. Students become familiar with the conventions of journalistic writing and learn about the structure of English language newspapers. Activities include reading comprehension tasks, analysis of news stories, presentations, and creating a class newspaper. ST/BUSINESS VOCABULARY BUILDING (6): Course focuses on improving the use of business English vocabulary and idioms. Students learn and apply a variety of authentic words from the text, in-class activities, and assigned practice to help them communicate more effectively in a business context. The course focuses on both acquisition of targeted vocabulary and strategies for decoding and retention. Graded P/N. ST/ENGLISH THROUGH PHOTOGRAPHY (6): Focuses on improving English language skills through reading, listening and speaking about photography and by actually taking and showing photographs. Students will spend time outside of class to take pictures and then talk about the pictures in class. Presentations will be given about one's own photographs. Graded P/N. ST/ENGLISH THROUGH VOLUNTEERING (6): English and critical thinking skills are developed by exploring social and environmental issues in class and then by putting that knowledge into action by volunteering for community organizations. In the classroom, English skills are developed through discussions, reading, writing, and listening to people talk about the issues. The students will then go out into the community with the class to do meaningful volunteer activities, such as helping to build a house and grow vegetables for needy families (Session 1) or sharing one's culture and talents with children and seniors (Session 2). Graded P/N.",
  "prerequisites": []
}]