[{
  "corequisites": [],
  "course_name": "FIRST-YEAR KOREAN",
  "course_number": "KOR 111",
  "credits": "4",
  "description": "For students with no prior training in Korean. Basic language skills along with cultural understanding by introducing the history of Hangul, traditional holidays, games, songs, foods and drama. Provides the Korean alphabet (Hangul), basic vocabulary, grammar, listening, speaking, reading, and writing skills. Three areas of focus: (1) reading and writing the Korean alphabet; (2) basic colloquial expressions; and (3) cultural understanding.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FIRST-YEAR KOREAN",
  "course_number": "KOR 112",
  "credits": "4",
  "description": "Basic language skills along with cultural understanding by introducing the history of Hangul, traditional holidays, games, songs, foods and drama. Provides the Korean alphabet (Hangul), basic vocabulary, grammar, listening, speaking, reading, and writing skills. Three areas of concentration: (1) reading and writing the Korean alphabet, (2) basic colloquial expressions, and (3) cultural understanding.",
  "prerequisites": [["KOR 111"]]
}, {
  "corequisites": [],
  "course_name": "FIRST-YEAR KOREAN",
  "course_number": "KOR 113",
  "credits": "4",
  "description": "Designed to increase fluency in listening, speaking, reading and writing skills through various topics that are relevant to students' life; sports, health, experiences, housing. Enlarge vocabulary and knowledge of grammar and sentence structure with honorifics, adjectives, connectives, and comparatives. Discuss Korean culture and literature using folk tales.",
  "prerequisites": [["KOR 112"]]
}, {
  "corequisites": [],
  "course_name": "SECOND-YEAR KOREAN",
  "course_number": "KOR 211",
  "credits": "4",
  "description": "Designed to increase fluency in listening, speaking, reading, and writing skills through pragmatic topics necessary for survival in the target language culture. Topic-based lessons consist of model dialogues, narration, vocabulary, grammar and culture corresponding to the level of intermediate low (ACTFL).",
  "prerequisites": [["KOR 113"]]
}, {
  "corequisites": [],
  "course_name": "SECOND-YEAR KOREAN",
  "course_number": "KOR 212",
  "credits": "4",
  "description": "Designed to increase fluency in listening, speaking, reading, and writing skills through pragmatic topics necessary for survival in the target language culture. Topic-based lessons consist of model dialogues, narration, vocabulary, grammar, and culture corresponding to the level of Intermediate Mid (ACTFL). Students learn to describe favorite activities, feelings, foods, restaurants, fashions, colors, and physical appearances. Students also learn to engage in a conversation as well as to write compositions related to daily life, making recommendations, asking for and giving directions, making a telephone call, and writing a recipe.",
  "prerequisites": [["KOR 211"]]
}, {
  "corequisites": [],
  "course_name": "SECOND-YEAR KOREAN",
  "course_number": "KOR 213",
  "credits": "4",
  "description": "Designed to increase fluency in integrated language skills through pragmatic topics necessary for survival in target language culture. Topic-based lesson consists of model dialogues, narration, vocabulary, grammar and culture corresponding to the intermediate high level. Students will learn to speak in paragraph length conversations; write compositions related to their daily lives, and such social needs as giving suggestions, making appointments and plans, giving descriptions and excuses, asking for and giving advice for a job interview. Visual media makes learning more fun and authentic. Students are required to participate in face-to-face meetings on a regular basis with a weekly partner and the instructor.",
  "prerequisites": [["KOR 212"]]
}]