[{
  "corequisites": [],
  "course_name": "HUMANS AND THE OCEAN",
  "course_number": "MAST 201",
  "credits": "3",
  "description": "An introduction to marine systems and the history of humans’ interaction with the ocean from a unique literary perspective. Lectures, group and individual library research, fieldtrips, and assignments will collate approaches from a range of disciplines including marine science, history, literary study, and other arts and humanistic disciplines. Through fiction and non-fiction literary perspectives designed to enhance critical reading skills, learn about historic and contemporary ocean and coastal issues, such as sustainable fisheries, pollution, and climate change, with perspectives from faculty in the humanities, arts, and sciences.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIETY",
  "course_number": "MAST 300",
  "credits": "CULTURE",
  "description": "Explore the dynamic relationship between people and the marine environment, as it relates to different ways of studying change. Emphasis is on liberal arts approaches from the social sciences, arts, and humanities. Applies theoretical foundations and associated methodological approaches from these liberal arts disciplines to understand and study issues of the coasts and ocean.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "MAST 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MARINE STUDIES INTERNSHIP",
  "course_number": "MAST 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MARINE STUDIES DEGREE CAPSTONE",
  "course_number": "MAST 425",
  "credits": "4",
  "description": "Examines issues related to the ocean and coasts through a transdisciplinary process recognizing insights from multiple perspectives and disciplines. Integrates the varied content explored in the Marine Studies Major through engagement in a substantial research or creative project evidencing intensive study of the social, political, historical, and/or cultural issues of the ocean and coasts.",
  "prerequisites": [["MAST 300"]]
}, {
  "corequisites": [],
  "course_name": "^WRITING FOR MARINE STUDIES",
  "course_number": "MAST 444",
  "credits": "4",
  "description": "Applies techniques, ethics, and methodologies of writing and research in the transdisciplinary field of Marine Studies. Produces an artifact summing up the work throughout the degree and a written narration of this artifact. Presents the project findings and/or expressions to a broad audience at a Marine Studies student conference.",
  "prerequisites": [["MAST 201"], ["MAST 300"]]
}]