[{
  "corequisites": [],
  "course_name": "INTRODUCTION TO MATERIALS SCIENCE",
  "course_number": "MATS 321",
  "credits": "4",
  "description": "Crystal structure, microstructure, and physical properties of metals, ceramics, polymers, composites, and amorphous materials. Also includes elementary mechanical behavior and phase equilibria.",
  "prerequisites": [["CH 202", "CH 222", "CH 232", "CH 232H", "CH 224H"]]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO MATERIALS SCIENCE",
  "course_number": "MATS 321H",
  "credits": "4",
  "description": "Crystal structure, microstructure, and physical properties of metals, ceramics, polymers, composites, and amorphous materials. Also includes elementary mechanical behavior and phase equilibria.",
  "prerequisites": [["CH 202", "CH 222", "CH 232", "CH 232H", "CH 224H"]]
}, {
  "corequisites": [],
  "course_name": "MECHANICAL PROPERTIES OF MATERIALS",
  "course_number": "MATS 322",
  "credits": "4",
  "description": "Examines mechanical behavior of materials, relating laboratory test results to material structure and elements of mechanical analysis.",
  "prerequisites": [["MATS 321", "MATS 321H", "ENGR 321", "ENGR 321H"]]
}, {
  "corequisites": [],
  "course_name": "THERMODYNAMICS OF MATERIALS",
  "course_number": "MATS 413",
  "credits": "4",
  "description": "Explores the statistical interpretation of entropy, heat capacity, enthalpy of condensed phases, solution thermodynamics, liquid-solid and solid-solid phase equilibria. Considers the principles of thermodynamics governing phase stability with a focus on liquid-solid and solid-solid equilibria, and phase stability in two-component systems. Examines the relationship of Gibbs free energy to phase stability.",
  "prerequisites": [["MATS 321", "MATS 321H"]]
}, {
  "corequisites": [],
  "course_name": "PHYSICAL METALLURGY",
  "course_number": "MATS 441",
  "credits": "3",
  "description": "Introduction to properties of metals and alloys including solidification, diffusion, solid solutions, intermediate phases, annealing, heat treatment and phase transformation with a focus on ferrous and non-ferrous metal systems. Identifies relationships between material composition, structure, and properties resulting from synthesis, processing or service. Explores the knowledge of ferrous and non-ferrous alloy systems and their significant metallurgical properties and applications.",
  "prerequisites": [["MATS 321"]]
}, {
  "corequisites": [],
  "course_name": "WELDING METALLURGY",
  "course_number": "MATS 445",
  "credits": "4",
  "description": "Theory-based course focused on the metallurgy of welds. Topics covered include welding/joining processes, heat input, diffusion, solidification, phase transformation, materials compatibility and welding defects. This is NOT a practical welding class.",
  "prerequisites": [["MATS 321", "ENGR 321", "ENGR 321H"]]
}, {
  "corequisites": [],
  "course_name": "THIN FILM MATERIALS CHARACTERIZATION AND PROPERTIES",
  "course_number": "MATS 478",
  "credits": "4",
  "description": "Processing of thin films and characterization of the microstructure; diffusion and solid state reactions; mechanical, magnetic and electronic properties of thin films.",
  "prerequisites": [["ME 311", "ME 311H", "NSE 311", "NSE 311H"], ["ENGR 321", "ENGR 321H", "MATS 321", "MATS 321H"], ["ENGR 322", "MATS 322"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "MATS 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "MATS 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "MATS 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "MATS 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WELDING METALLURGY",
  "course_number": "MATS 545",
  "credits": "4",
  "description": "Theory-based course focused on the metallurgy of welds. Topics covered include welding/joining processes, heat input, diffusion, solidification, phase transformation, materials compatibility and welding defects. This is NOT a practical welding class.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EXPERIMENTAL TECHNIQUES IN MATERIAL SCIENCE",
  "course_number": "MATS 555",
  "credits": "4",
  "description": "Materials processing, characterization, computational and data analysis techniques in materials science. Focus on processing-structure-property relationships.",
  "prerequisites": [["MATS 570"]]
}, {
  "corequisites": [],
  "course_name": "STRUCTURE-PROPERTY RELATIONS IN MATERIALS",
  "course_number": "MATS 570",
  "credits": "4",
  "description": "Fundamentals of the interactions between the structure and properties of materials. Atomic bonding and atom interactions. Geometric and algebraic representations of symmetry. Introduction to phase equilibria. Phenomenological background of elasticity and plasticity in materials. Anisotropic materials and tensor representations. Influence of structure on thermal, electrical, and optical properties of materials.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELECTRONIC PROPERTIES OF MATERIALS",
  "course_number": "MATS 571",
  "credits": "4",
  "description": "Development of a quantitative description of the electronic structure of solids starting with the quantum mechanical model of the atom, atomic bonding, and band theory of solids. Quantitative description of the electronic properties of metals, semiconductors, and insulators.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THIN FILM MATERIALS CHARACTERIZATION AND PROPERTIES",
  "course_number": "MATS 578",
  "credits": "4",
  "description": "Processing of thin films and characterization of the microstructure; diffusion and solid state reactions; mechanical, magnetic and electronic properties of thin films.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THERMODYNAMICS OF SOLIDS",
  "course_number": "MATS 581",
  "credits": "4",
  "description": "Thermodynamics of solutions and phase equilibrium. Phase diagrams and invariant reactions. Order and disorder in solutions. Applications to advanced materials development. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RATE PROCESSES IN MATERIALS",
  "course_number": "MATS 582",
  "credits": "3",
  "description": "Diffusion in solids, including vacancy and interstitial and short-circuit diffusion. Phase transformations including classic nucleation and growth theory. Applications to materials development.",
  "prerequisites": [["MATS 581", "ME 581"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED FRACTURE OF MATERIALS",
  "course_number": "MATS 584",
  "credits": "4",
  "description": "Fracture mechanics will be used as a basis for predicting failure of materials, understanding failure mechanisms, and identifying causes of failure. Course will include discussion of recent journal articles, experimental demonstrations, and analysis of real fracture data.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DISLOCATIONS",
  "course_number": "MATS 587",
  "credits": "DEFORMATION",
  "description": "The effects of point, line, and planar defects on plastic deformation and creep behavior in solids will be discussed with emphasis on the role of dislocations and vacancies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPUTATIONAL METHODS IN MATERIALS SCIENCE",
  "course_number": "MATS 588",
  "credits": "4",
  "description": "A broad introduction to important materials science simulation methods. These include molecular dynamics, density functional theory, and Monte Carlo methods. Learning is through a mixture of lecture and hands-on lab projects in which students use computational methods to explore and reinforce fundamental concepts in materials science. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "MATS 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "MATS 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MATERIALS AND SURFACE CHARACTERIZATION",
  "course_number": "MATS 625",
  "credits": "3",
  "description": "Covers scientific principles of surface and structural characterization techniques. Explores methods to study both macro- and nano-scale properties. Emphasizes surface and interfacial analysis of metals, semiconductors, and dielectric materials. Applies basic knowledge of chemistry, physics, and engineering to understand scientific fundamentals and operating principles of spectroscopy and microscopy-based techniques. Covers a range of experimental methods for determining surface structure, elemental composition, and chemical states. Topics including X-ray photoelectron spectroscopy, Auger electron spectroscopy, X-ray absorption spectroscopy, low energy electron diffraction, scanning tunneling microscopy, low energy ion scattering, and ultraviolet photoelectron spectroscopy. CROSSLISTED as CH 625/CHE 625/MATS 625/PH 625.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF TRANSMISSION ELECTRON MICROSCOPY",
  "course_number": "MATS 659",
  "credits": "4",
  "description": "This lecture-only course covers basic principles of transmission electron microscopy (TEM) including instrument components, electron optics, electron diffraction, and the origins and interpretation of image contrast. Spectroscopic techniques are covered, but diffraction and imaging techniques are emphasized. Coverage of experimental techniques will focus on those useful for addressing problems in materials science.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELECTRONIC PROPERTIES OF OXIDES",
  "course_number": "MATS 671",
  "credits": "3",
  "description": "Emphasizes band theory of solids applied to metal oxide materials. Reviews metallic oxides, non-stoichiometric semiconductors and associated defect chemistry, electrostatics, linear dielectrics, non-linear dielectrics, electromechanical phenomena including piezoelectricity, and the optical properties of oxides.",
  "prerequisites": []
}]