[{
  "corequisites": [],
  "course_name": "INTRODUCTION TO MECHATRONICS",
  "course_number": "MFGE 241",
  "credits": "4",
  "description": "Explores the fundamentals of mechatronics: electronic circuits, tools, and basic sensors/actuators commonly used in the manufacturing process monitoring. Examines the operation and use of these instruments and tools for mechatronics design and prototyping. Examines the fundamentals of five types of sensors: distance, movement, proximity, stress/strain, and temperature, with a focus on the mathematical modeling of the sensors when they are embedded in a mechanical system. Apply basic programming in LabVIEW software to support the operation of data sampling through a data acquisition card. Integrate mechanical design with electronics controlled by a computer in an open loop fashion in the lab.",
  "prerequisites": ["ENGR 201", "ENGR 201H"]
}, {
  "corequisites": [],
  "course_name": "PRODUCTION ENGINEERING",
  "course_number": "MFGE 336",
  "credits": "4",
  "description": "Provides a general understanding of the production engineering function within industry and the means by which to achieve tight tolerances through machining. Introduces geometric dimensioning and tolerancing, fixture and gage design, and fundamentals of metal cutting mechanics, and explores their interactions.",
  "prerequisites": ["ENGR 213", "ENGR 213H", "ENGR 248", "MATS 321", "MATS 321H"]
}, {
  "corequisites": [],
  "course_name": "PRODUCTION ENGINEERING",
  "course_number": "MFGE 336H",
  "credits": "4",
  "description": "Provides a general understanding of the production engineering function within industry and the means by which to achieve tight tolerances through machining. Introduces geometric dimensioning and tolerancing, fixture and gage design, and fundamentals of metal cutting mechanics, and explores their interactions.",
  "prerequisites": ["ENGR 213", "ENGR 213H", "ENGR 248", "MATS 321", "MATS 321H"]
}, {
  "corequisites": [],
  "course_name": "MATERIALS AND MANUFACTURING PROCESSES",
  "course_number": "MFGE 337",
  "credits": "4",
  "description": "Introduces mechanical manufacturing methods by which materials are economically shaped into valuable products. Explores how the functionality, shape, materials, cost, and sustainability of a product influence manufacturing process selection and design.",
  "prerequisites": ["MATS 321", "MATS 321H"]
}, {
  "corequisites": [],
  "course_name": "LOGICAL CONTROL FOR MECHATRONICS SYSTEMS",
  "course_number": "MFGE 341",
  "credits": "4",
  "description": "Explore embedded software and hardware infrastructures used in mechatronics systems. Examine binary number and Boolean algebra using AND, OR, and XOR operators in microcontroller-controlled systems, and flip-flops and other basic components that realize binary control functions. Explore the working principles of AVR microcontroller systems, including the internal structure of clock timers, memory space, and IO addresses. Implement basic microcontroller operations using Assembly language. Demonstrate functions such as open loop control and wired/wireless communication in labs by programming a commercial microcontroller platform with assembly language.",
  "prerequisites": ["MFGE 241", "ME 351", "ENGR 201", "ENGR 201H", "ENGR 202"]
}, {
  "corequisites": [],
  "course_name": "COMPUTER AIDED DESIGN AND MANUFACTURING",
  "course_number": "MFGE 413",
  "credits": "4",
  "description": "Introduces students to the application of computer aided engineering tools across the extended product design and manufacturing cycle. Students become familiar with new product development and working in a sustaining engineering environment with an emphasis on using computer-aided design (CAD) and computer-aided manufacturing (CAM) tools to gain competitive advantage.",
  "prerequisites": ["ENGR 248", "IE 366", "ME 382", "ME 382H"]
}, {
  "corequisites": [],
  "course_name": "LEAN MANUFACTURING SYSTEMS ENGINEERING",
  "course_number": "MFGE 436",
  "credits": "4",
  "description": "Emphasizes the design, implementation, evaluation, and control of manufacturing systems, and the integration of lean manufacturing theory and methods. Examines manufacturing processes/equipment and systems, e.g., manufacturing system design, production planning/control, and inventory/resource management.",
  "prerequisites": ["ENGR 390"]
}, {
  "corequisites": [],
  "course_name": "COMPUTER CONTROL OF MANUFACTURING PROCESSES",
  "course_number": "MFGE 437",
  "credits": "4",
  "description": "Introduces fundamental knowledge in the automation of manufacturing systems and processes. Analyzes automated manufacturing system design and operations--computer numerical control (CNC) technology; NC part programming; sensors and actuators, their modeling and dynamic simulation; feedback motion delivery systems design and tuning; programmable logic controls (PLC) for industrial control systems, and path planning for numerical controlled (NC) machinery.",
  "prerequisites": ["ME 217", "MFGE 336", "MFGE 336H"]
}, {
  "corequisites": [],
  "course_name": "COMPOSITES MANUFACTURING",
  "course_number": "MFGE 438",
  "credits": "4",
  "description": "Introduction to fiber-reinforced composite materials and their applications. Topics include matrices and reinforcement; open and closed molding processes; filament winding, quality, testing, damage assessment; basics of factory operations and sustainability of composites. Students will complete laboratory projects using fiber-reinforced laminates. Lec/lab.",
  "prerequisites": ["ENGR 213", "ENGR 213H"]
}, {
  "corequisites": [],
  "course_name": "DIGITAL CONTROL OF MECHATRONICS SYSTEMS",
  "course_number": "MFGE 441",
  "credits": "4",
  "description": "Explores modeling and control of mechatronics systems. Reviews Laplace and Fourier transforms and then examines Industrial Proportional (P), Derivative (D), Integral (I)-based, PD, P-PI, PID, lead-lag and pole placement feedback control strategies, and their design principles based on time and frequency domain performance metrics. Explores the frequency domain loop-shaping control design approach, and reference command generation and feedforward control for motion control. Examines digital control and real-time implementation of feedback control laws on real-time micro-processor systems. Implement and test feedback control algorithms on a servo motor setup in the labs.",
  "prerequisites": ["MFGE 341", "ENGR 212", "ENGR 212H", "ME 217"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED SIGNAL PROCESSING FOR MECHATRONICS SYSTEMS",
  "course_number": "MFGE 442",
  "credits": "4",
  "description": "Examine continuous and discrete Fourier Transforms, and Fast Fourier Transform algorithm concepts. Explore the design of low, high and band-pass filtering based on Finite (FIR) and Infinite (IIR) Impulse Response filters, and 1D and 2D image signal processing basics. Apply Artificial Neural Network (ANN) Basics for pattern recognition, regression and classification. Implement digital filtering on micro-processor systems, and apply ANN for image processing in the labs.",
  "prerequisites": ["MFGE 441"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "MFGE 499",
  "credits": "0-5",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "MFGE 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPUTATIONAL METHODS FOR ADVANCED MANUFACTURING",
  "course_number": "MFGE 525",
  "credits": "3",
  "description": "Identifies different schemes of computational modeling and constructs the necessary math basics required for each scheme. Determines the appropriate scheme(s) for various types of manufacturing processes. Analyzes thermomechanical conditions of manufacturing processes; in order to make sure that: first the modeled process is sound from thermomechanical point of view and second, the product is able to function as desired. Applies commercial or open source software suites to use the covered methods and schemes to solve a wide variety of engineering and manufacturing problems. Identifies the strength and limitations of the models used and interpret the results.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDUSTRIAL SUSTAINABILITY ANALYSIS",
  "course_number": "MFGE 535",
  "credits": "3",
  "description": "Students are exposed to the role of business and engineering in the design and implementation of sustainable industrial systems. Drivers, metrics, and analysis concepts, methods, and tools are introduced. Students incorporate business and engineering considerations in making product, manufacturing process, and supply chain design considerations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEAN MANUFACTURING SYSTEMS ENGINEERING",
  "course_number": "MFGE 536",
  "credits": "4",
  "description": "Emphasizes the design, implementation, evaluation, and control of manufacturing systems, and the integration of lean manufacturing theory and methods. Examines manufacturing processes/equipment and systems, e.g., manufacturing system design, production planning/control, and inventory/resource management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPOSITES MANUFACTURING",
  "course_number": "MFGE 538",
  "credits": "4",
  "description": "Introduction to fiber-reinforced composite materials and their applications. Topics include matrices and reinforcement; open and closed molding processes; filament winding, quality, testing, damage assessment; basics of factory operations and sustainability of composites. Students will complete laboratory projects using fiber-reinforced laminates. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADDITIVE MANUFACTURING",
  "course_number": "MFGE 551",
  "credits": "3",
  "description": "Introduces basic principles and process physics for additive manufacturing as compared with subtractive manufacturing. Various processes in AM (extrusion, jetting, photopolymerization, powder bed fusion, direct energy deposition and sheet lamination) and laser AM are discussed. Materials selection in AM (metals, polymers, ceramics and composites), powder metallurgy and metallurgical phenomena in additive manufacturing will be covered.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "MFGE 599",
  "credits": "0-5",
  "description": "",
  "prerequisites": []
}]