[{
  "corequisites": [],
  "course_name": "MARKET TOOLS FOR MANAGING GREENHOUSE GAS EMISSIONS",
  "course_number": "MNR 500",
  "credits": "3",
  "description": "Examines the use of market-based approaches to managing greenhouse gas emissions; the role of forestry and natural resource management in mitigating greenhouse gas emissions; and the design of carbon and offset markets in the context of broader climate change policies. CROSSLISTED as FES 500/MNR 500.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO SUSTAINABLE NATURAL RESOURCES",
  "course_number": "MNR 511",
  "credits": "3",
  "description": "Focuses on economic, environmental, social, cultural, ethical, and policy considerations of sustainable natural resource management. Explores international collaborative efforts to address global natural resource issues. Discusses key policy drivers, key stressors, balancing competing interests.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DIVERSITY",
  "course_number": "MNR 519",
  "credits": "EQUITY",
  "description": "Explores practical approaches to operationalizing diversity, equity and inclusion (DEI) principles in natural resource management organizational settings, programs and outdoor settings. Examines case studies on topics such as accessibility to recreational places, implicit bias and cultural competency in public communications, and how enhancing workplace diversity increases social capital. Introduces DEI analysis through a research project in their local area.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADAPTING FORESTS TO CLIMATE CHANGE",
  "course_number": "MNR 538",
  "credits": "3",
  "description": "Climate change is expected to have profound effects on forests. Society can respond by managing in forests in ways that can help mitigate climate change or help forests adapt. Nonetheless, changes in climate and forest responses are uncertain, making management and policy decisions difficult and controversial. We will investigate the effects of climate change on forests, focusing on potential forest management and policy responses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CLIMATE CHANGE IMPACTS ON FOREST ECOSYSTEMS",
  "course_number": "MNR 550",
  "credits": "3",
  "description": "Forest management responses to climate change rely on understanding the mechanisms of interaction between forests and climate, as well as the capacity to evaluate impacts of future climate scenarios on forests. Considers effects of rising CO2 and changing climate at the level of ecophysiological processes, changes in species distribution, changes in disturbance regimes, and ecosystem-level impacts mediated by the water, carbon, and nitrogen cycles. Modeling approaches include statistically-based bioclimatic envelopes, and dynamic global vegetation models that treat ecosystem processes and changes in biome distribution.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DEVELOPING THE MNR CAPSTONE PROPOSAL",
  "course_number": "MNR 560",
  "credits": "3",
  "description": "Applies content from across the MNR degree in developing a capstone project. Explores the types of capstone projects and methodologies. Identifies and evaluates the data needed to address natural resource problems or topics. Develops outlines for students’ individualized MNR capstone projects.",
  "prerequisites": [["MNR 511"]]
}, {
  "corequisites": [],
  "course_name": "MNR CAPSTONE PROJECT",
  "course_number": "MNR 561",
  "credits": "1-6",
  "description": "Students work with their major advisor on the completion of their capstone project at the end of the MNR degree program. Students incorporate knowledge gained from coursework to address a natural resource problem within interconnected ecological, economic and social contexts.",
  "prerequisites": [["MNR 560", "SNR 506"]]
}]