[{
  "corequisites": [],
  "course_name": "*NEW MEDIA AND CULTURE",
  "course_number": "NMC 100",
  "credits": "3",
  "description": "Provides students with the basic critical skills to analyze the cultural, social, and political impact of new media technologies, new media texts, and new media institutions. Students will be exposed to a variety of social scientific and humanistic conceptual approaches to analyzing new media and culture. Special emphasis will be placed on historical analyses of how new media have shaped culture, as well as how culture has shaped new media.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO NEW MEDIA COMMUNICATIONS",
  "course_number": "NMC 101",
  "credits": "3",
  "description": "Principles of new media communications. Perspectives on the communications media. How the communications media operate and how they interact with society.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO NEW MEDIA COMMUNICATIONS",
  "course_number": "NMC 101H",
  "credits": "3",
  "description": "Principles of new media communications. Perspectives on the communications media. How the communications media operate and how they interact with society.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "NMC 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SURVEY OF SOCIAL MEDIA",
  "course_number": "NMC 240",
  "credits": "3",
  "description": "Explores history, business, and current social research in social media, especially the cultural logic of Facebook, Twitter, Instagram, Snapchat, TikTok, Pinterest and beyond. Establishes critical context for advanced study of platforms and professionalization.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED MEDIA AESTHETICS",
  "course_number": "NMC 241",
  "credits": "4",
  "description": "Foundational elements and principles of art and design in relation to visual media production and the communicative arts. Topics include composition, layout, color theory, typography, image manipulation, graphics creation and design in visual media. Provides core competencies digital visual communication arts tools.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CULTURAL ANALYTICS AND DATA SCIENCE",
  "course_number": "NMC 245",
  "credits": "3",
  "description": "Computational approaches to cultural research have changed what it means to work with media today. This course provides a foundation in data science tailored for work in social and cultural research including basic work in natural language processing, social network analysis, and information visualization.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED SOUND DESIGN",
  "course_number": "NMC 255",
  "credits": "4",
  "description": "Foundational elements and principles of sound design in relation to audio production and the communicative arts. Topics include elements of sound, technical terminology, types of equipment and digital audio workflows. Provides core competencies in audio recording, editing and manipulation in sound media.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NEW MEDIA FUTURES",
  "course_number": "NMC 260",
  "credits": "3",
  "description": "Covers historical context and current perspectives on the various aspects of new multimedia communications, including linear and nonlinear or time-based and interactive media. Primary topics include digital cinema (compositing and nonlinear access), visual music, information visualization, interactive narrative, and virtual space.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "+GLOBAL MEDIA",
  "course_number": "NMC 280",
  "credits": "3",
  "description": "Explores theoretical and practical concepts of global media. Addresses historical and contemporary perspectives on the topic, particularly as they relate to globalization, systems of different world regions, cultural imperialism, media ownership, medium as the message, media representation, politics, entertainment, pop culture and trends in global technology and economic media developments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "NMC 299",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^WRITING FOR THE MEDIA PROFESSIONAL",
  "course_number": "NMC 301",
  "credits": "3",
  "description": "Fundamentals of gathering information, evaluating information, writing information of the media and editing media content in written form.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "REPORTING",
  "course_number": "NMC 302",
  "credits": "3",
  "description": "An introduction to the practices, procedures, techniques, and organizational structures of basic news gathering and writing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COPYEDITING",
  "course_number": "NMC 305",
  "credits": "3",
  "description": "Copyreading, headline writing, newspaper layout and design.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ART AND CULTURE CONTENT CREATION",
  "course_number": "NMC 306",
  "credits": "3",
  "description": "Explores various forms of the arts and culture using criticism/reviewing/feature writing's forms, principles and ethics. Encourages students to be artful in response, given certain time and space boundaries, but also to discuss pushing the boundaries, exploding those boundaries and doing excellent, artful creation in response to the arts that affect our lives.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO NONPROFIT MANAGEMENT",
  "course_number": "NMC 311",
  "credits": "3",
  "description": "Introduction to the principles of effective nonprofit management and lays a foundation for future leaders and managers in the nonprofit sector. Focuses on historical perspectives, ethics, governance and leadership, legal structure and standards, financial management, strategic planning principles, fundraising principles, volunteer management, marketing and communications, and the future of the nonprofit sector.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY OF BROADCASTING",
  "course_number": "NMC 321",
  "credits": "3",
  "description": "The technological, economic and corporate, legal and political, artistic, and social developments that shaped American broadcasting in the 20th century are examined. Implications for the future of broadcasting are addressed as well.",
  "prerequisites": [["NMC 260"]]
}, {
  "corequisites": [],
  "course_name": "LANDMARKS IN MEDIA CONTENT",
  "course_number": "NMC 322",
  "credits": "3",
  "description": "Introduces students to media content that represents advances in the art and science of creative use of media technology. Some of these advances were recognized immediately, some only after time had passed.",
  "prerequisites": [["NMC 101", "NMC 101H"], ["NMC 260"]]
}, {
  "corequisites": [],
  "course_name": "THE MEANING OF VIDEO GAMES",
  "course_number": "NMC 330",
  "credits": "3",
  "description": "Examines approaches to understanding the experience of playing video games, including the role of storytelling in diverse games, the relationship between the player and the game, the game as art, and intersections between games and real life.",
  "prerequisites": [["NMC 301"]]
}, {
  "corequisites": [],
  "course_name": "SOCIAL MEDIA STRATEGY",
  "course_number": "NMC 340",
  "credits": "3",
  "description": "Designing systems of interaction is important for understanding how people come to be a part of social networks. Students will participate in a series of simulation games that will explore the dimensions of the interaction between publics and social networks, culminating in an original research project.",
  "prerequisites": [["NMC 240"], ["NMC 260"]]
}, {
  "corequisites": [],
  "course_name": "MEDIA SPIN AND DECEPTION DETECTION",
  "course_number": "NMC 341",
  "credits": "3",
  "description": "Examines common ways media is used to deceive, and how media scholars and creators can avoid falling prey to spinners, platformed prevaricators, and purveyors of \"fake news\" using knowledge of production techniques, logic, and other skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO PUBLIC RELATIONS",
  "course_number": "NMC 342",
  "credits": "3",
  "description": "Emphasizes theory and philosophy of public relations, and applications of theory through specific tools and techniques. Analyze current events from public relations perspective. Systematically develops public relations plan through research, planning, communication, and evaluation processes. CROSSLISTED as COMM 342/NMC 342.",
  "prerequisites": [["NMC 101", "NMC 101H", "COMM 111", "COMM 111H", "COMM 111Z", "COMM 111H"]]
}, {
  "corequisites": [],
  "course_name": "VIDEO ART",
  "course_number": "NMC 349",
  "credits": "4",
  "description": "Studio course in video art and time-based media projects. Emphasis on experimental approaches to video art in a contemporary art context, linear and non-linear video production and the projection and screening of video art projects. Introduction to the history of video art as an art form. CROSSLISTED as ART 349/NMC 349.",
  "prerequisites": [["ART 222"], ["ART 263"]]
}, {
  "corequisites": [],
  "course_name": "DIGITAL ILLUSTRATION AND DESIGN",
  "course_number": "NMC 350",
  "credits": "4",
  "description": "Explores several techniques for communicating narrative through pictorial design with digital arts tools. Builds a digital drawing skill set including vector based drawing, digital painting, 3D illustration, collage, typography and photographic compositing. Covers illustration in editorial content, publishing, advertising, social media and the entertainment industry. Emphasis on visual research, creative workflows, concept development through the creation of illustration and design content.",
  "prerequisites": [["NMC 241"]]
}, {
  "corequisites": [],
  "course_name": "NEW MEDIA VISUALIZATION",
  "course_number": "NMC 351",
  "credits": "4",
  "description": "Explores principles of spatial design, interactive design and immersive storytelling as they relate to Virtual, Augmented and Mixed Reality (collectively referred to as Extended or X-Reality). Additional topics include the history and current applications of X-Reality technology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOUND DESIGN FOR VISUAL MEDIA",
  "course_number": "NMC 355",
  "credits": "4",
  "description": "Explores creative application of sound design for linear narrative, interactive and experimental visual media. Topics include evolving sound aesthetics for visual media in a historical and technological context. Emphasis on post-production synchronization, sound effect creation and manipulation, music underscoring and expressive experimentation in the audio visual story.",
  "prerequisites": [["NMC 101", "NMC 101H"], ["NMC 255"]]
}, {
  "corequisites": [],
  "course_name": "PODCAST PRODUCTION",
  "course_number": "NMC 356",
  "credits": "3",
  "description": "Focuses on intermediate-level production to develop, launch, distribute, and maintain professional-quality podcasts. Uses podcasting tools and resources for other storytelling enterprises.",
  "prerequisites": [["NMC 101", "NMC 101H"]]
}, {
  "corequisites": [],
  "course_name": "PRE-PRODUCTION",
  "course_number": "NMC 380",
  "credits": "4",
  "description": "Focuses on pre-production or the planning phase of various audio/visual storytelling media. Explores creative application of visualizing a text narrative into a audio/visual media production. Topics include story structure, concept development, visual research, cinematic language, shot composition, storyboarding, animatics and editing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STUDIO AND MULTICAMERA PRODUCTION",
  "course_number": "NMC 382",
  "credits": "4",
  "description": "Proficiency in organizing, producing, directing, and evaluating television programs using multicamera studio techniques, including graphics, set design, audio for television and digital video production, and lighting. Emphasis on bringing ideas from conception to realization in a studio setting.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FIELD PRODUCTION",
  "course_number": "NMC 383",
  "credits": "4",
  "description": "Development of the technical abilities and conceptual approaches to audio, film, video and multimedia production. Emphasis on single-camera production techniques and concepts. Students will begin the study of post-production process. Students will also begin to study lighting and audio as they relate to single-camera field production.",
  "prerequisites": [["NMC 380"]]
}, {
  "corequisites": [],
  "course_name": "MOTION DESIGN FOUNDATIONS",
  "course_number": "NMC 385",
  "credits": "4",
  "description": "Explores foundational elements and principles of animation for motion design. Topics include introductory animation techniques, history of motion graphics, the production process and workflows. Concept development, visual research, asset creation will be exercised through the creative development and execution of motion design projects.",
  "prerequisites": [["NMC 101", "NMC 101H"]]
}, {
  "corequisites": [],
  "course_name": "SOCIAL MEDIA AND INTERPERSONAL RELATIONSHIPS",
  "course_number": "NMC 388",
  "credits": "3",
  "description": "Examines how individuals build and maintain close relationships through new media and social networks. Currently, scholars are seeing a shift in how individuals self-report building close relationships, as people use elements of new media more and more frequently. Designed to look into the similarities and differences of these relationships as compared to face-to-face relationships. CROSSLISTED as COMM 388/NMC 388.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WEB DESIGN AND PROGRAMMING",
  "course_number": "NMC 392",
  "credits": "3",
  "description": "Web apps are applications that are loaded as web pages. They can store data locally and continue to function while offline. In this hands-on class, students will create web apps that run on smart phones. No prior programming skills are required. Programming concepts that are required to create interactive web apps will be covered in this class.",
  "prerequisites": [["NMC 260"]]
}, {
  "corequisites": [],
  "course_name": "SERVER SIDE PROGRAMMING",
  "course_number": "NMC 393",
  "credits": "3",
  "description": "Create websites that focus on the server side. Sever side website can store or retrieve data from users. In this hands-on class, students will create server side websites. No prior programming skills are required. Programming concepts that are required to create interactive server side websites will be covered in this class.",
  "prerequisites": [["NMC 260"]]
}, {
  "corequisites": [],
  "course_name": "INTERACTIVE DESIGN AND USER EXPERIENCE",
  "course_number": "NMC 394",
  "credits": "3",
  "description": "Explores core skills of interactive design within media communications and systems, including conceptualizing interactive systems, prototyping, iterating, and managing interactive design workflow processes. Primarily examines interactivity through the lens of app design, while considering how these principles apply to other domains such as web interactivity, digital applications, tangible products, and mixed reality. Expands interactive formats and user experiences through visual consideration. Emphasizes hands-on aspect for artists to re/create interactive designs and focuses on the practical facet of the design.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "VIRTUAL REALITY PROGRAMMING",
  "course_number": "NMC 395",
  "credits": "3",
  "description": "Teaches the fundamental programming skills to create virtual reality experiences using the Unity game engine and C# programming language.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO INFORMATION VISUALIZATION",
  "course_number": "NMC 397",
  "credits": "3",
  "description": "Applies visualization and interaction techniques to help people analyze and understand the sources of data.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "NMC 399",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "NMC 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "NMC 402",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS/DISSERTATION",
  "course_number": "NMC 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "NMC 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "NMC 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "NMC 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "NMC 408",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRACTICUM",
  "course_number": "NMC 409",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "NMC 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "VIRAL CONTENT",
  "course_number": "NMC 418",
  "credits": "3",
  "description": "Online media is often filled with memes, likes, shares, tweets and even hilarious cat videos. Companies like Buzzfeed exist to create, maintain and drive traffic to content. In 2015, collectively the top 10 YouTube content creators made 70.5 million dollars. So, what’s the secret to going viral? This class is designed to look at this question by examining the culture of viral content, the social and psychological influences that shape online behavior and the business of creating and spreading viral content. Throughout the term, students will apply these principle concepts in an attempt to make their own viral content.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "REEFER MADNESS IN THE MEDIA",
  "course_number": "NMC 419",
  "credits": "3",
  "description": "Critically examines the history of hemp and marijuana prohibition, issues of propaganda and the media's role during the transition between prohibition and the current state of reform. The purpose of this course is to better understand the role media plays in shaping our political, cultural and personal experiences. For students, this knowledge is invaluable for analysis, evaluation and critical thinking skills. The framework of this class is based on four modules: \"History of Marijuana Prohibition\", \"Marijuana, Media and Culture\", \"Medicinal Marijuana Movement\" and \"Legalizing Marijuana Campaigns\".",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DIFFUSION OF INNOVATIONS",
  "course_number": "NMC 421",
  "credits": "3",
  "description": "An introduction to old and emerging theories that explain the spread of innovative ideas and technologies among members of a society, emphasizing the role of communication processes and the special problems for diffusion in communication technology.",
  "prerequisites": [["NMC 301"]]
}, {
  "corequisites": [],
  "course_name": "*DIGITAL PORNOGRAPHY",
  "course_number": "NMC 427",
  "credits": "3",
  "description": "Exploration of the prominent role pornography plays in digital communication innovation globally including the examination of social consequences; diffusion of technology, business models and economic impact; legal, ethical, and moral issues; and community health and well-being.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MEDIA THEORY",
  "course_number": "NMC 430",
  "credits": "3",
  "description": "Exposes students to major theoretical paradigms and controversies in media studies. Introduces a broad theoretical vocabulary for the analysis of media. Emphasizes theoretical approaches to new media technology.",
  "prerequisites": [["NMC 301"]]
}, {
  "corequisites": [],
  "course_name": "MEDIA EFFECTS",
  "course_number": "NMC 435",
  "credits": "3",
  "description": "Reviews the potential for media technology and media content to influence the beliefs and behaviors of individuals. Discusses the media's ability to bring about specific changes in people's attitudes, values, political agendas, purchasing habits, and jury decisions. Emphasizes the impact of new media's interactive technology and content on people's beliefs and behaviors.",
  "prerequisites": [["NMC 301"]]
}, {
  "corequisites": [],
  "course_name": "NEW MEDIA AND SOCIETY",
  "course_number": "NMC 437",
  "credits": "3",
  "description": "Examines the impact of new media technology on American institutions and political life. Emphasizes the way that social institutions, the government, the military, and corporations have evolved in the face of new media. Discusses social and political changes in terms of their connection to developments in media technology.",
  "prerequisites": [["NMC 301"]]
}, {
  "corequisites": [],
  "course_name": "SONIC ARTS",
  "course_number": "NMC 439",
  "credits": "2",
  "description": "Create experimental sonic art projects using analog and digital technologies to make natural, artificial, and curated sound installations within an arts, design, or communication context. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the sound art project. Develop collaborative skills by working with people from other disciplines. Demonstrate competency through describing and applying sound art concepts including those that involve active listening practices. Explore the breadth and range of sonic-art from a historical and contemporary art practice. CROSSLISTED as ART 439/GD 439/MUS 439/NMC 439/TA 439 and ART 539/MUS 539.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MEDIA MANAGEMENT",
  "course_number": "NMC 440",
  "credits": "3",
  "description": "Changes in technology and in the media's role in converging technologies require creative, innovative organizational structure and strategic management and leadership techniques. Identify basic roles, principles and concepts as related to media management. Through group work, role-plays, and projects, investigate the creative and practical aspects of managing diverse teams and interpersonal dialogue, while becoming more culturally competent.",
  "prerequisites": [["NMC 301"]]
}, {
  "corequisites": [],
  "course_name": "MEDIA ENTREPRENEURSHIP",
  "course_number": "NMC 441",
  "credits": "3",
  "description": "Studies the entrepreneurial process as it relates uniquely to the arts and sciences of new media. Students will study the basic entrepreneurial processes of law, finance, accounting, organizational structure, budgeting, business plans, market analyses, taxes, licensing, and insurance as they relate to new media enterprises. Students will also study the sales/revenue generation side of new media ventures.",
  "prerequisites": [["NMC 301"]]
}, {
  "corequisites": [],
  "course_name": "OFF THE SCREEN - VIDEO INSTALLATION ART",
  "course_number": "NMC 457",
  "credits": "2",
  "description": "Create experimental video-art installations within an arts, design, or communication context. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the video art project. Explore the breath and range of experimental approaches to video installations, multi-screen projections, immersive visual and sound environments, and projection-mapping from a historical and contemporary art perspective. Develop collaborative skills by working with people from other disciplines. CROSSLISTED as ART 457/GD 457/MUS 457/ NMC 457/TA 457 and ART 557/MUS 557.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TRANS-MEDIA CREATION IN SCI-FI & FANTASY",
  "course_number": "NMC 461",
  "credits": "3",
  "description": "Develops an exploitable sci-fi/fantasy storyworld suitable for trans-media franchise development, anchors it with a novelette-length work of fiction writing, and makes preparations to utilize it as the hub of a trans-media storytelling franchise. Although a tremendous amount of writing happens in this class as part of the story-creation process, writing is used simply as a capture tool. This is not a writing class.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TRANS-MEDIA PUBLISHING IN SCI-FI & FANTASY",
  "course_number": "NMC 462",
  "credits": "3",
  "description": "Simulates a trans-media story shop. A franchise canon is selected (usually from the public domain) and student teams work on specific trans-media assets for the franchise, bringing their existing skill sets to the table and learning new ones from their peers in a collaborative setting. Examples of such assets include webcomics, short video productions, virtual-reality experiences, video games, tabletop games, interactive novels, alternate-reality games, podcasts, radio dramas, e-books, YouTube channels.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MEDIA LAW",
  "course_number": "NMC 470",
  "credits": "3",
  "description": "The relevant laws and regulations that govern the mass media; the participants in the law making process; the analytical methods and problem solving techniques used in the law making process; the laws and policies affecting journalists. Issues such as libel, privacy, obscenity, indecency, fair trail/free press and copyright are covered.",
  "prerequisites": [["NMC 301"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED MOTION DESIGN",
  "course_number": "NMC 480",
  "credits": "4",
  "description": "Explores advanced techniques in motion graphics design. Builds an advanced animation skill set including complex compositing, animated textures, looping, basic rigs, hierarchies and behaviors. Emphasis on in-depth concept development, advanced asset creation and storytelling through motion. Analyze motion design content within contemporary visual culture.",
  "prerequisites": [["NMC 385"]]
}, {
  "corequisites": [],
  "course_name": "COMPOSITING AND DIGITAL EFFECTS",
  "course_number": "NMC 481",
  "credits": "4",
  "description": "Explores compositing and digital effects as production techniques in digital storytelling. Explores several compositing techniques and workflow options for digital manipulation of moving image content. Topics include green screen extraction, motion and camera tracking, rotoscoping, and 2D/3D workflows.",
  "prerequisites": [["NMC 380"]]
}, {
  "corequisites": [],
  "course_name": "DOCUMENTARY",
  "course_number": "NMC 482",
  "credits": "4",
  "description": "Examines theory and production of the documentary genre. Covers all stages of producing a documentary film from the idea through development, marketing, planning, shooting, editing, and post-production.",
  "prerequisites": [["NMC 380"]]
}, {
  "corequisites": [],
  "course_name": "NEW MEDIA 3-D",
  "course_number": "NMC 483",
  "credits": "4",
  "description": "Provides hands-on introduction to the world of 3-D computer modeling and animation, including investigations of light, texture, form, spatial design and motion (to a limited degree). Discusses professional and artistic practice and critiques student and professional work.",
  "prerequisites": [["NMC 351"]]
}, {
  "corequisites": [],
  "course_name": "NEW MEDIA ANIMATION",
  "course_number": "NMC 484",
  "credits": "4",
  "description": "An in-depth theoretical and hands-on investigation of advanced animation tools and techniques used for educational, scientific, entertainment, and expressive communication projects. Tools and techniques covered include motion capture (full body, face, hand), automated lip-sync dialogue processing, dynamic simulation, particle motion, and other simulation or performance-based animation approaches. Students will work individually and in teams to explore the communicative and creative possibilities of the described technologies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "VIRTUAL WORLDS",
  "course_number": "NMC 487",
  "credits": "4",
  "description": "Explores design of virtual space from theoretical, historical and practical perspectives. Compares and contrasts real world physical space with virtual space. Examines narrative back story, style, form, color, light, motion and sound in video games. Develops detailed cultural and environmental backs stories for virtual worlds based on research. Plans and maps layout of interactive virtual worlds that encourage exploration. Researches and applies principles of color, light, form, motion, sound and spatial narrative design. Builds interactive virtual spaces using 3D modeling and game development software. Creates cinematic trailers of virtual worlds, including complex camera moves and soundtracks. Designs logos for virtual worlds based on principles of design, and research of brand identities.",
  "prerequisites": [["NMC 100", "NMC 101", "NMC 101H", "NMC 260"], ["NMC 351"]]
}, {
  "corequisites": [],
  "course_name": "SENSOR TECHNOLOGIES AND THE ARTS",
  "course_number": "NMC 488",
  "credits": "2",
  "description": "Create interactive arts, design, or communication projects using sensor technologies in combination with sound, video, lights, video games, and generative digital art. Translate gestures of the physical world into interactive control using plug and play wireless sensors. Apply the iterative design process to ideate, prototype, implement, reflect and then re-imagine the sensor technologies project. Explore the breadth and range of interactive art from a historical and contemporary art practice. CROSSLISTED as ART 488/GD 488/MUS 488/NMC 488/TA 488 and ART 588/MUS 588.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MEDIA ETHICS",
  "course_number": "NMC 490",
  "credits": "3",
  "description": "Explores ethical issues surrounding new media communications. Emphasizes professionalism in journalism, new media visual production, new media management, advertising, film, and public relations. Topics also include new media's relationship with society, violence in the media, and sex in the media.",
  "prerequisites": [["NMC 301"]]
}, {
  "corequisites": [],
  "course_name": "*MEDIA AND POWER",
  "course_number": "NMC 493",
  "credits": "3",
  "description": "Analyzes the relationship between media and power. Media technologies like television, film, the smartphone, and GPS have been central to the analysis, governance, and control of populations. Emphasizes how media technologies have allowed for the exertion, extension, and resistance of power in the United States.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED COLLABORATIVE EXPERIENCE",
  "course_number": "NMC 498",
  "credits": "3-4",
  "description": "Senior-level course designed to integrate the skills and knowledge obtained through NMC course work into a group research, group project, and/or group production that will be useful to students for their professional portfolio or serve as the basis for academic publication. Topic changes per term.",
  "prerequisites": [["NMC 101", "NMC 101H"], ["NMC 301"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "NMC 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MEDIA THEORY",
  "course_number": "NMC 530",
  "credits": "3",
  "description": "Exposes students to major theoretical paradigms and controversies in media studies. Introduces a broad theoretical vocabulary for the analysis of media. Emphasizes theoretical approaches to new media technology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MEDIA EFFECTS",
  "course_number": "NMC 535",
  "credits": "3",
  "description": "Reviews the potential for media technology and media content to influence the beliefs and behaviors of individuals. Discusses the media's ability to bring about specific changes in people's attitudes, values, political agendas, purchasing habits, and jury decisions. Emphasizes the impact of new media's interactive technology and content on people's beliefs and behaviors.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NEW MEDIA AND SOCIETY",
  "course_number": "NMC 537",
  "credits": "3",
  "description": "Examines the impact of new media technology on American institutions and political life. Emphasizes the way that social institutions, the government, the military, and corporations have evolved in the face of new media. Discusses social and political changes in terms of their connection to developments in media technology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MEDIA ETHICS",
  "course_number": "NMC 590",
  "credits": "3",
  "description": "Explores ethical issues surrounding new media communications. Emphasizes professionalism in journalism, new media visual production, new media management, advertising, film, and public relations. Topics also include new media's relationship with society, violence in the media, and sex in the media.",
  "prerequisites": []
}]