[{
  "corequisites": [],
  "course_name": "LEADERSHIP",
  "course_number": "NS 002",
  "credits": "0",
  "description": "Provides students with basic personal and interpersonal leadership skills that can be used within and outside of a work setting. Through practice, the leadership experience help students explore motivation, decision-making, time management, power, team building, conflict, ethics, dealing with change, communication skills, and diversity issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRO TO NAVAL SCIENCE",
  "course_number": "NS 111",
  "credits": "3",
  "description": "Emphasizes the mission, organization, regulations and warfare components of the Navy and Marine Corps. Includes a discussion of the responsibilities and commitments of an officer in the Navy or Marine Corps; an overview of enlisted rank and rating structures; and a synopsis of officer designators and the training, education, ranks, promotion and career paths for each. Introduces the basic tenets of naval customs, discipline, and naval leadership, as well as ship’s nomenclature, organization, basic damage control, and basic military equipment identification.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "U.S. NAVAL HISTORY I",
  "course_number": "NS 112",
  "credits": "3",
  "description": "Surveys the evolution of sea power, with an emphasis on the development of the United States as a world class sea power. Covers the period from the American Revolution up through World War I. Examines sea power via the following eight themes: foreign policy, leadership, Congress, inter-service relationships, coalitions, technology, tactics, and strategy. Creates an understanding of the historical impact of these themes on maritime warfare and has direct application to present day and future maritime warfare.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "U.S. NAVAL HISTORY II",
  "course_number": "NS 113",
  "credits": "3",
  "description": "Surveys the evolution of sea power, with an emphasis on the development of the United States as a world class sea power. Covers the period from World War I to the present. Examines sea power via the following eight themes: foreign policy, leadership, Congress, inter-service relationships, coalitions, technology, tactics, and strategy. Creates an understanding of the historical impact of these themes on maritime warfare has direct application to present day and future maritime warfare.",
  "prerequisites": ["NS 112"]
}, {
  "corequisites": [],
  "course_name": "LEADERSHIP AND MANAGEMENT",
  "course_number": "NS 211",
  "credits": "5",
  "description": "Explore the principles, philosophies, and methodologies of effective Naval leadership with emphasis on moral, ethical actions with respect to the principles of authority, responsibility, and accountability as they apply to military organizations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NAVAL ENGINEERING",
  "course_number": "NS 212",
  "credits": "5",
  "description": "Explore how concepts in physics are applied to the design of naval vessels and aircraft. Prepare students for their future role as division officers by examining topics such as maintenance, engineering documentation, and ethical issues.",
  "prerequisites": ["NS 111"]
}, {
  "corequisites": [],
  "course_name": "NAVIGATION",
  "course_number": "NS 311",
  "credits": "5",
  "description": "Explore the geographic qualities of space and time within the maritime domain through an introductory treatment of navigation. Piloting, dead reckoning, voyage planning, rules of the road, external communications, case studies and relative motion problems provide a fundamental background for interpreting maritime law, management of forces, spatial and motion relationships, and handling uncertainty.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NAVAL OPERATIONS AND SEAMANSHIP",
  "course_number": "NS 313",
  "credits": "3",
  "description": "Illustrates the theory of shiphandling, interpret communications, explain shipboard evolutions, and classify heavy weather. Includes case study discussions and comparisons of naval operations.",
  "prerequisites": ["NS 311"]
}, {
  "corequisites": [],
  "course_name": "EVOLUTION OF WARFARE",
  "course_number": "NS 321",
  "credits": "5",
  "description": "Examines how warfare philosophies, domains, tactics and technology have either endured or changed. Affirms the fundamental human dimension of warfare, exploring the moral forces at play within warrior cultures. Through the study of history, seeks to illuminate the timeless lessons of warfare. Utilizes case study, lecture, and war gaming in order to set conditions for doctrinal training and professional refinement in subsequent training. Equips students with a strong mental foundation for leading in future conflicts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NAVAL SCIENCE III: MARINE CORPS OPTION",
  "course_number": "NS 323",
  "credits": "3",
  "description": "Explores a fundamental understanding of the basic military skills required for completion of the commissioning course at Officer Candidate School (OCS). Examines USMC history, mission and organization, map reading, land navigation, small unit leadership and tactics, 5-paragraph order, and M16 familiarization, in order to face the environment expected during OCS.",
  "prerequisites": ["NS 321"]
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "NS 405",
  "credits": "1-16",
  "description": "To prepare midshipmen returning from a leave of absence from the Naval ROTC program for commissioning and entrance into the fleet.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NAVAL WEAPONS SYSTEMS",
  "course_number": "NS 411",
  "credits": "5",
  "description": "Explores the theory and development of U.S. Naval weapons systems, current weapons systems types, platforms, and employment. Reviews naval weapons systems types, launch platforms, characteristics and employment.",
  "prerequisites": ["NS 111"]
}, {
  "corequisites": [],
  "course_name": "LEADERSHIP AND ETHICS",
  "course_number": "NS 413",
  "credits": "4",
  "description": "Provides the academic foundation for NROTC leadership development. Provides future naval leaders with a sound moral leadership foundation for “real life” military decision making. Integrates an intellectual exploration of Western moral traditions and ethical philosophy with military leadership, core values, professional ethics, the Uniform Code of Military Justice, and Navy regulations. Combining ethical theory and leadership discussions with current military events prepares students for the role and responsibilities of leadership in the naval service.",
  "prerequisites": ["NS 211"]
}, {
  "corequisites": [],
  "course_name": "FUNDAMENTALS OF MANEUVER WARFARE",
  "course_number": "NS 421",
  "credits": "5",
  "description": "Provides a detailed look at broad aspects of warfare and their interactions with maneuver warfare doctrine, with a focus on the United States Marine Corps. Discusses a strong focus on leadership, as the fundamental purpose of this course is to develop the skills, knowledge, leadership background, and mindset necessary for a successful Marine Corps Officer.",
  "prerequisites": ["NS 321"]
}]