[{
  "corequisites": [],
  "course_name": "MATHEMATICAL METHODS FOR NSE",
  "course_number": "NSE 233",
  "credits": "3",
  "description": "Development and application of analytical and numerical methods with applications to problems in the NE/RHP field. Major topics will include solution of ODEs and systems of ODEs, root finding techniques and numerical integration and differentiation. Major applications will include solution of the Bateman Equations and solution of the diffusion equation.",
  "prerequisites": ["MTH 256", "MTH 256H"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR AND RADIATION PHYSICS I",
  "course_number": "NSE 234",
  "credits": "3",
  "description": "Relativistic dynamics; basic nuclear physics; basic quantum mechanics; radioactivity; electromagnetic waves; interaction of ionizing radiation with matter; cross sections; basic atomic structure.",
  "prerequisites": ["MTH 251", "MTH 251H"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR AND RADIATION PHYSICS II",
  "course_number": "NSE 235",
  "credits": "3",
  "description": "Radioactivity; radioactive decay modes; decay kinetics, interaction of neutrons with matter; nuclear reactions; fission and fusion basics; cross sections.",
  "prerequisites": ["NSE 234", "MTH 252", "MTH 252H"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR RADIATION DETECTION AND INSTRUMENTATION",
  "course_number": "NSE 236",
  "credits": "4",
  "description": "Principles and mechanisms underlying nuclear radiation detection and measurements; operation of nuclear electronic laboratory instrumentation; application of gas-filled, scintillation and semiconductor laboratory detectors for measurement of alpha, beta, gamma, and neutron radiation; experimental investigation of interactions of radiation with matter. Lec/lab.",
  "prerequisites": ["NSE 235"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO NUCLEAR FUEL CYCLES",
  "course_number": "NSE 240",
  "credits": "3",
  "description": "Introduces historic and modern nuclear fuel cycle development; enabling reactor technologies for current fuel cycle development from cradle-to-grave; prospective alternatives to LEU fuel cycles; closed fuel cycles, waste disposal, and nonproliferation.",
  "prerequisites": ["NSE 235", "CH 201", "CH 202"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO HEALTH PHYSICS",
  "course_number": "NSE 281",
  "credits": "3",
  "description": "Explore health physics’ rich history, fundamental principles, and contemporary applications. Examine evolution of the discipline, from inception to present-day practices, gaining insights into pivotal history, milestones and technological advancements. Outline educational pathways to a successful career in health physics, evaluating academic degrees, certifications, and specialized training. Build essential skills and knowledge, including radiation detection and measurement techniques, risk assessment methods, and regulatory compliance assessments. Discuss diverse employment opportunities. Equip students with a holistic understanding of health physics and its vital role in maintaining a safe and secure world.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO THERMODYNAMICS",
  "course_number": "NSE 310",
  "credits": "4",
  "description": "Introduces basic concepts of thermodynamics, by applying the first and second laws of thermodynamics. Solves engineering problems involving closed and open systems, as well as basic power and refrigeration cycles. CROSSLISTED as ME 310/NSE 310.",
  "prerequisites": ["MTH 256", "MTH 256H", "ENGR 212", "ENGR 212H", "ME 217"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO THERMAL-FLUID SCIENCES",
  "course_number": "NSE 311",
  "credits": "4",
  "description": "Basic concepts of fluid mechanics, thermodynamics and heat transfer are introduced. Conservation of mass, energy, moment and the second law of thermodynamics are included. CROSSLISTED as ME 311/NSE 311.",
  "prerequisites": ["ENGR 212", "ENGR 212H", "MTH 256"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO THERMAL-FLUID SCIENCES",
  "course_number": "NSE 311H",
  "credits": "4",
  "description": "Basic concepts of fluid mechanics, thermodynamics and heat transfer are introduced. Conservation of mass, energy, moment and the second law of thermodynamics are included. CROSSLISTED as ME 311/NSE 311.",
  "prerequisites": ["ENGR 212", "ENGR 212H", "MTH 256", "MTH 256H"]
}, {
  "corequisites": [],
  "course_name": "THERMODYNAMICS",
  "course_number": "NSE 312",
  "credits": "4",
  "description": "Analyzes exergy destruction, machine and cycle processes, law of corresponding states, non-reactive gas mixtures, reactive mixtures, thermodynamics of compressible fluid flow. CROSSLISTED as ME 312/NSE 312.",
  "prerequisites": ["ME 311", "ME 311H", "NSE 311", "NSE 311H"]
}, {
  "corequisites": [],
  "course_name": "THERMODYNAMICS",
  "course_number": "NSE 312H",
  "credits": "4",
  "description": "Analyzes exergy destruction, machine and cycle processes, law of corresponding states, non-reactive gas mixtures, reactive mixtures, thermodynamics of compressible fluid flow. CROSSLISTED as ME 312/NSE 312.",
  "prerequisites": ["ME 311", "ME 311H", "NSE 311", "NSE 311H"]
}, {
  "corequisites": [],
  "course_name": "*SOCIETAL ASPECTS OF NUCLEAR TECHNOLOGY",
  "course_number": "NSE 319",
  "credits": "3",
  "description": "Description and discussion of nuclear-related issues as they impact society. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO NUCLEAR MATERIALS SCIENCE",
  "course_number": "NSE 321",
  "credits": "3",
  "description": "Provides an introduction and overview of material science challenges and considerations for nuclear power applications. Discusses fundamental material science concepts in the context of the extreme environments typified by nuclear systems, including crystal structure, defects, diffusion, mechanical properties, and phase transformations. Investigates common materials science obstacles and challenges posed by both modern and next-generation nuclear reactor designs.",
  "prerequisites": ["CH 202", "CH 232", "CH 232H"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO FLUID MECHANICS AND HEAT TRANSFER",
  "course_number": "NSE 330",
  "credits": "4",
  "description": "Introduces basic concepts of fluid dynamics and heat transfer. Applies conservation equations and dimensional analysis to solve engineering problems relevant to incompressible pipe systems and external flows, as well as conductive, convective, and radiative heat transfer. CROSSLISTED as ME 330/NSE 330.",
  "prerequisites": ["ME 310", "NSE 310"]
}, {
  "corequisites": [],
  "course_name": "FLUID MECHANICS",
  "course_number": "NSE 331",
  "credits": "4",
  "description": "Introduces the concepts and applications of fluid mechanics and dimensional analysis with an emphasis on fluid behavior, internal and external flows, analysis of engineering applications of incompressible pipe systems, and external aerodynamics. CROSSLISTED as ME 331/NSE 331.",
  "prerequisites": ["ME 330", "ME 330H", "NSE 330"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY FLUID MECHANICS",
  "course_number": "NSE 331H",
  "credits": "4",
  "description": "Introduces the concepts and applications of fluid mechanics and dimensional analysis with an emphasis on fluid behavior, internal and external flows, analysis of engineering applications of incompressible pipe systems, and external aerodynamics. CROSSLISTED as ME 331/NSE 331.",
  "prerequisites": ["ME 311", "ME 311H", "NSE 311", "NSE 311H"]
}, {
  "corequisites": [],
  "course_name": "HEAT TRANSFER",
  "course_number": "NSE 332",
  "credits": "4",
  "description": "Analyzes conductive, convective and radiative energy transfer using control volume and differential analysis and prediction of transport properties. CROSSLISTED as ME 332/NSE 332.",
  "prerequisites": ["ME 310", "NSE 310", "ME 331", "ME 331H", "NSE 331", "NSE 331H"]
}, {
  "corequisites": [],
  "course_name": "HEAT TRANSFER",
  "course_number": "NSE 332H",
  "credits": "4",
  "description": "Analyzes conductive, convective and radiative energy transfer using control volume and differential analysis and prediction of transport properties. CROSSLISTED as ME 332/NSE 332.",
  "prerequisites": ["ME 310", "NSE 310", "ME 331", "ME 331H", "NSE 331", "NSE 331H"]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO NUCLEAR REACTOR ENGINEERING",
  "course_number": "NSE 351",
  "credits": "3",
  "description": "Covers an introduction to nuclear reactor systems. Emphasizes essential principles of nuclear reactor physics and their application in reactor designs. Explores reactor types, static and dynamic system attributes, and heat generation and removal to grasp the fundamental concepts governing nuclear energy generation. Provides insights into reactor kinetics, core materials, energy conversion through theoretical exploration and practical examples. Develops foundational knowledge base in nuclear engineering, laying the groundwork for future exploration in this innovative field.",
  "prerequisites": ["NSE 235", "MTH 256", "MTH 256H"]
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "NSE 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS/DISSERTATION",
  "course_number": "NSE 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "NSE 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "NSE 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "NSE 407",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "NSE 410",
  "credits": "1-12",
  "description": "Supervised technical work experience at approved organizations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUCLEAR ETHICS AND GOVERNANCE",
  "course_number": "NSE 414",
  "credits": "3",
  "description": "Integrates the historical and ethical principles foundational to current regulations and practices impacting the nuclear sector. Explores professional engagement in the rulemaking process. Examines key nuclear regulatory agencies and major legislation featuring nuclear energy, environmental protection, and public health both domestically and internationally.",
  "prerequisites": ["NSE 236"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR RULES AND REGULATIONS",
  "course_number": "NSE 415",
  "credits": "2",
  "description": "An introduction to the key nuclear regulatory agencies; major nuclear legislation; current radiation protection standards and organizations responsible for their implementation.",
  "prerequisites": ["NSE 236"]
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS IN NUCLEAR ENGINEERING",
  "course_number": "NSE 429",
  "credits": "1-3",
  "description": "Topics associated with nuclear engineering not covered in other undergraduate courses; topics may vary from year to year.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RADIATION SHIELDING AND EXTERNAL DOSIMETRY",
  "course_number": "NSE 435",
  "credits": "4",
  "description": "Theoretical principles of shielding for neutron and gamma radiation; external dosimetry fundamentals for neutrons, photons, and charged particles; applications to problems of practical interest; analytical, numerical, and computer solutions emphasized.",
  "prerequisites": ["NSE 234", "NSE 235", "NSE 481"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR FUEL CYCLE AND WASTE MANAGEMENT",
  "course_number": "NSE 440",
  "credits": "4",
  "description": "Mining, milling, conversion, enrichment, fuel fabrication, reprocessing, and waste management of nuclear fuel, including disposal of low- and high-level radioactive waste.",
  "prerequisites": ["NSE 235"]
}, {
  "corequisites": [],
  "course_name": "MATERIALS FOR NUCLEAR ENERGY SYSTEMS",
  "course_number": "NSE 445",
  "credits": "3",
  "description": "Provides an introduction and overview of material science challenges and considerations for the construction and long-term operation of power plants, with an emphasis on nuclear power plants. Discusses advanced material science topics in the context of degradation in extreme environments typified by energy systems, including crystal structure, thermodynamic equilibrium, microstructural evolution, crystal defects, diffusion, and thermal and mechanical properties. Assesses environmental factors affecting or accelerating degradation as well as common modes of materials failure in power and energy applications.",
  "prerequisites": ["MATS 321"]
}, {
  "corequisites": [],
  "course_name": "MICROSTRUCTURE CHARACTERIZATION OF STRUCTURAL AND ENERGY MATERIALS",
  "course_number": "NSE 446",
  "credits": "4",
  "description": "Uses basic material knowledge to understand the microstructure – property relationships in materials. Explores the usage of modern examination techniques, including microstructure characterization and mechanical property assessment, to characterize and qualify materials for structural and energy applications.",
  "prerequisites": ["MATS 321", "MATS 321H"]
}, {
  "corequisites": [],
  "course_name": "NEUTRONIC ANALYSIS I",
  "course_number": "NSE 451",
  "credits": "3",
  "description": "Focuses on physical models of neutronic systems, nuclear physics, steady-state and transient neutronic system behavior; introductory neutron transport theory; one speed diffusion theory; numerical methods; fast and thermal spectrum calculations; multigroup methods; transmutation and burnup; reactor fuel management; reactivity control; perturbation theory.",
  "prerequisites": ["MTH 256", "MTH 256H", "NSE 233", "NSE 235"]
}, {
  "corequisites": [],
  "course_name": "NEUTRONIC ANALYSIS II",
  "course_number": "NSE 452",
  "credits": "3",
  "description": "Physical models of neutronic systems; nuclear physics; steady state and transient neutronic system behavior; introductory neutron transport theory, one speed diffusion theory; numerical methods; fast and thermal spectrum calculations; multigroup methods; transmutation and burnup; reactor fuel management; reactivity control; perturbation theory; neutronic laboratory sessions.",
  "prerequisites": ["NSE 451"]
}, {
  "corequisites": [],
  "course_name": "REACTOR OPERATOR TRAINING I",
  "course_number": "NSE 455",
  "credits": "3",
  "description": "The Oregon State University TRIGA reactor Operator Training I course culminates in the opportunity to take a certification test proctored by the Nuclear Regulatory Commission.",
  "prerequisites": ["NSE 236", "MTH 256", "MTH 256H"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR REACTOR LABORATORY",
  "course_number": "NSE 457",
  "credits": "2",
  "description": "Experimental investigation of the principles of nuclear reactor operation. Use of the OSU TRIGA Reactor and other laboratory facilities. Preparation and presentation of laboratory reports.",
  "prerequisites": ["NSE 451", "NSE 452"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR REACTOR THERMAL HYDRAULICS",
  "course_number": "NSE 467",
  "credits": "4",
  "description": "Hydrodynamics and conductive, convective and radiative heat transfer in nuclear reactor systems. Core heat removal design; critical heat flux, hot spot factors, single- and two-phase flow behavior. Advanced thermal hydraulic computer codes.",
  "prerequisites": ["ME 332", "ME 332H", "NSE 332", "NSE 332H"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR REACTOR SYSTEMS ANALYSIS",
  "course_number": "NSE 473",
  "credits": "3",
  "description": "Analysis of nuclear light water reactor (pressurized water reactor and boiling water reactor) design and operation, including the nuclear steam supply system, engineered safety features and balance of plant systems; regulatory design requirements; industry standards; plant engineering and instrumentation drawings. Advanced reactor system designs.",
  "prerequisites": ["NSE 452"]
}, {
  "corequisites": [],
  "course_name": "^NUCLEAR SYSTEMS DESIGN I",
  "course_number": "NSE 474",
  "credits": "4",
  "description": "Part I of a two-part series aimed at developing the student's ability to utilize fundamental nuclear and radiation protection skills to transform concepts into practical designs. Design projects involve the integration of neutronics, thermal hydraulics, safety and risk analysis, power production, materials, radiation protection, economic optimization, statistics and other skills.",
  "prerequisites": ["NSE 481"]
}, {
  "corequisites": [],
  "course_name": "^NUCLEAR SYSTEMS DESIGN II",
  "course_number": "NSE 475",
  "credits": "4",
  "description": "Part II of a two-part series aimed at developing the student's ability to utilize fundamental nuclear and radiation protection skills to transform concepts into practical designs. Design projects involve the integration of neutronics, thermal hydraulics, safety and risk analysis, power production, materials, radiation protection, economic optimization, statistics and other skills.",
  "prerequisites": ["NSE 452", "NSE 474"]
}, {
  "corequisites": [],
  "course_name": "RADIATION PROTECTION",
  "course_number": "NSE 481",
  "credits": "4",
  "description": "Explores fundamental principles and theory of radiation protection; regulatory agencies, dose units; source of radiation; biological effects and risk; dose limits; applications of external and internal dosimetry; and atmospheric dispersion.",
  "prerequisites": ["NSE 235"]
}, {
  "corequisites": [],
  "course_name": "RADIATION BIOLOGY",
  "course_number": "NSE 483",
  "credits": "3",
  "description": "Biological effects of ionizing radiation at the molecular, cellular, and organismal levels with emphasis on vertebrates; both acute and chronic radiation effects are considered.",
  "prerequisites": ["NSE 481"]
}, {
  "corequisites": [],
  "course_name": "RADIOECOLOGY",
  "course_number": "NSE 488",
  "credits": "3",
  "description": "Radionuclides in the environment: their measurement and identification, uptake and transfer through food chains. Effect of radiation on natural populations of plants and animals.",
  "prerequisites": ["NSE 481"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "NSE 499",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "NSE 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "NSE 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "NSE 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "NSE 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "NSE 507",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "NSE 510",
  "credits": "1-12",
  "description": "Supervised technical work experience at approved organizations. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUCLEAR ETHICS AND GOVERNANCE",
  "course_number": "NSE 514",
  "credits": "3",
  "description": "Integrates the historical and ethical principles foundational to current regulations and practices impacting the nuclear sector. Explores professional engagement in the rulemaking process. Examines key nuclear regulatory agencies and major legislation featuring nuclear energy, environmental protection, and public health both domestically and internationally.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUCLEAR RULES AND REGULATIONS",
  "course_number": "NSE 515",
  "credits": "2",
  "description": "An introduction to the key nuclear regulatory agencies; major nuclear legislation; current radiation protection standards and organizations responsible for their implementation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RADIOCHEMISTRY",
  "course_number": "NSE 516",
  "credits": "4",
  "description": "Selected methods in radiochemical analysis. Actinide chemistry, activation analysis, radionuclide solvent extraction, and microbial reactions with radionuclides.",
  "prerequisites": ["NSE 531", "NSE 536"]
}, {
  "corequisites": [],
  "course_name": "RADIONUCLIDES IN LIFE SCIENCES",
  "course_number": "NSE 517",
  "credits": "4",
  "description": "Chemistry of actinides and fission products, radioseparations, selected medical generators, radiolabeling of organic molecules. Designed for majors in medical physics, radiation health physics, chemistry, pharmacy.",
  "prerequisites": ["NSE 531", "NSE 536"]
}, {
  "corequisites": [],
  "course_name": "RADIOCHEMICAL ANALYSIS",
  "course_number": "NSE 519",
  "credits": "4",
  "description": "Hands-on learning of radiochemistry, practical training with open radiation sources for preparation of irradiation targets, counting samples from contaminated soils or separation of medical radionuclides. Fundamentals of chemical dosimetry are also covered. Designed for a broad range of majors in chemistry, nuclear engineering, radiation health physics, radioecology, chemical and environmental engineering.",
  "prerequisites": ["NSE 536"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR SECURITY SCIENCE",
  "course_number": "NSE 522",
  "credits": "4",
  "description": "Explores the nuclear fuel cycle from the perspective of nuclear security and safeguards and in the context of current international nuclear policies. Nuclear threats are balanced with the past history of nuclear weapons use, current nonproliferation technology, and the future international growth of the nuclear industry. Critical thinking will be assessed by way of in-class discussions, journal article reviews, written analysis of fuel cycle signatures, and conducting research. Signatures including radiological and morphological characteristics of nuclear material is introduced as well as the techniques for the detection of special nuclear materials.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUCLEAR SECURITY SYSTEM DESIGN",
  "course_number": "NSE 525",
  "credits": "3",
  "description": "Studies the science and engineering associated with the design, evaluation, and implementation of systems to secure nuclear and radiological materials. Topics include adversary characterization, target categorization and the consequences of failure to protect targets, detection and delay technologies, on-site and off-site response and response strategies, insider threat evaluation, and mathematical methods for evaluating risk due to the threat and the security system design. Students will become familiar with the components of a sustainable nuclear security program and their interconnections, and learn about the planning of nuclear security activities at both the state and facility level.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUMERICAL METHODS FOR ENGINEERING ANALYSIS",
  "course_number": "NSE 526",
  "credits": "3",
  "description": "Numerical solutions of linear equations, difference equations, ordinary and partial differential equations. CROSSLISTED as ME 526/NSE 526.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RADIOPHYSICS",
  "course_number": "NSE 531",
  "credits": "3",
  "description": "Expands understanding of concepts and applications of atomic and nuclear physics to enable continued study in nuclear engineering and health physics. Includes fundamental concepts of nuclear and atomic physics, atomic and nuclear shell structure, radioactive decay, radiation interactions, radiation biology, and the characteristics of fission.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DETECTION OF SPECIAL NUCLEAR MATERIALS",
  "course_number": "NSE 533",
  "credits": "3",
  "description": "Designed for students interested in radiation measurements and nuclear security, especially those considering PhD-level work in this area. Covers topics including special nuclear material characteristics, radiation background and it interferences with SNM, an introduction to MCNPX, a brief introduction to Geant4, detection of SNM via counting or imaging, localization of SNM; and characterization of SNM.",
  "prerequisites": ["NSE 536"]
}, {
  "corequisites": [],
  "course_name": "APPLIED DETECTION FOR NUCLEAR SECURITY",
  "course_number": "NSE 534",
  "credits": "3",
  "description": "Applied detection techniques currently being deployed globally for nuclear security are presented in lectures and explored in practical exercises. A prominent feature of this class is the unique opportunity to complete the Nuclear Security Education Program (NSEP) Training program hosted at the HAMMER federal training center.",
  "prerequisites": ["NSE 536"]
}, {
  "corequisites": [],
  "course_name": "RADIATION SHIELDING AND EXTERNAL DOSIMETRY",
  "course_number": "NSE 535",
  "credits": "4",
  "description": "Theoretical principles of shielding for neutron and gamma radiation; external dosimetry fundamentals for neutrons, photons, and charged particles; applications to problems of practical interest; analytical, numerical, and computer solutions emphasized.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED RADIATION DETECTION AND MEASUREMENT",
  "course_number": "NSE 536",
  "credits": "4",
  "description": "Principles and mechanisms underlying nuclear radiation detection and measurements; operation of nuclear electronic laboratory instrumentation; application of gas-filled, scintillation and semiconductor laboratory detectors for measurement of alpha, beta, gamma, and neutron radiation, liquid scintillation equipment; use of Bonner spheres for neutron energy profiles; experimental investigation of interactions of radiation with matter. Lec/lab.",
  "prerequisites": ["NSE 531"]
}, {
  "corequisites": [],
  "course_name": "DIGITAL RADIATION MEASUREMENT AND SPECTROSCOPY",
  "course_number": "NSE 537",
  "credits": "3",
  "description": "Principles of digital spectroscopy; application of digital filters in digital processing of detector pulses; hardware implementation of a typical digital spectrometer; introduction of Field-Programmable Gate Array (FPGA) devices programming a digital spectrometer using Hardware Description Language (VHDL); simulation, synthesis and spectroscopy; experimental design tests and evaluation. Lec/lab.",
  "prerequisites": ["NSE 536"]
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS IN INTERACTION OF NUCLEAR RADIATION",
  "course_number": "NSE 539",
  "credits": "1-6",
  "description": "Topics associated with interactions of nuclear radiation not covered in other graduate courses; topics may vary from year to year.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUCLEAR FUEL CYCLE AND WASTE MANAGEMENT",
  "course_number": "NSE 540",
  "credits": "4",
  "description": "Mining, milling, conversion, enrichment, fuel fabrication, reprocessing, and waste management of nuclear fuel, including disposal of low- and high-level radioactive waste.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MATERIALS FOR NUCLEAR ENERGY SYSTEMS",
  "course_number": "NSE 545",
  "credits": "3",
  "description": "Provides an introduction and overview of material science challenges and considerations for the construction and long-term operation of power plants, with an emphasis on nuclear power plants. Discusses advanced material science topics in the context of degradation in extreme environments typified by energy systems, including crystal structure, thermodynamic equilibrium, microstructural evolution, crystal defects, diffusion, and thermal and mechanical properties. Assesses environmental factors affecting or accelerating degradation as well as common modes of materials failure in power and energy applications.",
  "prerequisites": ["MATS 570"]
}, {
  "corequisites": [],
  "course_name": "MICROSTRUCTURE CHARACTERIZATION OF STRUCTURAL AND ENERGY MATERIALS",
  "course_number": "NSE 546",
  "credits": "4",
  "description": "Uses basic material knowledge to understand the microstructure – property relationships in materials. Explores the usage of modern examination techniques, including microstructure characterization and mechanical property assessment, to characterize and qualify materials for structural and energy applications.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS IN NUCLEAR FUEL CYCLE ANALYSIS",
  "course_number": "NSE 549",
  "credits": "1-6",
  "description": "Topics associated with the nuclear fuel cycle not covered in other graduate courses; topics may vary from year to year.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NEUTRONIC ANALYSIS I",
  "course_number": "NSE 551",
  "credits": "3",
  "description": "Focuses on physical models of neutronic systems, nuclear physics, steady-state and transient neutronic system behavior; introductory neutron transport theory; one speed diffusion theory; numerical methods; fast and thermal spectrum calculations; multigroup methods; transmutation and burnup; reactor fuel management; reactivity control; perturbation theory.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NEUTRONIC ANALYSIS II",
  "course_number": "NSE 552",
  "credits": "3",
  "description": "Physical models of neutronic systems; nuclear physics; steady state and transient neutronic system behavior; introductory neutron transport theory; one speed diffusion theory; numerical methods; fast and thermal spectrum calculations; multigroup methods; transmutation and burnup; reactor fuel management; reactivity control; perturbation theory; neutronic laboratory sessions.",
  "prerequisites": ["NSE 551"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED NUCLEAR REACTOR PHYSICS",
  "course_number": "NSE 553",
  "credits": "3",
  "description": "Advanced analytic and numerical techniques for the prediction of the neutron population in nuclear reactor systems. Topic will include long characteristic neutron transport, collision probabilities, nodal methods, equivalence theory, and perturbation theory.",
  "prerequisites": ["NSE 551", "NSE 552"]
}, {
  "corequisites": [],
  "course_name": "REACTOR OPERATOR TRAINING I",
  "course_number": "NSE 555",
  "credits": "3",
  "description": "The Oregon State University TRIGA reactor Operator Training I course culminates in the opportunity to take a certification test proctored by the Nuclear Regulatory Commission.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUCLEAR REACTOR LABORATORY",
  "course_number": "NSE 557",
  "credits": "2",
  "description": "Experimental investigation of the principles of nuclear reactor operation. Use of the OSU TRIGA Reactor and other laboratory facilities. Preparation and presentation of laboratory reports.",
  "prerequisites": ["NSE 551", "NSE 552"]
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS IN NUCLEAR REACTOR ANALYSIS",
  "course_number": "NSE 559",
  "credits": "1-3",
  "description": "Topics associated with nuclear reactor theory not covered in other graduate courses; topics may vary from year to year.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED THERMAL HYDRAULICS",
  "course_number": "NSE 565",
  "credits": "3",
  "description": "Explores advanced topics in the computational modeling and simulation of the thermal-hydraulic phenomena of nuclear reactors. Focuses on steady-state and transient solutions of one-dimensional nuclear reactor thermal hydraulic models. Analyzes reactor behavior during various accident scenarios. Uses Computational Fluid Dynamics (CFD) modeling techniques as it applies to thermal- hydraulic problems in nuclear reactors. Applies verification, validation and error and uncertainty quantification in nuclear reactors thermal-hydraulic modeling.",
  "prerequisites": ["NSE 567"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR REACTOR THERMAL HYDRAULICS",
  "course_number": "NSE 567",
  "credits": "4",
  "description": "Hydrodynamics and conductive, convective and radiative heat transfer in nuclear reactor systems. Core heat removal design; critical heat flux, hot spot factors, single- and two-phase flow behavior. Advanced thermal hydraulic computer codes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUCLEAR REACTOR SAFETY",
  "course_number": "NSE 568",
  "credits": "3",
  "description": "Focused on probability risk assessment and system reliability analysis techniques applied to nuclear reactor safety. Application of these methods will be performed specifically through examination of neutronics and thermal hydraulic transients, effectiveness of emergency systems, accident prevention and mitigation, and assessment of radioactive release to the environment.",
  "prerequisites": ["NSE 551", "NSE 567"]
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS IN NUCLEAR REACTOR ENGINEERING",
  "course_number": "NSE 569",
  "credits": "1-6",
  "description": "Advanced nuclear engineering design concepts, reactor systems analysis techniques and innovative nuclear engineering applications. Artificial intelligence and expert system applications to nuclear engineering problems. Topics may vary from year to year.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUCLEAR REACTOR SYSTEMS ANALYSIS",
  "course_number": "NSE 573",
  "credits": "3",
  "description": "Analysis of nuclear light water reactor (pressurized water reactor and boiling water reactor) design and operation, including the nuclear steam supply system, engineered safety features and balance of plant systems; regulatory design requirements; industry standards; plant engineering and instrumentation drawings. Advanced reactor system designs.",
  "prerequisites": ["NSE 552"]
}, {
  "corequisites": [],
  "course_name": "NUCLEAR SYSTEMS DESIGN I",
  "course_number": "NSE 574",
  "credits": "4",
  "description": "Part I of a two-part series aimed at developing the student's ability to utilize fundamental nuclear and radiation protection skills to transform concepts into practical designs. Design projects involve the integration of neutronics, thermal hydraulics, safety and risk analysis, power production, materials, radiation protection, economic optimization, statistics and other skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NUCLEAR SYSTEMS DESIGN II",
  "course_number": "NSE 575",
  "credits": "4",
  "description": "Part II of a two-part series aimed at developing the student's ability to utilize fundamental nuclear and radiation protection skills to transform concepts into practical designs. Design projects involve the integration of neutronics, thermal hydraulics, safety and risk analysis, power production, materials, radiation protection, economic optimization, statistics and other skills.",
  "prerequisites": ["NSE 551", "NSE 552", "NSE 574"]
}, {
  "corequisites": [],
  "course_name": "APPLIED RADIATION SAFETY",
  "course_number": "NSE 582",
  "credits": "4",
  "description": "Application of radiation protection as practiced in the fields of nuclear science and engineering; application of health physics principles to reduce health hazards at each of the following stages: design, prevention, assessment, and post-incident. A history of key nuclear regulatory agencies; early and current radiation protection standards and organizations responsible for their formulation; major nuclear legislation; pertinent nuclear rules and regulations and their application. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RADIATION BIOLOGY",
  "course_number": "NSE 583",
  "credits": "3",
  "description": "Biological effects of ionizing radiation at the molecular, cellular, and organismal levels with emphasis on vertebrates; both acute and chronic radiation effects are considered.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RADIOECOLOGY",
  "course_number": "NSE 588",
  "credits": "3",
  "description": "Radionuclides in the environment: their measurement and identification, uptake and transfer through food chains. Effect of radiation on natural populations of plants and animals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNAL DOSIMETRY",
  "course_number": "NSE 590",
  "credits": "3",
  "description": "Further development and more in-depth treatment of internal dosimetry concepts, theoretical basis of energy deposition, biokinetics, and estimation of radiation risk from ingested, inhaled, or injected radionuclides.",
  "prerequisites": ["NSE 531", "NSE 535"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "NSE 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "NSE 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "NSE 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "NSE 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "NSE 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "NSE 607",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "NSE 610",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPUTATIONAL PARTICLE TRANSPORT",
  "course_number": "NSE 654",
  "credits": "3",
  "description": "Properties of and methods for solution of the linear Boltzmann equation for nuclear reactors; spherical and double-spherical harmonics; integral equation methods; Monte Carlo methods.",
  "prerequisites": ["NSE 551", "NSE 552"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED THERMAL HYDRAULICS",
  "course_number": "NSE 667",
  "credits": "3",
  "description": "Advanced topics in single- and two-phase hydrodynamics and heat transfer for nuclear reactors. Two-phase flow patterns, flow instabilities, condensation induced transients, convective boiling heat transfer, and current topics in reactor safety thermal hydraulics. Offered alternate years.",
  "prerequisites": ["NSE 567"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "NSE 699",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "NSE 808",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}]