[{
  "corequisites": [],
  "course_name": "INFORMATICS IN NURSING",
  "course_number": "NUR 411",
  "credits": "1",
  "description": "Provides an overview of nursing informatics as a means to improve information management in healthcare. Consideration of healthcare technologies with ethical and financial criteria in relation to the quality of their outcomes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TRANSITION TO PROFESSIONAL NURSING",
  "course_number": "NUR 412",
  "credits": "3",
  "description": "Provides an overview of the nursing metaparadigm: client, nurse, health/illness and environment. Nursing theoretical perspectives will be discussed as a foundation for professional nursing practice as care provider and manager of care. Special emphasis will be on the practice of the baccalaureate nurse.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED HEALTH ASSESSMENT",
  "course_number": "NUR 413",
  "credits": "3",
  "description": "Builds on previous health assessment knowledge and skills, focusing on comprehensive health assessment skills. Using a lifespan approach, students examine the physical, cultural, psychosocial, spiritual and nutritional variables through the use of health history and health assessment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NURSING EPIDEMIOLOGY",
  "course_number": "NUR 414",
  "credits": "3",
  "description": "Presents the basic concepts and methods of epidemiology applied to population focused health care and nursing practice. Emphasis is placed on the use of epidemiologic reasoning in deriving inferences about the etiology of health outcomes from population data and in guiding the design of health service programs.",
  "prerequisites": [["ST 201", "ST 243Z"]]
}, {
  "corequisites": [],
  "course_name": "*NURSING PRACTICE IN A MULTICULTURAL SOCIETY",
  "course_number": "NUR 415",
  "credits": "3",
  "description": "Provides an overview of the influence of culture on health care practices and the delivery of nursing care for individuals, groups, and communities. Emphasis is on increasing awareness of culturally diverse nursing care and the impact of cultural beliefs, values, and practices upon health and health care delivery.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "POPULATION-FOCUSED AND COMMUNITY-BASED NURSING PRACTICE I",
  "course_number": "NUR 416",
  "credits": "4",
  "description": "Introduces the concepts and principles of community health and the practice of evidence-based community health nursing. The nursing process is applied to the care of individuals, families, and groups within the community. Emphasis on health promotion and illness prevention. Consideration of cultural competence in nursing care. Application of community health nursing principles occurs in the 54-hour independent clinical practicum under the supervision of the faculty.",
  "prerequisites": [["NUR 413"]]
}, {
  "corequisites": [],
  "course_name": "POPULATION-FOCUSED AND COMMUNITY-BASED NURSING PRACTICE II",
  "course_number": "NUR 417",
  "credits": "5",
  "description": "Builds on NUR 416 through the application of the theories and principles of population-focused nursing in a community setting. Emphasis will be on community health measures which promote and maintain the health of the community. Application of community health nursing principles occurs in the 54-hour independent clinical practicum under the supervision of the faculty.",
  "prerequisites": [["NUR 416"]]
}, {
  "corequisites": [],
  "course_name": "HEALTH CARE SYSTEM ISSUES IN NURSING PRACTICE",
  "course_number": "NUR 418",
  "credits": "3",
  "description": "Consideration of the current and emerging forces that will affect health care delivery across the health care continuum. Issues related to health-care relevant policy, finance, and regulation, with special attention to the impacts on nursing care will be included.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTH CARE QUALITY IN NURSING PRACTICE",
  "course_number": "NUR 419",
  "credits": "2",
  "description": "Explores strategies that contribute to building a culture of safe, quality nursing practice. The focus is on incorporating quality assessment and improvement strategies as evidence based practice in an interdisciplinary environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^NURSING RESEARCH AND EVIDENCE-BASED PRACTICE",
  "course_number": "NUR 420",
  "credits": "4",
  "description": "Overview of the research process and utilization in professional nursing practice. Discussion of evidence-based practice as the foundation for safe, quality care. Reading and interpreting current research, and using writing as a tool for learning on a critical issue in nursing will be the focus of this course.",
  "prerequisites": [["NUR 414"]]
}, {
  "corequisites": [],
  "course_name": "AGING AND END OF LIFE ISSUES IN NURSING",
  "course_number": "NUR 421",
  "credits": "3",
  "description": "Overview of the impact of the aging population on health care. Common ethical dilemmas encountered in health care will be explored. Application of ethical principles to the complicated situations encountered by inter-professional teams, with special consideration of those related to end-of-life care for the professional nurse.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTH PROMOTION IN NURSING PRACTICE",
  "course_number": "NUR 422",
  "credits": "3",
  "description": "Builds on prior learning and focuses on preventative health care and health promotion for individuals, families, and communities. Consideration is given to the influence of culture and lifespan development. Using biophysical, environmental, spiritual, sociocultural and economic determinants of health, the focus is on the role of nurses in improving health outcomes with individuals, families, and communities.",
  "prerequisites": [["NUR 413"]]
}, {
  "corequisites": [],
  "course_name": "NURSING LEADERSHIP",
  "course_number": "NUR 423",
  "credits": "4",
  "description": "Explores the role of the nurse leader, integrating prior learning with an understanding of the nature of leadership as well as leadership and management theories. An introduction to the principles of project management with application to a clinical leadership project is included. Consideration of individual student growth, particularly related to the student outcomes of the program and personal goals for future growth will be a focus. Application of the content will occur in the 54-hour independent clinical practicum, under the direction of the faculty, to develop and implement a clinical leadership project.",
  "prerequisites": []
}]