[{
  "corequisites": [],
  "course_name": "UNDERGRADUATE RESEARCH",
  "course_number": "OC 003",
  "credits": "0",
  "description": "Engage in research activities appropriate to the discipline; and through the research experience, acquire skills, techniques, and knowledge relevant to the field of study. In consultation with a faculty mentor, engage in research activity, and make and execute a plan for a project.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "OC 004",
  "credits": "0",
  "description": "Provides basic personal and professional skills that can be used within and outside of a work setting. Through practice, this experience guides students in building and maintaining positive professional relationships, networking/mentoring relationships, and enhances students’ understanding of the connection between theory and practice in their respective disciplines.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*EXPLORING THE DEEP: GEOGRAPHY OF THE WORLD'S OCEANS",
  "course_number": "OC 103",
  "credits": "4",
  "description": "Introduces non-science students to the oceans, including marine geology and chemistry, ocean currents, coastal and biological processes. Field trip required, transportation fee charged. Lec/lab. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN OCEANOGRAPHY",
  "course_number": "OC 199",
  "credits": "1-4",
  "description": "Introduction to topics of current interest in oceanography for lower-division undergraduates. May be repeated for credit when topic varies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*OCEANOGRAPHY",
  "course_number": "OC 201",
  "credits": "4",
  "description": "Plate tectonics and the geological structure of ocean basins; physical and chemical properties of seawater; Earth's energy budget; large-scale circulation of the atmosphere and ocean; marine sediment properties and transport; Earth history recorded in marine sediments; the carbon cycle in the atmosphere and sea; and the ecology of pelagic and benthic systems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*OCEANOGRAPHY",
  "course_number": "OC 201H",
  "credits": "4",
  "description": "Plate tectonics and the geological structure of ocean basins; physical and chemical properties of seawater; Earth's energy budget; large-scale circulation of the atmosphere and ocean; marine sediment properties and transport; Earth history recorded in marine sediments; the carbon cycle in the atmosphere and sea; and the ecology of pelagic and benthic systems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "+*INTRODUCTION TO BIOLOGICAL OCEANOGRAPHY",
  "course_number": "OC 202",
  "credits": "4",
  "description": "Examines critical processes and patterns of life in the ocean and how they affect the air we breathe, the food we eat, and the habitability of the planet. Explores principles and practice of biological oceanography as an interdisciplinary science, focusing on origins of life; energy capture and trophic transfers; diverse organisms and habitats; and contributions by historic and current scientists. Observations, experiments, and analyses during laboratory classes reinforce concepts, and provide hands-on practice with contemporary methods and technologies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO FIELD OCEANOGRAPHY - LAND",
  "course_number": "OC 295",
  "credits": "1",
  "description": "OC 295 is preparatory for the intensive OC 296 field portion at sea. Students will learn about the collection of samples and data using methods and instruments that are common in sea-going oceanography and help plan the cruise.",
  "prerequisites": [["OC 201", "OC 201H"]]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO FIELD OCEANOGRAPHY - SEA",
  "course_number": "OC 296",
  "credits": "2",
  "description": "The sea-going field portion of OC 295 onboard a large research vessel. During the multi-day cruise students will collect oceanographic data and samples from the coastal ocean. Students who complete OC 295 and OC 296 will learn how to collect data and samples on the high seas, conduct preliminary analyses of data, and contribute to the development of scientific knowledge. Serves as an introduction to upper-division course work in oceanography.",
  "prerequisites": [["OC 295"]]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO PHYSICAL OCEANOGRAPHY",
  "course_number": "OC 298",
  "credits": "4",
  "description": "Identifies and describes fundamental physical oceanographic phenomena with an emphasis on large-scale physical property variability and ocean circulation. Addresses topical aspects such as stratification, light in the ocean, mixing, boundary layer processes, coastal upwelling, and ocean eddies. Explains non-intuitive behavior of fluids on a rotating planet. Emphasizes physical processes related to biological, chemical, and geological oceanography. Examines Earth's global energy balance through the synthesis of the physical processes. Uses simplified predictive models to test theoretical concepts.",
  "prerequisites": [["OC 201", "OC 201H"], ["MTH 112", "MTH 112Z", "MTH 251", "MTH 251H"]]
}, {
  "corequisites": [],
  "course_name": "OCEANOGRAPHIC DATA ANALYSIS",
  "course_number": "OC 301",
  "credits": "4",
  "description": "Applies quantitative and graphical methods to characterize and to test relationships between diverse oceanographic data. Develops skills to interpret data based on source, timescale, and statistics. Enhances proficiency in communicating conclusions and uncertainties regarding relationships between ocean processes.",
  "prerequisites": [["OC 201", "OC 201H"], ["ST 351", "ST 351H"]]
}, {
  "corequisites": [],
  "course_name": "COASTAL OCEANOGRAPHY",
  "course_number": "OC 332",
  "credits": "3",
  "description": "Examines aspects of the physics, geology, biology and chemistry of the coastal ocean. Describes and explains fundamental features and processes of the coastal ocean, including waves, tides and tsunamis, beach erosion, wind-driven upwelling, El Niño and climate change. Uses and analyzes online data sources, and gain experience interpreting and displaying data about conditions in the coastal ocean. Evaluates relationships between wind, waves and the response of the coastal ocean to predict the short- and long-term variability.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*OCEANS",
  "course_number": "OC 333",
  "credits": "COASTS",
  "description": "Explores contemporary issues related to human interactions with our oceans and coastal zone at global, regional and local scales. Uses perspectives from the natural and social sciences to analyze the origins of these interactions. Evaluates how changes to the way oceans coasts and people interact can lead to changes in ocean and coastal health and the wellbeing of diverse stakeholders. Identifies evidence-based mitigation and adaptation solutions to improve the resilience of interconnected human, coastal and ocean systems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BIOLOGICAL OCEANOGRAPHY",
  "course_number": "OC 340",
  "credits": "4",
  "description": "Covers advanced examination of the ocean as an ecosystem with emphasis on the processes affecting the production and structure of oceanic communities. Examines flow of energy and matter from primary producers through primary consumers up to higher trophic levels and assess the impacts of physical and chemical oceanic environment on these flows. Examines microbial and benthic processes. Discusses current topics including, such as hypoxia, ocean acidification and harmful algal blooms.",
  "prerequisites": [["OC 201", "OC 201H"], ["BI 221", "BI 221H"]]
}, {
  "corequisites": [],
  "course_name": "CHEMICAL OCEANOGRAPHY",
  "course_number": "OC 350",
  "credits": "4",
  "description": "Examines chemical properties and processes in the ocean, including composition of sea water, elemental fluxes, and chemical reactions across marine interfaces. Explores reservoirs, sources, and sinks of the major and minor element found in seawater, and the use of tracers and isotopic clocks to study oceanic biogeochemical cycles. Emphasizes interactions between biological, chemical, and physical processes as well as thermodynamic and kinetic predictions for reactions in seawater. Applies oceanographic data analysis tools to determine processes that control the distribution of major nutrients, carbon, and trace metals.",
  "prerequisites": [["CH 122", "CH 232", "CH 232H"]]
}, {
  "corequisites": [],
  "course_name": "GEOLOGICAL OCEANOGRAPHY",
  "course_number": "OC 360",
  "credits": "4",
  "description": "Examines sedimentary (mainly) processes and products in the ocean and their significance, including the large-scale structure and geomorphology of the ocean basins and margins; how sediment is delivered to (or produced in) the ocean; how waves, currents, and gravity redistribute it; and how it accumulates in various depositional environments to form the stratigraphic record. Covers methods and challenges of deciphering sedimentary archives to better understand Earth history on time scales of events to millions of years.",
  "prerequisites": [["GEO 201", "OC 201", "OC 201H"], ["MTH 227", "MTH 241", "MTH 241H", "MTH 245", "MTH 251", "MTH 251H"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN OCEANOGRAPHY",
  "course_number": "OC 399",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN OCEANOGRAPHY",
  "course_number": "OC 399H",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH PROJECTS",
  "course_number": "OC 401",
  "credits": "1-16",
  "description": "Field and laboratory research in oceanography for undergraduates, resulting in a written report.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "OC 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "OC 405",
  "credits": "1-4",
  "description": "Independent library research and reading in specialized topics in oceanography for undergraduates, guided by discussions in conferences with faculty. A written report may be required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "OC 407",
  "credits": "1-3",
  "description": "Undergraduate seminar on current developments in the oceanographic research literature, with student presentations and group discussions. A written report may be required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "OC 407H",
  "credits": "1-3",
  "description": "Undergraduate seminar on current developments in the oceanographic research literature, with student presentations and group discussions. A written report may be required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "OC 410",
  "credits": "1-16",
  "description": "Pre-career professional experience under joint faculty and employer supervision.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF PHYSICAL OCEANOGRAPHY",
  "course_number": "OC 430",
  "credits": "4",
  "description": "Fundamental principles of physical oceanography; conservation of mass, heat, momentum and vorticity; equations governing motion in the ocean; geostrophy; planetary boundary layers; wind-driven and thermohaline circulation. Descriptive oceanography; application of the fundamental principles to the ocean; examination of the major current systems; water mass analysis. Offered annually.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COASTAL AND ESTUARINE OCEANOGRAPHY",
  "course_number": "OC 433",
  "credits": "3",
  "description": "Circulation of the coastal ocean including continental shelf circulation, upwelling, coastal jets, undercurrents, coastal-trapped waves. Fundamentals of surface waves and tides; tsunamis, wind generation, breaking waves. Estuary classification and circulation patterns; shallow-water processes and beach morphology. Offered alternate years.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ESTUARINE ECOLOGY",
  "course_number": "OC 434",
  "credits": "4",
  "description": "Integrated and synthetic training in the ecological processes of estuarine environments, with emphases on ecological interactions among organisms and the biogeochemical cycling of carbon and nitrogen. Topics include geomorphology, estuarine physics and chemistry, primary and secondary producers, ecosystem metabolism, element cycling, food webs, fisheries, restoration, management, and impacts of climate. Field trip required, transportation fee charged. CROSSLISTED as FW 434/OC 434.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACOUSTICAL OCEANOGRAPHY",
  "course_number": "OC 436",
  "credits": "3",
  "description": "Explore the principles of using sound as a sampling tool and the applications of acoustics in a variety of marine disciplines. Examine the physics of underwater sound and sound propagation in the ocean, including the effects of oceanographic variability such as temperature/salinity stratification, seafloor/surface reflections, internal waves, turbulence, and presence of biological organisms. Break down the principles underlying acoustic remote sensing methods in oceanography including sonar, sub-bottom profilers, acoustic tomography, and passive acoustic detection. Explore modern research in acoustical oceanography, and the associated scientific literature.",
  "prerequisites": [["PH 213", "PH 213H"], ["OC 430"]]
}, {
  "corequisites": [],
  "course_name": "^POLAR OCEANOGRAPHY",
  "course_number": "OC 444",
  "credits": "3",
  "description": "Explores the physical, chemical and biological oceanography of the Arctic and Antarctic and examines anthropogenic impacts; both direct (resource utilization), and indirect (climate change). Covers a broad range of topics to introduce students to polar oceanography through a series of lectures, interactive classes, documentaries, relevant literature, the analysis of real polar data, and a range of formal and informal written assignments aimed at a variety of audiences. Promotes authentic scientific inquiry and enhances communication skills.",
  "prerequisites": [["OC 298"], ["OC 340"], ["OC 350"]]
}, {
  "corequisites": [],
  "course_name": "ECOLOGICAL THEORIES IN BIOLOGICAL AND FISHERIES OCEANOGRAPHY DATA",
  "course_number": "OC 449",
  "credits": "4",
  "description": "Students will learn the ecological theories applied in fisheries oceanography research and analytical techniques used to quantify fisheries oceanography processes. Sessions will be presented in the context of fundamental ecological research, including effects of environmental and climate variability on production and distribution of species and communities. A specific emphasis is toward analyses of large spatio-temporal data.",
  "prerequisites": [["MTH 252", "MTH 252H", "MTH 228"], ["ST 351", "ST 351H"], ["OC 440", "BI 370", "BI 370H"]]
}, {
  "corequisites": [],
  "course_name": "CHEMISTRY OF NATURAL WATERS",
  "course_number": "OC 453",
  "credits": "4",
  "description": "Explores fundamental concepts for understanding the thermodynamics and kinetics of chemical changes in natural waters. Applies techniques for predicting the speciation and reactions of gaseous, dissolved and solid phases, with an emphasis on quantifying equilibrium chemistry. Focuses on a range of natural environments including oceans, rivers, lakes, groundwaters, and soils in order to develop an intuition of the behavior of chemicals in nature. Emphasizes acid-base chemistry, gas-liquid equilibrium, metal chemistry, surface chemistry, oxidation and reduction chemistry.",
  "prerequisites": [["CH 123", "CH 233", "CH 233H"]]
}, {
  "corequisites": [],
  "course_name": "CENOZOIC PALEOCEANOGRAPHY",
  "course_number": "OC 465",
  "credits": "3",
  "description": "Examines key intervals of the Earth’s ocean-climate history over the past 65 million years and events that have acted to have a major effect on the Earth’s climate including processes that have changed ocean circulation (plate tectonics, ocean basin evolution), climate forcing mechanisms, and ocean biology/productivity. Reviews commonly used paleoceanographic techniques including proxies used to reconstruct ocean temperatures, productivity, and oxygen.",
  "prerequisites": [["OC 201", "OC 201H"], ["GEO 201", "GEO 202", "GEO 202H"]]
}, {
  "corequisites": [],
  "course_name": "EARLY LIFE HISTORY OF FISHES",
  "course_number": "OC 474",
  "credits": "4",
  "description": "Overview of diversity of development patterns in fishes; emphasis on morphology, life history, and evolution. Offered alternate years. CROSSLISTED as FW 474/OC 474.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED FIELD OCEANOGRAPHY 1",
  "course_number": "OC 495",
  "credits": "2",
  "description": "Design a field-based research project based on a synthesis of relevant oceanographic literature and relevant sampling techniques. Prepare and plan for an oceanographic cruise or data collection effort for a student-led research project.",
  "prerequisites": [["OC 340", "OC 350", "OC 360"], ["OC 340", "OC 350", "OC 360"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED FIELD OCEANOGRAPHY 2",
  "course_number": "OC 496",
  "credits": "4",
  "description": "Participate in the collection of oceanographic data and samples as described in research proposals previously submitted as part of OC 495. Analyze data and samples as described in research plans and prepare a written report of findings.",
  "prerequisites": [["OC 495"]]
}, {
  "corequisites": [],
  "course_name": "GRAND CHALLENGES IN OCEANOGRAPHY",
  "course_number": "OC 498",
  "credits": "3",
  "description": "Examines how natural and anthropogenic perturbations of the ocean propagate across spatial and temporal scales and how observations and conceptual models have been used to identify and constrain ocean processes and state variables. Integrates knowledge and information across a range of oceanographic disciplines, including physics, chemistry, geology, and biology. Explores the practical and ethical challenges of learning how the ocean modulates climate and provides economic resources to a variety of stakeholders at local, regional and global scales.",
  "prerequisites": [["OC 332"], ["OC 333"], ["OC 340"], ["OC 350"], ["OC 360"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN OCEANOGRAPHY",
  "course_number": "OC 499",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "OC 501",
  "credits": "1-16",
  "description": "Original research work that will not be part of the data used in a thesis.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "OC 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "OC 505",
  "credits": "1-16",
  "description": "Independent reading and library research on specialized topics in oceanography, guided by discussions with supervising faculty. A written report may be required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "OC 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "OC 507",
  "credits": "1-3",
  "description": "Student presentations and discussions of current research literature or personal research results. Original research presentations by visiting scientists, OSU faculty and graduate students presenting final thesis results. Other sections and specific topics by arrangement.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "OC 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BASIC MATLAB FOR ENVIRONMENTAL SCIENTISTS AND ENGINEERS",
  "course_number": "OC 512",
  "credits": "2",
  "description": "MATLAB desktop environment will be introduced and basic programming and data analysis skills will be developed, with an emphasis on writing optimized routines to analyze data sets utilizing matrix algebra and vectorization of functions. Basic graphics and visualization will be covered, including two-dimensional and three-dimensional graphing, contouring and movies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OREGON COAST MATH CAMP",
  "course_number": "OC 515",
  "credits": "3",
  "description": "Selected topics from differential calculus, integral calculus, ordinary and partial differential equations, statistics, linear algebra and vector calculus. Two-week course taught at Hatfield Marine Science Center in Newport, Oregon, before fall term begins.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OCEAN BIOGEOCHEMICAL DYNAMICS",
  "course_number": "OC 522",
  "credits": "4",
  "description": "Examines what keeps ocean systems in balance, and determines their response to perturbation. Covers connections between physical transport and biogeochemical reaction rates and energetics, taught from the perspective of key ocean biogeochemical cycles.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OCEAN ECOLOGICAL DYNAMICS",
  "course_number": "OC 523",
  "credits": "4",
  "description": "Major characteristics of ocean biota and ocean ecosystems. Main themes will be centered on the bioenergetics of marine systems at levels ranging from the individual to ocean biomes, and on how ocean biota facilitates diverse marine biogeochemical processes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MICROPROBE ANALYSIS",
  "course_number": "OC 528",
  "credits": "3",
  "description": "Theory and application of electron microprobe analysis to problems in geology, engineering, chemistry, physics, and biology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COASTAL AND ESTUARINE OCEANOGRAPHY",
  "course_number": "OC 533",
  "credits": "3",
  "description": "Circulation of the coastal ocean including continental shelf circulation, upwelling, coastal jets, undercurrents, coastal-trapped waves. Fundamentals of surface waves and tides; tsunamis, wind generation, breaking waves; shallow-water processes and beach morphology. Offered alternate years.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ESTUARINE ECOLOGY",
  "course_number": "OC 534",
  "credits": "4",
  "description": "Integrated and synthetic training in the ecological processes of estuarine environments, with emphases on ecological interactions among organisms and the biogeochemical cycling of carbon and nitrogen. Topics include geomorphology, estuarine physics and chemistry, primary and secondary producers, ecosystem metabolism, element cycling, food webs, fisheries, restoration, management, and impacts of climate. Field trip required, transportation fee charged. CROSSLISTED as FW 534/OC 534.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACOUSTICAL OCEANOGRAPHY",
  "course_number": "OC 536",
  "credits": "3",
  "description": "Explore the principles of using sound as a sampling tool and the applications of acoustics in a variety of marine disciplines. Examine the physics of underwater sound and sound propagation in the ocean, including the effects of oceanographic variability such as temperature/salinity stratification, seafloor/surface reflections, internal waves, turbulence, and presence of biological organisms. Break down the principles underlying acoustic remote sensing methods in oceanography including sonar, sub-bottom profilers, acoustic tomography, and passive acoustic detection. Explore modern research in acoustical oceanography, and the associated scientific literature.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECOLOGICAL THEORIES IN BIOLOGICAL AND FISHERIES OCEANOGRAPHY DATA",
  "course_number": "OC 549",
  "credits": "4",
  "description": "Students will learn the ecological theories applied in fisheries oceanography research and analytical techniques used to quantify fisheries oceanography processes. Sessions will be presented in the context of fundamental ecological research, including effects of environmental and climate variability on production and distribution of species and communities. A specific emphasis is toward analyses of large spatio-temporal data.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CHEMISTRY OF NATURAL WATERS",
  "course_number": "OC 553",
  "credits": "4",
  "description": "Explores fundamental concepts for understanding the thermodynamics and kinetics of chemical changes in natural waters. Applies techniques for predicting the speciation and reactions of gaseous, dissolved and solid phases, with an emphasis on quantifying equilibrium chemistry. Focuses on a range of natural environments including oceans, rivers, lakes, groundwaters, and soils in order to develop an intuition of the behavior of chemicals in nature. Emphasizes acid-base chemistry, gas-liquid equilibrium, metal chemistry, surface chemistry, oxidation and reduction chemistry.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEDIMENTARY PROCESSES IN THE OCEAN BASINS",
  "course_number": "OC 562",
  "credits": "3",
  "description": "An integrated view of sediment processes in the ocean basins from a source to sink perspective, with a special emphasis on the interpretation of the historical record.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EARLY LIFE HISTORY OF FISHES",
  "course_number": "OC 574",
  "credits": "4",
  "description": "Overview of diversity of development patterns in fishes; emphasis on morphology, life history, and evolution. Offered alternate years. CROSSLISTED as FW 574/OC 574.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN OCEANOGRAPHY",
  "course_number": "OC 599",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "OC 601",
  "credits": "1-16",
  "description": "Original research work that will not be part of the data used in a thesis.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "OC 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "OC 605",
  "credits": "1-16",
  "description": "Independent reading and library research on specialized topics in oceanography, guided by discussions with supervising faculty. A written report may be required.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "OC 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "OC 607",
  "credits": "1-3",
  "description": "Student presentations and discussion of current research literature or personal research results. Original research presentations by visiting scientists, OSU faculty and graduate students presenting final thesis results. Other sections and specific topics by arrangement.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "OC 608",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OCEAN WAVE MECHANICS I",
  "course_number": "OC 630",
  "credits": "3",
  "description": "Linear wave boundary value problem formulation and solution, water particle kinematics, shoaling, refraction, diffraction, and reflection. Linear long wave theory with applications to tides, seiching, and storm surge. CROSSLISTED as CE 630/OC 630.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OCEAN WAVE MECHANICS II",
  "course_number": "OC 631",
  "credits": "3",
  "description": "Second in the sequence of ocean wave engineering mechanics, covers the following topics: introduction to long wave theory, wave superposition, wave height distribution, and the wind-wave spectrum, introduction to wave forces, and basic nonlinear properties of water waves. May include additional selected topic in wave mechanics. CROSSLISTED as CE 631/OC 631.",
  "prerequisites": [["CE 630", "OC 630"]]
}, {
  "corequisites": [],
  "course_name": "PHYSICAL/BIOLOGICAL INTERACTIONS IN THE UPPER OCEAN",
  "course_number": "OC 646",
  "credits": "4",
  "description": "Variability in physical oceanic processes in the upper ocean and relationship to spatial and temporal variations in biomass, growth rates, and other biological patterns in the organisms of ocean surface waters. The relationship between variability in ocean physical phenomena and ecosystem dynamics, including the requirements of sampling design for upper ocean ecological studies. Time and space scales of physical and biological phenomena in the upper ocean. Offered alternate years. Offered alternate years, typically fall term.",
  "prerequisites": [["OEAS 530"], ["OEAS 540"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN BIOLOGICAL OCEANOGRAPHY",
  "course_number": "OC 649",
  "credits": "1-4",
  "description": "Special topics of current interest in biological oceanography not covered in detail in other courses. May be repeated for credit when topic varies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEDIMENT BIOGEOCHEMISTRY",
  "course_number": "OC 657",
  "credits": "3",
  "description": "An overview of early diagenetic processes in marine sediments and the interdisciplinary approaches used to quantify material transformations at the seafloor.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN CHEMICAL OCEANOGRAPHY",
  "course_number": "OC 659",
  "credits": "1-4",
  "description": "Special topics of current interest in chemical oceanography not covered in detail by other courses. May be repeated for credit when topic varies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PALEOCEANOGRAPHY",
  "course_number": "OC 660",
  "credits": "3",
  "description": "Large-scale changes in the oceanic and atmospheric system, as recorded in marine sediments, and their implications for understanding global environment changes. Chemical, physical, and biological proxies for oceanic and atmospheric processes in the geologic record period. Evidence for changing global climate at time scales longer than the historical record; the oceanic history of the Late-Cenozoic ice ages, long term evolution of climate change patterns, catastrophic global environmental events, and application of quantitative models to the past. Current research topics in paleoceanography. Offered alternate years.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NEARSHORE HYDRODYNAMICS",
  "course_number": "OC 662",
  "credits": "3",
  "description": "Briefly reviews wave processes in the nearshore, and concentrates on the wave-averaged circulation with an eye towards it potential effects on bathymetric change.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NEARSHORE SEDIMENT TRANSPORT",
  "course_number": "OC 664",
  "credits": "3",
  "description": "To study the dynamics of a nearshore wave field propagating over a shoaling bathymetry, the response of sediments and morphology to those motions, emergent morphology due to the coupled system, anthropogenic influences and mitigation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN GEOLOGICAL OCEANOGRAPHY",
  "course_number": "OC 669",
  "credits": "1-4",
  "description": "Subjects of current interest in geological oceanography not covered in depth in other courses. May be repeated for credit when topic varies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FLUID DYNAMICS",
  "course_number": "OC 670",
  "credits": "4",
  "description": "Fundamentals of fluid dynamics: conservation laws of mass, momentum, and energy; inviscid and viscous flows; boundary layers; vorticity dynamics; irrotational and potential flow. Offered annually.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GEOPHYSICAL FLUID DYNAMICS I",
  "course_number": "OC 671",
  "credits": "4",
  "description": "Introduces the concepts of rotation and density stratification on classical fluid dynamics principles. Topics including dynamics of rotating and stratified fluids, potential vorticity, geostrophic motion; inviscid shallow-water theory, Poincare, Kelvin, and Rossby waves; geostrophic adjustment, quasigeostrophic approximation, Ekman layers, two-layer and continuously stratified models.",
  "prerequisites": [["OC 670"]]
}, {
  "corequisites": [],
  "course_name": "GEOPHYSICAL FLUID DYNAMICS II",
  "course_number": "OC 672",
  "credits": "4",
  "description": "Analyzes and solves problems on advanced dynamics of rotating and stratified fluids. Applies multi-layer and continuously stratified quasi-geostrophic theory and thermodynamic Boussinesq approximation. Topics including vertical modes, linear barotropic and baroclinic planetary (Rossby) waves, wave dispersion and group velocity; omega equation, pressure coordinates, pressure tendency, baroclinic development; Sverdrup balance, ventilated thermocline, potential vorticity homogenization, circumpolar flow and mid-depth meridional overturning; baroclinic instability and atmospheric general circulation.",
  "prerequisites": [["OC 671"]]
}, {
  "corequisites": [],
  "course_name": "DESCRIPTIVE PHYSICAL OCEANOGRAPHY",
  "course_number": "OC 673",
  "credits": "4",
  "description": "Explores fundamental mass, force, and energy balances of the ocean; geostrophy; planetary boundary layers; wind-driven and thermohaline circulation; vorticity; air-sea fluxes of heat, salt, moisture, and momentum. Applies these balances through descriptive examination of the ocean-global heat budget; surface current systems; abyssal circulation. Study of variability on a variety of time and space scales. Uses instrumentation and platforms used for observing the ocean.",
  "prerequisites": [["ATS 515", "OC 670", "OEAS 530"]]
}, {
  "corequisites": [],
  "course_name": "TURBULENCE",
  "course_number": "OC 674",
  "credits": "4",
  "description": "Governing equations, turbulent kinetic energy, vorticity dynamics; turbulent transports of mass and momentum; statistical description of turbulent flows, spectral dynamics; turbulent boundary layers, planetary boundary layers in the atmosphere and ocean, convective mixed layers, stable boundary layers; deep ocean turbulence. Offered alternate years.",
  "prerequisites": [["OC 670"]]
}, {
  "corequisites": [],
  "course_name": "NUMERICAL MODELING OF OCEAN DYNAMICS",
  "course_number": "OC 675",
  "credits": "4",
  "description": "Review of computer (numerical) models used to simulate the dynamics of fluids, specifically in the context of Earth’s oceans. Describe and contrast finite-difference, finite-volume and spectral numerical methods, common physical approximations, hardware (CPUs/GPUs), and software used to simulate ocean dynamics. Code a 2D shallow-water model and, separately, configure existing code to simulate quasi-geostrophic dynamics, 3D non-hydrostatic turbulence (large-eddy simulation) and primitive equation (hydrostatic) ocean systems. Design a research question and apply a numerical model to answer this question in the final project.",
  "prerequisites": [["OC 670"]]
}, {
  "corequisites": [],
  "course_name": "OCEAN REMOTE SENSING",
  "course_number": "OC 678",
  "credits": "4",
  "description": "Theory and applications of satellite remote sensing observations of the ocean with emphasis on strengths and limitations in the measurements. Topics include review of electricity and magnetism, absorption and scattering in the atmosphere (radiative transfer), satellite orbital mechanics, measurements of ocean color, infrared remote sensing, microwave radiometry, scatterometry, and satellite altimetry. Offered alternate years.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN PHYSICAL OCEANOGRAPHY",
  "course_number": "OC 679",
  "credits": "1-4",
  "description": "Subjects of current interest in physical oceanography, not covered in depth in other courses. May be repeated for credit when topic varies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STABILITY OF GEOPHYSICAL FLUID FLOWS",
  "course_number": "OC 680",
  "credits": "4",
  "description": "Linear perturbation analysis applied to geophysical flows. These methods provide both quantitative and conceptual insight into the formative stages of turbulent flow. Emphasis is on practical numerical methods for the solution of differential eigenvalue problems. Examples are drawn from a wide range of geophysical flow instabilities, based in part upon student interests.",
  "prerequisites": [["OC 670"]]
}, {
  "corequisites": [],
  "course_name": "GEOPHYSICAL WAVES",
  "course_number": "OC 681",
  "credits": "4",
  "description": "Fundamentals of wave dynamics applied to geophysical fluids. Hyperbolic waves--linear and nonlinear; characteristics; shock waves. Dispersive waves--linear waves, dispersion relations, group velocity; isotropic and anisotropic dispersion; nonlinear solitary waves. Application to geophysical waves--surface gravity, capillary, internal gravity, Kelvin, planetary, coastal. Offered alternate years.",
  "prerequisites": [["OC 670"]]
}, {
  "corequisites": [],
  "course_name": "DATA ANALYSIS IN THE TIME AND SPACE DOMAINS",
  "course_number": "OC 682",
  "credits": "4",
  "description": "Theory of classical and modern techniques for analysis of data in the time and space domains with applications to real oceanographic and atmospheric data. Topics include correlation analysis, regression analysis, EOF analysis, objective mapping, interpolation, filtering, sampling errors, and confidence tests. Offered alternate years.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DATA ANALYSIS IN THE FREQUENCY AND WAVE NUMBER DOMAINS",
  "course_number": "OC 683",
  "credits": "4",
  "description": "Theory of classical and modern techniques for analysis of data in the frequency and wavenumber domains with applications to real oceanographic and atmospheric data. Topics include sampling theory, one-dimensional autospectral analysis, multidimensional autospectral analysis, coherence and phase analysis, bi-spectral analysis, wavelet analysis, and confidence tests. Offered alternate years.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROPOSAL WRITING",
  "course_number": "OC 691",
  "credits": "3",
  "description": "Teaches the use of NSF Fastlane. Includes a discussion of ethics and fairness in reviewing, a review of real proposals by faculty, a simulated NSF funding panel, and then development of a real proposal, for review purposes. This will relate directly to the student's current thesis or project. The course enables graduate students from all disciplines to develop rigorous, well thought-out proposals. It should be taken early enough in the program so that the proposal process contributes to their research progress.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "OC 808",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]