[{
  "corequisites": [],
  "course_name": "CASCADIA FIELD TRIP",
  "course_number": "OEAS 500",
  "credits": "2-4",
  "description": "A field course to various locations within the Cascade volcanic arc, Coast Range and Oregon Coast. Introduction to the range of physical and biological science topics to be covered in OEAS 520, OEAS 530 and OEAS 540 in field settings; the linkages between these topics, and their impact on humans, with case examples. Students will practice math skills, and collect samples and data to be used in laboratory sessions in the later courses. Offered annually. Transportation fee charged.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CEOAS GRADUATE STUDENT SUCCESS",
  "course_number": "OEAS 511",
  "credits": "1",
  "description": "Introduces new graduate students in the College of Earth, Ocean, and Atmospheric Sciences to specific College and University resources available to them to help them be successful. Helps produce a cohort of graduate students early in their graduate careers.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCIENTISTS AS WRITERS",
  "course_number": "OEAS 515",
  "credits": "3",
  "description": "Focuses on strategies for writing for scientists, including stages of drafting and revising part or all of a thesis or research proposal, graduate thesis chapter, or scientific manuscript. Examines scientific proposal, thesis, and manuscript structure, constructive reviewing, and responding to feedback. Explores strategies for setting and meeting writing goals, grounded in literature on the psychology of successful academic writers. Develops a personalized, sustainable daily writing routine to avoid binge-writing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE SOLID EARTH",
  "course_number": "OEAS 520",
  "credits": "4",
  "description": "Movement of mass and energy within the Earth and into/out of its outer surface, expressed as plate tectonics, earthquakes, heat flow, volcanoes, geomagnetic field; composition, structure, hydrology and aging of ocean crust; lithosphere creation, recycling and mantle overturn. Marine sedimentation, sources and transport, continental weathering, tectonics-climate interactions, glacial history and sea level response. Geohazards, storm events, beach and estuary processes. Offered annually. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE FLUID EARTH",
  "course_number": "OEAS 530",
  "credits": "4",
  "description": "Fundamental principles of fluid circulation in the atmosphere and ocean. Atmospheric chemistry, radiation, thermodynamics, and dynamics. Conservation of mass, heat, momentum and vorticity in the ocean; equations governing motion; geostrophy; planetary boundary layers; wind-driven and thermohaline circulation. Air-sea fluxes and global circulation models; climate change. Offered annually. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE BIOGEOCHEMICAL EARTH",
  "course_number": "OEAS 540",
  "credits": "4",
  "description": "Integrating fundamental concepts in biological and chemical oceanography to understand energy and material transformations in estuarine, coastal and open ocean habitats. Topics include structure and function of marine ecosystems, biogeochemical cycles, and human impacts. Offered annually. Lec/lab.",
  "prerequisites": []
}]