[{
  "corequisites": [],
  "course_name": "INTRODUCTION TO THE OUTDOOR PRODUCTS INDUSTRY",
  "course_number": "OP 101",
  "credits": "4",
  "description": "Introduction and history of the outdoor products industry. Characteristics of the industry through time. Current size and breadth of the industry, its economic significance, and its potential employment sectors. Relationship of the industry to the environment and public lands. Scope of industry influence in social justice and public lands policy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EXPERIENCE OUTDOOR PRODUCTS - WATER",
  "course_number": "OP 231",
  "credits": "2",
  "description": "Hands-on experience with multiple water-related outdoor products in classroom and outdoor settings. Identifying key characteristics for consumers and implications for design, development, marketing, business, and sustainability. Evaluating product performance and developing ideas for objective improvements. Includes one mandatory weekend outdoor-experience outing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EXPERIENCE OUTDOOR PRODUCTS - WINTER",
  "course_number": "OP 232",
  "credits": "2",
  "description": "Hands-on experience with multiple winter-related outdoor products in classroom and outdoor settings. Identifying key characteristics for consumers and implications for design, development, marketing, business, and sustainability. Evaluating product performance and developing ideas for objective improvements. Includes one mandatory weekend outdoor-experience outing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EXPERIENCE OUTDOOR PRODUCTS - LAND",
  "course_number": "OP 233",
  "credits": "2",
  "description": "Hands-on experience with multiple land-related outdoor products in classroom and outdoor settings. Identifying key characteristics for consumers and implications for design, development, marketing, business, and sustainability. Evaluating product performance and developing ideas for objective improvements. Includes one mandatory weekend outdoor-experience outing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OUTDOOR PRODUCTS PROCESS CONNECTIONS",
  "course_number": "OP 301",
  "credits": "4",
  "description": "The interrelated processes and connections of product commercialization. How product design decisions impacts business considerations such as margin, inventory, supply chain, cash flow, and profitability. How design thinking and nurturing a design culture that promotes innovation is necessary for business success and growth. Challenges of product sales and distribution related to design.",
  "prerequisites": ["OP 231", "OP 232", "OP 233"]
}, {
  "corequisites": [],
  "course_name": "OUTDOOR PRODUCTS PRE-INTERNSHIP SEMINAR",
  "course_number": "OP 307",
  "credits": "1",
  "description": "Prepares students for internships in outdoor products industries. Topics include professionalism, internship/job search strategies, writing resumes and cover letters, interviewing, developing internship learning outcomes, networking, and workplace etiquette and communication.",
  "prerequisites": ["OP 101"]
}, {
  "corequisites": [],
  "course_name": "OUTDOOR PRODUCTS DESIGN AND DEVELOPMENT I",
  "course_number": "OP 351",
  "credits": "4",
  "description": "Explores needs-based design for Outdoor Products. Experiential-based projects related to function and design and understanding Design in context of Consumer Needs. Investigates design-choices impact upstream and downstream commercialization processes.",
  "prerequisites": ["OP 301"]
}, {
  "corequisites": [],
  "course_name": "OUTDOOR PRODUCTS DESIGN AND DEVELOPMENT II",
  "course_number": "OP 352",
  "credits": "4",
  "description": "Exploration of development and product creation cycles for Outdoor Products. Bridging the design and operations phases of commercialization. Investigate quality, sample production, product testing, and costing. Managing how development decisions impact upstream and downstream commercialization processes.",
  "prerequisites": ["OP 351"]
}, {
  "corequisites": [],
  "course_name": "OUTDOOR PRODUCTS FAILURE",
  "course_number": "OP 353",
  "credits": "4",
  "description": "Explores the role of failure in the design and redesign of Outdoor Products. Confronts the reality of mistakes and explores ways to mitigate them. Utilizes intentional design to manage failures to support repair and extended product life cycles.",
  "prerequisites": ["OP 352"]
}, {
  "corequisites": [],
  "course_name": "OUTDOOR PRODUCTS BRANDING",
  "course_number": "OP 360",
  "credits": "MERCHANDISING",
  "description": "Consumer behavior, emerging markets, building and nurturing brands, strategic communication. Content curation, merchandising and communication. Traditional and non-traditional sales channels.",
  "prerequisites": ["OP 352"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "OP 399",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "OP 406",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OUTDOOR PRODUCTS INTERNSHIP",
  "course_number": "OP 410",
  "credits": "1-8",
  "description": "",
  "prerequisites": ["OP 307"]
}]