[{
  "corequisites": [],
  "course_name": "INTRODUCTION TO MOVEMENT",
  "course_number": "PAC 100",
  "credits": "1",
  "description": "Identifies individual fitness and rehabilitative goals in an Inclusive fitness environment. Emphasizes on the development of movement patterns, addressing individual needs. Focus may include: beginner, therapeutic, or adaptive movements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AQUA AEROBICS",
  "course_number": "PAC 102",
  "credits": "1",
  "description": "Fitness class using a variety of movements in shallow and deep water, mostly in a vertical position. Do not need swimming skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DEEP WATER FITNESS",
  "course_number": "PAC 103",
  "credits": "1",
  "description": "Fitness class using a variety of movements in a deep water pool, mostly in a vertical position. Should be comfortable in deep water.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ARCHERY",
  "course_number": "PAC 104",
  "credits": "1",
  "description": "Basic mechanics and introduction to archery. Exposure to varying archery techniques and equipment, including recurve and compound bow shooting.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CPR/FIRST AID",
  "course_number": "PAC 105",
  "credits": "1",
  "description": "Introduces cardiac and first aid emergency response procedures. Emphasizes safe response, chain of survival, quality CPR (adults, children, infants), use of an AED, medical emergencies, injury emergencies and environmental emergencies. Students successfully completing the American Red Cross course will receive certifications in basic CPR/AED and First Aid.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STEP AEROBICS",
  "course_number": "PAC 108",
  "credits": "1",
  "description": "Low-impact, high intensity workout adjustable to all fitness levels utilizing adjustable height benches. Strengthening and flexibility exercises included.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO WHITE WATER KAYAKING",
  "course_number": "PAC 110",
  "credits": "2",
  "description": "Students will learn fundamentals of white water kayaking in sheltered water based on the internationally recognized British Canoe (BC) teaching and skills certification system. Emphasis is on activity and basic skills. See class schedule for the location, website, and class schedule specific to the course. This course runs for six class sessions of 3 hours (Fridays), and one mandatory Saturday (5-hour) session. The entire class lasts for six weeks.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO CANOEING",
  "course_number": "PAC 111",
  "credits": "2",
  "description": "Students will learn fundamentals of canoeing in sheltered water based on the internationally recognized British Canoe (BC) teaching and skills certification system. Emphasis is on activity and basic skills. See class schedule for the location, website, and class schedule specific to the course. This course runs for six class sessions of 3 hours (Fridays), and one mandatory Saturday (5-hour) session. The entire class lasts for six weeks.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEARNING KAYAK ROLLING BASICS",
  "course_number": "PAC 112",
  "credits": "2",
  "description": "Students learn fundamentals of rolling a kayak in an indoor pool-based environment. Emphasis is on activity and basic skills. See class schedule for the location, website, and class schedule specific to the course.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BADMINTON I",
  "course_number": "PAC 113",
  "credits": "1",
  "description": "Singles and doubles skills, practice, rules, strategies and play.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BADMINTON II",
  "course_number": "PAC 114",
  "credits": "1",
  "description": "Intermediate skill development in badminton.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OUTDOOR LIVING SKILLS",
  "course_number": "PAC 115",
  "credits": "2",
  "description": "Educates and introduces students on how to travel safely in the backcountry through proper preparation, risk awareness, Leave No Trace ethics, terrain recognition, navigation, and camp craft. Classroom and field (lab) experience. Includes one mandatory weekend overnight outing. CROSSLISTED as PAC 115/TRAL 115.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BASKETBALL I (MEN/WOMEN)",
  "course_number": "PAC 116",
  "credits": "1",
  "description": "Fundamental basketball skills, drills, rules, strategies, and practice. Game play appropriate for the skill level.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BASKETBALL COMPETITIVE",
  "course_number": "PAC 117",
  "credits": "1",
  "description": "Team play, individual and team skills developed and refined, competitive round robin tournaments.",
  "prerequisites": []
}, {
  "corequisites": ["PAC 115"],
  "course_name": "LABORATORY FOR OUTDOOR LIVING SKILLS",
  "course_number": "PAC 118",
  "credits": "1",
  "description": "Practical field application of concepts learned in PAC 115/TRAL 115, Outdoor Living Skills. Field (lab) experience includes one mandatory weekend overnight. Introduces how to travel safely in the backcountry through proper preparation, risk awareness, Leave No Trace ethics, terrain recognition, navigation, and camp craft. CROSSLISTED as PAC 118/TRAL 118.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BILLIARDS",
  "course_number": "PAC 121",
  "credits": "1",
  "description": "Skills, technique, strategy, game knowledge as introduction to billiards (pool), a 'cue' sport; rules and gaming for variations of pocket billiards; practice and class tournament play.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GROUP STRENGTH",
  "course_number": "PAC 122",
  "credits": "1",
  "description": "Fitness workout that focuses on building muscular endurance and strength using dumbbells, resistance tubing, suspension trainers, and aerobic steps.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BOWLING I",
  "course_number": "PAC 123",
  "credits": "1",
  "description": "Fundamentals of the game including etiquette, spot bowling, natural hook and straight ball delivery, scoring, handicap computation, spare pickup, and error correction. Additional fee; equipment supplied.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BOWLING II",
  "course_number": "PAC 124",
  "credits": "1",
  "description": "Review and refinement of basic fundamentals of bowling. Emphasis on spot bowling, adjusting for lane conditions, choices in equipment, league play, and mental training.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CARDIO KICKBOXING I",
  "course_number": "PAC 126",
  "credits": "1",
  "description": "High intensity group workout set to motivational music and combining skills and techniques from boxing, kickboxing, and other martial arts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FITNESS BOXING AND CONDITIONING",
  "course_number": "PAC 127",
  "credits": "1",
  "description": "Introduces fundamental kickboxing strikes and movements in combination with pad work used for a highly aerobic group and partner workout.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CARDIO INTERVALS",
  "course_number": "PAC 129",
  "credits": "1",
  "description": "Covers fitness workout utilizing the fundamentals of cardiovascular interval training.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CONDITIONING",
  "course_number": "PAC 130",
  "credits": "1",
  "description": "Total body approach to fitness, cardiorespiratory conditioning, muscular strength and endurance; flexibility emphasized. May follow a specific training format, e.g., ROTC section follows Army conditioning format.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: TAP I",
  "course_number": "PAC 133",
  "credits": "1",
  "description": "Individual and group dance with specialized shoes; basic step technique and vocabulary; warm up exercises progressing into rhythmic combinations performed to music; culminates in full routine to music.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ARTISTIC DANCE: BALLET I",
  "course_number": "PAC 136",
  "credits": "1",
  "description": "Introduces basic ballet technique and aesthetics, terminology, alignment, stretch and strength exercises. No previous dance experience needed.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: BALLET II",
  "course_number": "PAC 137",
  "credits": "1",
  "description": "Review and practice of beginning ballet technique, introduction of more advanced stretches, steps, and combinations. Additional fee for accompanist.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: BALLET III",
  "course_number": "PAC 138",
  "credits": "1",
  "description": "Intermediate and advanced ballet technique, comprehensive exploration of the discipline. Additional fee for accompanist.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HIP HOP DANCE",
  "course_number": "PAC 139",
  "credits": "1",
  "description": "Aerobic/energetic experience consisting of a warm-up/conditioning and choreographic combinations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: JAZZ I",
  "course_number": "PAC 140",
  "credits": "1",
  "description": "Introduction to jazz dance, technique, isolations, and combinations. Different jazz styles are explored. No previous dance experience is necessary.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: JAZZ II",
  "course_number": "PAC 141",
  "credits": "1",
  "description": "Intermediate jazz technique, isolations and combinations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: MODERN I",
  "course_number": "PAC 145",
  "credits": "1",
  "description": "Introduction to modern dance movement fundamentals. Technique, stretch, strength, and alignment are included, as well as an appreciation for movement expression. No previous dance experience needed. Additional fee for accompanist.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: MODERN I",
  "course_number": "PAC 145H",
  "credits": "1",
  "description": "Introduction to modern dance movement fundamentals. Technique, stretch, strength, and alignment are included, as well as an appreciation for movement expression. No previous dance experience needed. Additional fee for accompanist.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: MODERN II",
  "course_number": "PAC 146",
  "credits": "1",
  "description": "An intermediate level of modern dance technique and movement expression. Additional fee for accompanist.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: CUBAN SALSA I (LEAD/FOLLOW)",
  "course_number": "PAC 148",
  "credits": "1",
  "description": "Foundations of Cuban Salsa (Casino) as well as Rueda de Casino with focus on musical development and fundamentals of leading and following in partner dance.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: CUBAN SALSA II",
  "course_number": "PAC 149",
  "credits": "1",
  "description": "Higher concepts of Cuban Salsa (Casino) as well as Rueda de Casino, with focus on musical development and fundamentals of leading and following in partner dance.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL DANCE/LINE II",
  "course_number": "PAC 150",
  "credits": "1",
  "description": "Emphasizes learning line dances at the intermediate level with a focus on terminology, syncopation, tags, restarts, and overall pacing. Review of line dances learned in PAC 151. Focuses on choreographing original line dances as well as reading and writing line dance step sheets at the intermediate level.",
  "prerequisites": ["PAC 151"]
}, {
  "corequisites": [],
  "course_name": "COUNTRY LINE DANCE",
  "course_number": "PAC 151",
  "credits": "1",
  "description": "Non-partner dance routines in country western style; musical interpretation, footwork, and sequencing of 20 different routines.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: SALSA I",
  "course_number": "PAC 152",
  "credits": "1",
  "description": "Steps and rhythmic accent of Salsa and Merengue style; fundamentals of leading and following; basic moves and combinations. No prior experience needed.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PARTNER DANCE/COUNTRY WESTERN I",
  "course_number": "PAC 154",
  "credits": "1",
  "description": "Focuses on Country Western partner dance styles, including swing, two-step, waltz, and popular pattern/circle dances. Emphasizes fundamentals of leading and following for social dance. No prior experience or partner needed.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: COUNTRY WESTERN II (LEAD/FOLLOW)",
  "course_number": "PAC 155",
  "credits": "1",
  "description": "Build on CW I with advanced waltz, two-step, and cha-cha patterns; introduces schottishe and East Coast swing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: COUNTRY WESTERN III (LEAD/FOLLOW)",
  "course_number": "PAC 156",
  "credits": "1",
  "description": "Advanced two-step patterns and styling with a focus on musical interpretation; development of leading and following.",
  "prerequisites": ["PAC 155"]
}, {
  "corequisites": [],
  "course_name": "DANCE: BEGINNING SWING (LEAD/FOLLOW)",
  "course_number": "PAC 158",
  "credits": "1",
  "description": "Introduction to single time, double time, and triple time (jitterbug) swing; variations for each style, covering most swing music rhythms. Emphasizes fundamentals of leading and following.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: BALLROOM I (LEAD/FOLLOW)",
  "course_number": "PAC 159",
  "credits": "1",
  "description": "Posture and alignment, fundamentals of leading and following, basic steps and variations for waltz, foxtrot, swing, tango, and cha-cha.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: BALLROOM II (LEAD/FOLLOW)",
  "course_number": "PAC 160",
  "credits": "1",
  "description": "Additional steps and patterns of popular ballroom dances.",
  "prerequisites": ["PAC 159"]
}, {
  "corequisites": [],
  "course_name": "DANCE: BALLROOM III (LEAD/FOLLOW)",
  "course_number": "PAC 161",
  "credits": "1",
  "description": "Styling; additional dances: rhumba, silver fox trot, and Viennese waltz; advanced dance figures for tango and cha-cha.",
  "prerequisites": ["PAC 160"]
}, {
  "corequisites": [],
  "course_name": "DANCE: LATIN I",
  "course_number": "PAC 163",
  "credits": "1",
  "description": "Latin dances including cha-cha, mambo, salsa, rhumba, merengue, bolero, salsa, and paso doble. Emphasis on proper styling and technical execution of each dance; effective leading and following techniques.",
  "prerequisites": ["PAC 159"]
}, {
  "corequisites": [],
  "course_name": "PARTNER DANCE: WEST COAST SWING I",
  "course_number": "PAC 165",
  "credits": "1",
  "description": "Focus on style, technique and many different step patterns of the west coast swing dance style.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PARTNER DANCE: TWO-STEP & BEYOND",
  "course_number": "PAC 166",
  "credits": "1",
  "description": "Focuses on foundational through intermediate patterns for country-western two-step, waltz, and polka, with an emphasis on techniques for leading and following. Includes foundational figures for nightclub two step, Arizona two-step, one-step, and other progressive styles.",
  "prerequisites": ["PAC 154", "PAC 155", "PAC 159", "PAC 160"]
}, {
  "corequisites": [],
  "course_name": "SOCIAL DANCE: LINDY HOP SWING",
  "course_number": "PAC 167",
  "credits": "1",
  "description": "Focus on styling and technique of Lindy Hop Swing, a Ballroom dance style based on the original eight count swing dance style evolved in Harlem ballrooms during the late 1920s.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DANCE: LINDY HOP II (LEAD/FOLLOW)",
  "course_number": "PAC 168",
  "credits": "1",
  "description": "Intermediate patterns, syncopations, play techniques, and styling with a focus on musical interpretation in the Lindy Hop style; development of leading and following.",
  "prerequisites": ["PAC 167"]
}, {
  "corequisites": [],
  "course_name": "DANCE: WEST COAST SWING II (LEAD/FOLLOW)",
  "course_number": "PAC 170",
  "credits": "1",
  "description": "Intermediate patterns, syncopations, play techniques, and styling with a focus on musical interpretation; development of leading and following.",
  "prerequisites": ["PAC 165"]
}, {
  "corequisites": [],
  "course_name": "INTERMEDIATE ROCK CLIMBING",
  "course_number": "PAC 173",
  "credits": "2",
  "description": "Introduces a variety of basic skills, gear and systems that will allow students to safely participate in a single pitch rock climbing environment based on internationally recognized teaching and skills certification systems. Explores various technical skills that will serve as a foundation for future land-based outdoor disciplines. Introduces gear, such as software (ropes, webbing, harnesses) and hardware (carabiners, friction devices); skills, such as knots, belaying, rappelling, lead climbing; and systems such as anchors and basic rescue techniques. CROSSLISTED as PAC 173/TRAL 173.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FLAG FOOTBALL",
  "course_number": "PAC 174",
  "credits": "1",
  "description": "Skill instruction and practice; drills; strategies, game play of America football; emphasis on teamwork and sportsmanship in a competitive but non-threatening or stressful environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ROLLER SKATE & DERBY SKILLS",
  "course_number": "PAC 175",
  "credits": "1",
  "description": "Develops roller-skating skills including footwork, gliding, weaving and jumping. Develops roller derby knowledge and sport skills. Introduces safety and basic equipment and maintenance.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FLY FISHING I",
  "course_number": "PAC 178",
  "credits": "1",
  "description": "Casting and fishing techniques, lure making, equipment selection, terminology, and regulation for fishing in Oregon's marine environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FLY FISHING II",
  "course_number": "PAC 179",
  "credits": "1",
  "description": "Advanced fly casting and fly fishing techniques for trout, fly-tying, equipment selection, basic aquatic organism identification, terminology, and regulations for fishing in Oregon's freshwater environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STEELHEAD FISHING",
  "course_number": "PAC 180",
  "credits": "1",
  "description": "Casting and fishing techniques, lure making, equipment selection, terminology, and regulations for fishing in Oregon's marine environment for steelhead.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DISC GOLF I",
  "course_number": "PAC 182",
  "credits": "1",
  "description": "Techniques for throwing discs; equipment, knowledge, etiquette, and rules associated with playing a disc golf course; experience playing practice and official disc golf courses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GOLF I",
  "course_number": "PAC 184",
  "credits": "1",
  "description": "Basic fundamental principles in all phases of golf; rules, terminology, etiquette, safety and scoring. Equipment provided.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GOLF II",
  "course_number": "PAC 185",
  "credits": "1",
  "description": "Individual practice and course play; skill refinement as continuation of Golf I. Equipment available. Course play expected, additional fee.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GOLF III",
  "course_number": "PAC 186",
  "credits": "1",
  "description": "Advanced skills, knowledge involved in competitive play. Course play expected, additional fee.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GYMNASTICS",
  "course_number": "PAC 188",
  "credits": "1",
  "description": "Fundamental techniques on vault, bars, beam, and floor.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GYMNASTICS II",
  "course_number": "PAC 189",
  "credits": "1",
  "description": "Build upon previous gymnastics experiences or classes; floor exercise, uneven parallel bars, vault, mini-trampoline and beam apparatus are available.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "KARATE",
  "course_number": "PAC 190",
  "credits": "1",
  "description": "Instruction in traditional Japanese karate basic striking and blocking techniques, kata (forms), philosophy, conditioning, and etiquette. Self-defense applications are also emphasized.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BRAZILIAN JIU-JITSU",
  "course_number": "PAC 191",
  "credits": "1",
  "description": "Basic level grappling self-defense techniques and applying them in sparring sessions along with understanding the core principles which make this martial arts system effective. An introduction to the history of Brazilian Jiu-jitsu along with proper gym etiquette, vocabulary, and culture.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "JUDO I",
  "course_number": "PAC 192",
  "credits": "1",
  "description": "Skill instruction in landing, throwing and grappling for this style of martial arts; etiquette for practice and competition; basic knowledge of vocabulary, rules and scoring.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "JUDO II",
  "course_number": "PAC 193",
  "credits": "1",
  "description": "Intermediate skill instruction in landing, throwing, pins, chokes in Kodokan Judo style; principles of Seiryoku-Zenyou and Jita-Kyouei designed to help individuals become better members of society through training body and mind; instruction for competition knowledge and skills. Judo etiquette for practice and competition expected.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PILATES",
  "course_number": "PAC 194",
  "credits": "1",
  "description": "Non-impact, invigorating approach to physical conditioning and mind/body awareness; helps develop core body strength, improve posture and balance, and increase muscle endurance, tone, flexibility.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PILATES II",
  "course_number": "PAC 195",
  "credits": "1",
  "description": "Progression of Joseph Pilates mat exercises; emphasis on intermediate and advanced levels; application of Pilates' principles to new exercises; use of props; application of principles to daily living.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PICKLEBALL",
  "course_number": "PAC 197",
  "credits": "1",
  "description": "Fast-paced, self-officiated net game with similarities to tennis, badminton, table tennis, and racquetball. Course covers rules, strategies, technique, preparation for play, and includes extensive active practice and play; played with two, three, or four people.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "PAC 199",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "PAC 199H",
  "credits": "1-3",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RELAXATION",
  "course_number": "PAC 201",
  "credits": "1",
  "description": "Introduction to techniques that promote relaxation of the nervous system. These may include, but are not limited to: meditation, imagery, yoga postures, and self-massage. Students will be encouraged to reflect on how life choices influence their nervous system.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MEDITATION",
  "course_number": "PAC 202",
  "credits": "1",
  "description": "Examine the application of building simple awareness, how to manage thoughts in productive and compassionate ways, and how to transfer these skills into healthy relationships. Explore strategies for managing mental and physical difficulties including anxiety, pain, and overall stress through experiential learning and personal sharing of experiences.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OBSERVATION & ASSISTANT INSTRUCTIONAL PRACTICE IN PHYS ACT",
  "course_number": "PAC 203",
  "credits": "1",
  "description": "Observe and begin physical activity instruction within dance, yoga, sports, fitness, aquatics, martial arts, or cross-disciplinary physical activities.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEAD INSTRUCTIONAL PRACTICE IN PHYSICAL ACTIVITY",
  "course_number": "PAC 204",
  "credits": "1",
  "description": "Lead physical activity curriculum within dance, yoga, fitness, aquatics, sports, martial arts, or cross-disciplinary physical activities. Gain experience implementing already designed lesson plans, assessment, and leading peers through basic exercise, while supervised by university and program personnel.",
  "prerequisites": ["PAC 203"]
}, {
  "corequisites": [],
  "course_name": "ROWING",
  "course_number": "PAC 205",
  "credits": "CREW",
  "description": "Introduction to the sport of rowing; designed for the novice (beginner). Includes basic technique and terminology, related water safety, and development of strength, endurance, and flexibility.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "PAC 208",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TRAIL RUNNING",
  "course_number": "PAC 211",
  "credits": "1",
  "description": "Recreational running in the outdoors which takes place on unpaved surface. Introduces trail running at local trail systems. Open to all levels, including run/hikers.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RUNNING",
  "course_number": "PAC 212",
  "credits": "JOGGING",
  "description": "Cardiorespiratory fitness with scenic running routes; training, nutrition, and physiology. Beginning and intermediate level.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RUNNING: 10K TRAINING",
  "course_number": "PAC 213",
  "credits": "1",
  "description": "Intermediate to advanced conditioning and training program for road racing.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HALF MARATHON TRAINING",
  "course_number": "PAC 214",
  "credits": "2",
  "description": "Progressive training combining walking, running, core strengthening, interval techniques in preparation for a 13.1 mile (1/2 marathon) event. Open to all levels; may choose to walk, walk/run, or run.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RUGBY",
  "course_number": "PAC 215",
  "credits": "TOUCH",
  "description": "Basic skills of open field rugby; emphasis on ball handling and attacking strategy; rules and history; game play.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SELF DEFENSE",
  "course_number": "PAC 217",
  "credits": "1",
  "description": "Nonviolent self-defense. Develop self-confidence and skills for assault situations. Conditioning and practical skills. Men and women, all levels.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TELEMARK SKIING",
  "course_number": "PAC 224",
  "credits": "1",
  "description": "Winter sport that is a cross between cross country and downhill skiing. Requires telemark equipment where the heel is unattached. Class accommodates all levels and practices on the downhill slopes. Additional fee covers bus transportation, lessons, and lift ticket. Rental of equipment is not included.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DOWNHILL SKIING",
  "course_number": "PAC 225",
  "credits": "1",
  "description": "Travel to area facilities, 1-1/2 hour lesson followed by open practice, students grouped according to skill level: beginner, intermediate, advanced, racer. Special fee covers bus transportation, lessons, and lifts. Additional fee for rentals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SNOWBOARDING",
  "course_number": "PAC 227",
  "credits": "1",
  "description": "Travel to area facilities, 1 1/2 hour lesson followed by open practice, students grouped according to skill level: beginner, intermediate, advanced. Special fee covers bus transportation, lessons, and lifts. Additional fee for rentals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCCER I",
  "course_number": "PAC 229",
  "credits": "1",
  "description": "Basic skills of controlling the ball; conditioning; lead-up games; team play.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCCER II",
  "course_number": "PAC 230",
  "credits": "1",
  "description": "Review of basic skills of offense and defense in controlled game play; concepts of team position and play, pressure and attack.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCCER III",
  "course_number": "PAC 231",
  "credits": "1",
  "description": "High level soccer skills; team play and transition concepts; set plays and alignments for both offense and defense.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCCER: INDOOR",
  "course_number": "PAC 233",
  "credits": "1",
  "description": "Skill instruction and development; strategies and rules for indoor play; game play in indoor gymnasium.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOFTBALL",
  "course_number": "PAC 236",
  "credits": "WHIFFLEBALL",
  "description": "Skills, rules, strategies, practice, and game play of the popular outdoor slow pitch game. Modified softball with whiffleball when play is indoors.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCUBA: OPEN WATER",
  "course_number": "PAC 242",
  "credits": "2",
  "description": "Explores fundamental SCUBA diving physiology, water environment, equipment, and techniques in lecture. Practice techniques, skills, and equipment usage in sessions held in pool and open water. Successful completion of this course can lead to PADI certification.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCUBA: ADVANCED OPEN WATER",
  "course_number": "PAC 243",
  "credits": "1",
  "description": "Classroom lecture and laboratory in hypothermics, natural navigation, dive physiology, compass navigation, night and limited visibility procedures, boat diving, search and salvage techniques, deep diving procedures, health for diving, and an introduction to dive rescue. Successful completion of this course can lead to PADI certification. Additional fee.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCUBA: RESCUE DIVER",
  "course_number": "PAC 244",
  "credits": "1",
  "description": "Techniques, skills, knowledge, and practice in self-rescue and rescue of others in underwater emergencies; may lead to PADI certification; lecture and pool laboratory; open water dive required. Additional fee.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCUBA SPECIAL TOPICS",
  "course_number": "PAC 245",
  "credits": "1",
  "description": "Specialized courses requiring previous certification in SCUBA. Check the current schedule of classes for more information and prerequisites. Possible classes: altitude diver, night diver, search and recovery, deep diver, underwater navigation, equipment specialist. Additional fee.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SURFING",
  "course_number": "PAC 247",
  "credits": "1",
  "description": "Knowledge and fundamental skills of this aquatic sport including history, terminology, safety precautions, the ocean environment, and equipment. Additional fee.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SWIM: NON-SWIMMER",
  "course_number": "PAC 248",
  "credits": "1",
  "description": "Skills for self-rescue; fundamental skills in swimming and safety. Designed for people with a fear of water. Recommended S/U grading.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LIFEGUARD TRAINING",
  "course_number": "PAC 249",
  "credits": "1",
  "description": "Trains participants in the skills required to become a lifeguard. Emphasizes professional behavior, water rescues, safe response, quality CPR (adults, children, infants, and team responses), use of an AED and first aid. Students successfully completing the American Red Cross certification requirements will be issued a lifeguarding certification at the end of the course.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SWIM I",
  "course_number": "PAC 250",
  "credits": "1",
  "description": "Swimming concepts, survival and breathing techniques, front crawl and elementary backstroke as minimum instruction.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SWIM II",
  "course_number": "PAC 252",
  "credits": "1",
  "description": "Fitness swimming, swimming strokes and skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SWIM TRAINING WORKOUT",
  "course_number": "PAC 253",
  "credits": "1",
  "description": "Competitive skills and strokes; emphasis on training.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPETITIVE SWIMMING",
  "course_number": "PAC 254",
  "credits": "1",
  "description": "Prepares students for competitive swimming and emphasizes lifetime aquatic fitness; interval swim workouts designed for speed and endurance; instruction on legal techniques of strokes and turns; culminates in intra-class swim meet; 2,000-3,000 yards/day.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TAIJI",
  "course_number": "PAC 256",
  "credits": "TAI",
  "description": "Introduction to ancient Chinese 'internal martial art' based upon concepts of Yin and Yang; detailed slow and relaxed form movements provide benefits to body, mind, and spirit.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TAIJI",
  "course_number": "PAC 257",
  "credits": "TAI",
  "description": "Continuation of study of the Yang-style Taiji form; more in-depth exploration of underlying principles and push-hands exercises.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TENNIS I",
  "course_number": "PAC 260",
  "credits": "1",
  "description": "Introduction to fundamental strokes, singles and doubles play, scoring, and basic concepts in tennis.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TENNIS II",
  "course_number": "PAC 261",
  "credits": "1",
  "description": "Review and refinement of fundamental strokes; volley, lob, return of serve; introduction to singles and doubles strategy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TUMBLING I",
  "course_number": "PAC 265",
  "credits": "1",
  "description": "Technical instruction, progressions, and practice in basic, intermediate, and advanced tumbling skills; emphasis on safety and fitness concepts; floor and mini-trampoline skills; no apparatus instruction.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TUMBLING II",
  "course_number": "PAC 266",
  "credits": "1",
  "description": "Technical instruction, progressions, safety, and practice building upon skills taught in PAC 265, Tumbling I.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TRIATHLON TRAINING",
  "course_number": "PAC 268",
  "credits": "2",
  "description": "Training in swimming, running, and bicycling to prepare for triathlon participation. Strategies, transitioning technique, and weight training information; training plan formation; event planning; culminates in class or community event.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ULTIMATE FRISBEE",
  "course_number": "PAC 271",
  "credits": "1",
  "description": "Fundamentals for the beginning and intermediate player; individual skill development, rules, game play, and strategy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "VOLLEYBALL I",
  "course_number": "PAC 273",
  "credits": "1",
  "description": "Fundamental volleyball skills, drills, rules, strategies, and practice. Game play appropriate for skill level.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "VOLLEYBALL II",
  "course_number": "PAC 274",
  "credits": "1",
  "description": "Fundamental skills and knowledge refined; intermediate skills developed, competitive play.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "VOLLEYBALL III",
  "course_number": "PAC 275",
  "credits": "1",
  "description": "Skill refinement and development; intense, highly competitive drills and game situations, doubles through sixes play.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FITNESS WALKING",
  "course_number": "PAC 278",
  "credits": "1",
  "description": "Establishment of personal fitness programs through walking with emphasis on technique and aerobic components.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "METCON50",
  "course_number": "PAC 284",
  "credits": "2",
  "description": "Total body fitness program that uses differing work to rest ratios to increase metabolic efficiency. Introduces functional and compound strength training exercises, and cardio interval training formats. Open to all fitness levels.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "METCON30",
  "course_number": "PAC 285",
  "credits": "1",
  "description": "Utilizes differing work to rest ratios to increase metabolic efficiency in a total body fitness program. Applies the functional and compound strength training exercises and cardio interval training formats introduced in prerequisite courses. Open to all fitness levels.",
  "prerequisites": ["PAC 284", "PAC 287", "PAC 288"]
}, {
  "corequisites": [],
  "course_name": "WEIGHT TRAINING: CIRCUITS",
  "course_number": "PAC 286",
  "credits": "1",
  "description": "Fast-paced fitness class using stations of resistance training exercises. Designed to improve cardiovascular fitness and muscular endurance more than strength.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WEIGHT TRAINING I",
  "course_number": "PAC 287",
  "credits": "1",
  "description": "Exercise techniques in both free and fixed resistance training equipment; safety procedures, terminology, and principles of exercise.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WEIGHT TRAINING II",
  "course_number": "PAC 288",
  "credits": "1",
  "description": "Intermediate level of weight training in free and fixed weights.",
  "prerequisites": ["PAC 287"]
}, {
  "corequisites": [],
  "course_name": "FITNESS & WELLNESS LEADERSHIP I",
  "course_number": "PAC 289",
  "credits": "1",
  "description": "Provides the foundation for Fitness and Wellness Leadership Training. Examines principles of fitness and wellness, intrinsic and extrinsic barriers to physical activity, and identifies behaviors that support activity. Develops skills in individual and group fitness instruction, open-ended inquiry, demonstrating active listening, motivational interviewing and supporting goal-setting.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FITNESS & WELLNESS LEADERSHIP II",
  "course_number": "PAC 290",
  "credits": "1",
  "description": "Builds on PAC 289 by developing skills in programming cardiorespiratory and resistance training fitness program design for groups and individuals. Builds competency in designing, delivering and assessing group fitness classes and variable training formats. Applies active listening skills taught in PAC 289 to enhance the ability to use motivational interviewing in wellness coaching and other dynamic situations.",
  "prerequisites": ["PAC 289"]
}, {
  "corequisites": [],
  "course_name": "WRESTLING",
  "course_number": "PAC 292",
  "credits": "1",
  "description": "Collegiate wrestling fall and winter terms; freestyle and Greco wrestling spring term. All levels.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "YOGA I",
  "course_number": "PAC 294",
  "credits": "1",
  "description": "Principles and practice of basic yoga postures, techniques of posture alignment, yogi breathing styles and their impact on the body and mind. Students will be exposed to a variety of forms of yoga, as well as basic yoga philosophy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "YOGA II",
  "course_number": "PAC 295",
  "credits": "1",
  "description": "Building off Yoga I, this is an intermediate level course meant to develop a deeper understanding of yoga practice.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "VINYASA YOGA",
  "course_number": "PAC 296",
  "credits": "1",
  "description": "Dynamic flow that connects movement and breath encouraging meditation in motion. May include sustained yoga postures.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GENTLE AND RESTORATIVE YOGA",
  "course_number": "PAC 298",
  "credits": "1",
  "description": "Emphasizes gentle movement, supported postures, and longer holds. Experiments with a variety of contemplative practices with the purpose of encouraging personal inquiry and awareness.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "PAC 299",
  "credits": "1-3",
  "description": "Advanced information, skills, practice, and application; experimental and new classes. May have additional fee.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: HIKING LOCAL TRAILS",
  "course_number": "PAC 300",
  "credits": "1",
  "description": "Covers the fundamentals of hiking as a recreational activity and an outdoor travel skill. Content will cover local trails, place history, hiking techniques, clothing and equipment selection, elemental first aid and safety concerns, leave-no-trace principles, and map basics. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: CHALLENGE COURSE EXPERIENCE",
  "course_number": "PAC 301",
  "credits": "1",
  "description": "Emphasis on gaining practical experience and understanding of various components that occur in challenge course activities/programs; group dynamic mental and physical challenges; cooperative games and initiatives that promote communication, problem solving skills and leadership; Low and High challenge course activities that promote self-confidence and agility. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: CAMP CRAFT",
  "course_number": "PAC 303",
  "credits": "1",
  "description": "Provides basic front-country camping skills such as packing, trip planning, how to dress for different climates/weather, storm-proofing, knife and axe techniques and safety, stove and kitchen operations, and fire building. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: BACKPACKING",
  "course_number": "PAC 304",
  "credits": "1",
  "description": "Hiking and camping while carrying all gear; tent set-up, camp site selection, operation of single-burner stoves, loading a backpack, water infiltration, navigation, proper hiking technique, energy conservation; leave-no-trace principles in every aspect of the trip and class; includes classroom instruction and required overnight trip. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: MOUNTAIN BIKING",
  "course_number": "PAC 305",
  "credits": "1",
  "description": "Provides basic wilderness living techniques, knowledge and skills needed for a student to be ethical, efficient and have Growth mindset and skill-based mountain bike instruction set on Corvallis area trails; riding techniques, safety, trail etiquette, land manager relations, trail maintenance and environmental concerns. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: RAFTING",
  "course_number": "PAC 307",
  "credits": "1",
  "description": "An introduction to white water rafting. Students will learn the fundamentals of safe rafting, trip planning and become familiar with the gear associated with rafting. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: CANOEING",
  "course_number": "PAC 308",
  "credits": "1",
  "description": "Designed as an introduction to canoeing. Students learn the fundamentals of safe canoeing, trip planning and become familiar with the gear associated with rafting. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: KAYAKING I",
  "course_number": "PAC 309",
  "credits": "1",
  "description": "Focuses on developing technical kayaking skills in flat water and moving water up to Class I. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: STAND UP PADDLEBOARD",
  "course_number": "PAC 311",
  "credits": "1",
  "description": "Covers the curriculum for level 1 and 2 American Canoe Association standup paddle board skill courses. Skills include equipment, environmental factors, techniques, preparation and planning, emergency management, and environmental ethics. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: CANYONEERING",
  "course_number": "PAC 313",
  "credits": "1",
  "description": "Students will learn the fundamentals of canyoneering, including efficient hiking techniques, safe anchoring, belaying and rappelling techniques, and environmental mitigation skills. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: BOULDERING",
  "course_number": "PAC 314",
  "credits": "1",
  "description": "Introduction to the sport of bouldering, a subset of rock climbing using an indoor climbing facility; emphasis on safety, spotting, climbing movement, training techniques and improvement; provides activities that promote muscular strength and endurance, flexibility, and cardiovascular endurance. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: ROCK CLIMBING I",
  "course_number": "PAC 315",
  "credits": "1",
  "description": "Physical conditioning for, and instruction in, the skills and techniques of rock climbing; environmental impact issues; held at on-campus indoor climbing center. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: ROCK CLIMBING II",
  "course_number": "PAC 316",
  "credits": "1",
  "description": "Focuses on developing technical climbing skills related to lead climbing and anchor construction. Includes a one-day outdoor experience. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": ["PAC 315"]
}, {
  "corequisites": [],
  "course_name": "ALI: ROCK CLIMBING III",
  "course_number": "PAC 317",
  "credits": "1",
  "description": "Focuses on developing technical climbing skills in an outdoor setting. Includes a weekend long outdoor experience and cover skills ranging from building anchors using natural protection, to advanced outdoor movement skills. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": ["PAC 315", "PAC 316"]
}, {
  "corequisites": [],
  "course_name": "ALI: TECHNICAL RAPPELLING",
  "course_number": "PAC 319",
  "credits": "1",
  "description": "Students will learn, practice and hone their skills in the art of technical rappelling. Introduces many different styles, techniques and equipment used for rappelling in a variety of situations. Throughout the course, students will be provided with simple to advanced challenges to overcome. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: MOUNTAINEERING I",
  "course_number": "PAC 320",
  "credits": "1",
  "description": "Develop snow climbing techniques and snow camping/living skills; practice anchoring, belaying and rappelling techniques; and apply wilderness ethics. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": ["PAC 330"]
}, {
  "corequisites": [],
  "course_name": "ALI: MOUNTAINEERING II",
  "course_number": "PAC 321",
  "credits": "1",
  "description": "Building on skills learned in Mountaineering I; rope team/glacier travel experience, fundamentals of crevasse rescue, advanced snow climbing techniques, safe anchoring, belaying and rappelling techniques, snow camping/living skills, and wilderness ethics. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": ["PAC 320"]
}, {
  "corequisites": [],
  "course_name": "ALI: ICE CLIMBING",
  "course_number": "PAC 322",
  "credits": "1",
  "description": "Students will learn the fundamentals of ice climbing, including efficient ice climbing techniques, safe anchoring, belaying and rappelling techniques and wilderness ethics. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: MOUNTAIN RESCUE BASICS",
  "course_number": "PAC 323",
  "credits": "1",
  "description": "Focuses on developing technical skills in a mountain rescue system. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": ["PAC 320"]
}, {
  "corequisites": [],
  "course_name": "ALI: WHITE WATER RESCUE",
  "course_number": "PAC 324",
  "credits": "1",
  "description": "Provides an introduction to white water rescue; students learn the fundamentals of white water rescue, scene management, and the necessary gear to perform rescues. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: WILDERNESS FIRST AID",
  "course_number": "PAC 325",
  "credits": "1",
  "description": "Fundamentals of emergency care in a non-urban environment including anatomy, physiology, injury assessment, short-term care, small-group rescues; backcountry emphasis with long-term care and evacuation complications. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: WILDERNESS FIRST AID",
  "course_number": "PAC 325H",
  "credits": "1",
  "description": "Fundamentals of emergency care in a non-urban environment including anatomy, physiology, injury assessment, short-term care, small-group rescues; backcountry emphasis with long-term care and evacuation complications. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: BUSH CRAFT",
  "course_number": "PAC 326",
  "credits": "1",
  "description": "Basic wilderness living techniques, knowledge and skills needed for a student to be ethical and efficient, and have the ability to survive in the outdoors. Special emphasis is placed on building shelters, water purification, navigation, awareness, fire, self-sufficiency and caring for groups in the wilderness. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: RAFT GUIDE SCHOOL",
  "course_number": "PAC 328",
  "credits": "1",
  "description": "Provides students the skills and guided practice time needed to become competent paddle raft guides. It is a nine-day course that focuses on the development of water reading, raft maneuvering, risk management, and whitewater rescue skills needed by raft guides. Successful completion of the course will result in a certificate of completion from the American Canoe Association (ACA). PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: WILDERNESS FIRST RESPONDER",
  "course_number": "PAC 329",
  "credits": "2",
  "description": "Fundamentals of emergency care in a non-urban environment, including physiology, injury assessment, short-term care, anatomy, and small-group rescues. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: SNOW TRAVEL AND CAMPING",
  "course_number": "PAC 330",
  "credits": "1",
  "description": "An introduction to traveling in the backcountry in adverse weather conditions that often accompany winter. Topics covered include cross country touring, snow shoeing, winter camping techniques, and winter safety considerations including introducing avalanche safety. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: CROSS COUNTRY SKIING",
  "course_number": "PAC 331",
  "credits": "1",
  "description": "Introduces the fundamentals of cross-country skiing as a leisure activity, a source of personal fitness, an outdoor travel skill, and a subset of winter backpacking. Discusses equipment, techniques, travel basics, navigation elements, safety concerns, environmental awareness, and stewardship/Leave No Trace principles (LNT). PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: AVALANCHE AWARENESS",
  "course_number": "PAC 332",
  "credits": "1",
  "description": "Focuses on what causes avalanches, how to safely travel in avalanche terrain, and resources to pursue in understanding the avalanche risk where you are traveling. PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ALI: SNOWSHOEING",
  "course_number": "PAC 333",
  "credits": "1",
  "description": "Explores fundamentals of snowshoeing as a leisure activity, a source of personal fitness, an outdoor travel skill, and a subset of winter backpacking. Includes how to choose proper equipment; establish proper techniques, travel basics, navigation elements; addresses safety concerns, environmental awareness, and stewardship / leave-no-trace principles (LNT). PAC courses may not be used to fulfill upper-division requirements.",
  "prerequisites": []
}]