[{
  "corequisites": [],
  "course_name": "SERVICE LEARNING",
  "course_number": "PHAR 001",
  "credits": "0",
  "description": "Engage in a service-learning or community engagement experience where skills and knowledge are applied to meet an authentic community-identified need. The experience will integrate meaningful community service with reflection. Through readings and discussions, critically reflect on the service in order to increase understanding of the discipline, gain a broader appreciation of the discipline, enhance a sense of civic responsibility, and strengthen connections with communities.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEADERSHIP",
  "course_number": "PHAR 002",
  "credits": "0",
  "description": "Provides basic personal and interpersonal leadership skills that can be used within and outside of a work setting. Through practice, the leadership experience helps explore motivation, decision-making, time management, power, team building, conflict, ethics, dealing with change, communication skills, and diversity issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CAPSTONE",
  "course_number": "PHAR 005",
  "credits": "0",
  "description": "Create a culminating project appropriate to the discipline that integrates and applies knowledge and skills from throughout the academic program. In consultation with a faculty mentor, design the content of the capstone experience and the ways in which they reflect on their learning in the experience.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY ORIENTATION",
  "course_number": "PHAR 201",
  "credits": "1",
  "description": "Career opportunities in pharmacy including community and institutional practice, government, and industry. Discussion of available educational pathways. Open to non-pharmacy students.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "TERMINOLOGY OF THE HEALTH SCIENCES",
  "course_number": "PHAR 210",
  "credits": "2",
  "description": "Provides the student in any of the health science disciplines or pre-professional studies with a working knowledge of the terminology used in the health sciences. Open to non-pharmacy students.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "PHAR 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "PHAR 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING & CONFERENCE",
  "course_number": "PHAR 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "PHAR 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "PHAR 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "PHAR 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING & CONFERENCE",
  "course_number": "PHAR 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "PHAR 506",
  "credits": "1-6",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "PHAR 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACOLOGY OF CANNABIS",
  "course_number": "PHAR 520",
  "credits": "2",
  "description": "Discusses actions of cannabis on the human body, concepts of biological response via biochemical or molecular signal transduction mechanisms, natural product drug discovery, safety of medicines and disease-specific therapeutic considerations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HIGH-THROUGHPUT SCREENING: THEORY",
  "course_number": "PHAR 521",
  "credits": "DESIGN",
  "description": "Explores small molecular high-throughput screening including an introduction to screening methods, protocol development, data processing, and follow-up assays.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRUGS AND THE BODY",
  "course_number": "PHAR 522",
  "credits": "3",
  "description": "Explores interactions of chemicals with physiological systems. Focuses on concepts that encompass the effects of the body on a small molecule including absorption, distribution, biotransformation and excretion as well as effects of the drug on the body including interactions with receptors, activation of signaling and toxic outcomes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRUG FORMULATION AND PRODUCT OPTIMIZATION",
  "course_number": "PHAR 523",
  "credits": "3",
  "description": "Builds foundational perspectives in pharmaceutical formulation with emphasis on formulation requirements for drug dosage forms. Examines varied types of sterile and non-sterile formulations, including nanomedicine formulations. Develops an in-depth understanding of drug dosage formulation concepts to optimize drug therapy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF DRUG ACTION I",
  "course_number": "PHAR 525",
  "credits": "3",
  "description": "Introductory course presenting actions of chemicals on physiological systems. Concepts encompass drug absorption and distribution, drug design and characterization of drug interactions with specialized cellular components, and drug biotransformation or excretion.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF DRUG ACTION II",
  "course_number": "PHAR 527",
  "credits": "3",
  "description": "Introductory course presenting actions of chemicals on physiological systems. Concepts encompass drug activation of biological response via biochemical or molecular transduction mechanisms, pharmacogenetics and pharmacogenomics, and drug-induced toxicities.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BIOSTATISTICS WITH APPLICATIONS IN PHARMACOLOGY",
  "course_number": "PHAR 528",
  "credits": "3",
  "description": "Emphasizes statistical methods and data analysis for the pharmaceutical sciences. Topics including visualization/display of data, hypothesis testing (frequentist and Bayesian), regression methods, data clustering, and meta-analysis and issues in clinical trial designs. Covers issues specifically relevant for big data. Illustrates core concepts using examples from pharmacogenomics, drug-drug interactions, diagnostic testing, and personalized medicine.",
  "prerequisites": ["H 524"]
}, {
  "corequisites": [],
  "course_name": "BIOORGANIC CHEMISTRY",
  "course_number": "PHAR 537",
  "credits": "3",
  "description": "A contemporary treatment of the chemistry, enzymology and molecular genetics techniques used in studying major natural products biosynthesis pathways in nature. Offered alternate years.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CANCER BIOLOGY AND THERAPEUTICS",
  "course_number": "PHAR 544",
  "credits": "3",
  "description": "Introduces oncogenes and tumor suppressors in different cancer types, hallmarks of cancer, cancer stem cells, summary of mechanisms of cancer promotion and progression, innate and adaptive immunity, cancer immunology, introduction to cancer chemoprevention using radiation therapy, chemotherapy, targeted therapy and immunotherapy, summary of their mechanisms of action including some structure-activity relationships.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INFECTIOUS DISEASES AND TREATMENTS",
  "course_number": "PHAR 547",
  "credits": "3",
  "description": "Introduction to infectious disease processes and antimicrobial agents, including general clinical microbiology, and structure mechanism of action of anti-bacterials and anti-fungal agents.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRUG ACTIONS IN IMMUNOLOGY AND INFLAMMATION",
  "course_number": "PHAR 548",
  "credits": "3",
  "description": "Review of foundational concepts in immunology, inflammation and tissue repair, and modification of these processes therapeutically through an understanding and application of anti-inflammatory agents and immune system modulators.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACOKINETICS IN DRUG DEVELOPMENT",
  "course_number": "PHAR 556",
  "credits": "3",
  "description": "Presents basic and practical concepts in pharmacokinetics and biopharmaceutics that can be applied to drug-product development and drug therapy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CANCER AND CHEMOPREVENTION",
  "course_number": "PHAR 563",
  "credits": "2",
  "description": "A summary of mechanisms of cancer progression, how cancer is detected, and introduction to chemoprevention using targeted therapy and alternative medicine.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "REGULATORY AFFAIRS IN PHARMACEUTICALS",
  "course_number": "PHAR 567",
  "credits": "3",
  "description": "Reviews key federal regulatory agencies and major pharmaceutical legislation and regulation in the context of the biopharmaceutical industry and health care applications. Provides a combination of scientific principles and methodology with regulatory and quality practices from discovery to manufacturing, safety profiling, and post-approval processes. Discusses drug development procedures including clinical trials current radiation protection standards for humans and the environment as well as organizational responsibility for their implementation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLIED BIOPHARMACEUTICS AND PHARMACOKINETICS",
  "course_number": "PHAR 572",
  "credits": "3",
  "description": "Pharmacokinetics and bioavailability of drugs in clinical care, including changing disease states.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CURRENT TOPICS IN PHARMACEUTICAL SCIENCES",
  "course_number": "PHAR 573",
  "credits": "1-3",
  "description": "Critical evaluation of contemporary pharmaceutics and pharmacokinetics research articles.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NANOMEDICINE",
  "course_number": "PHAR 574",
  "credits": "3",
  "description": "Introduction to the interdisciplinary field of nanomedicine, the use of nanoscale (1-100 nm) phenomena and materials in biomedical applications. Reviews the basic principles of nanotechnology relevant to areas such as diagnostic/molecular imaging, drug delivery, and other novel therapeutics. Topics will be described through both survey of historical developments and the latest scientific developments in the field of nanomedicine.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCES IN MANIPULATING THE HUMAN GENOME",
  "course_number": "PHAR 594",
  "credits": "3",
  "description": "Covers current techniques in genetic engineering used to modify the characteristics of individuals as a prelude to possible future human genetic engineering, including advances in gene manipulation from early recombinant DNA techniques to CRISPR-Cas technology. Emphasizes manipulations of the genomes of individual mammals, and characterization of the effect of those manipulations at levels from the molecular to the physiological. Explores DNA/RNA/protein extraction, polymerase chain reaction, molecular cloning, sequencing (DNA, RNA, and chromatin), expression analyses, gene overexpression, silencing and perturbation.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "PHAR 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "PHAR 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "PHAR 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "PHAR 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO GRANT PROPOSAL WRITING",
  "course_number": "PHAR 669",
  "credits": "2",
  "description": "To introduce students to the fundamentals of writing grant proposals to the National Institute of Health (NIH), different funding mechanisms, as well as the grant reviewing process. CROSSLISTED as PHAR 669/VMB 669.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO SYSTEMS BIOMEDICINE AND PHARMACOGENOMICS",
  "course_number": "PHAR 670",
  "credits": "2",
  "description": "Evaluates and explains ‘next generation’ approaches used in systems biomedicine and pharmacogenomics fields, including but not limited to large scale ‘omics’ data analysis and their integration in biological networks for novel understanding of disease mechanisms, improvement of diagnosis, prognosis and therapies. CROSSLISTED as PHAR 670/VMB 670.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS IN PHARMACEUTICAL SCIENCES",
  "course_number": "PHAR 699",
  "credits": "1-6",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "PHAR 701",
  "credits": "1-8",
  "description": "Research conducted by professional pharmacy students under faculty supervision.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "PHAR 703",
  "credits": "1-8",
  "description": "Independent study and analysis that culminates in a thesis.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH SEMINAR",
  "course_number": "PHAR 704",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "PHAR 705",
  "credits": "1-8",
  "description": "May be repeated for credit.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CAREER PERSPECTIVES AND PROFESSIONAL DEVELOPMENT",
  "course_number": "PHAR 707",
  "credits": "2",
  "description": "Students will explore the necessary knowledge, skills and abilities in order to support professional role formation and ongoing professional development. Students will practice skills related to identifying personal strengths and weaknesses, building self-awareness, creating professional job search materials, communicating professionally in written and oral formats, and participating as a team member.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY PHARMACY PRACTICE EXPERIENCES: COMMUNITY CARE I",
  "course_number": "PHAR 708",
  "credits": "2",
  "description": "Students will be placed in community pharmacies for experiential rotations. Students will gain an understanding of the scope of practice and roles of pharmacy personnel while demonstrating skills related to processing and dispensing functions in the community setting. Students will observe patient counseling and have an opportunity to conduct medication reviews to identify any drug-related problems. In-class discussions of patient cases will explore concepts relating to ethical decision-making, cultural sensitivity and coordinated pharmacy practice topics with other first-year courses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY PHARMACY PRACTICE EXPERIENCES: COMMUNITY CARE II",
  "course_number": "PHAR 709",
  "credits": "2",
  "description": "Students will be placed in community pharmacies for experiential rotations. Students will gain an understanding of the scope of practice and roles of pharmacy personnel while demonstrating skills related to processing and dispensing functions in the community setting. Students will observe patient counseling and have an opportunity to conduct medication reviews to identify any drug-related problems. In-class discussions of patient cases will explore concepts relating to ethical decision-making, cultural sensitivity and coordinated pharmacy practice topics with other first-year courses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FUNDAMENTALS OF INTERPROFESSIONAL COLLABORATION",
  "course_number": "PHAR 711",
  "credits": "1",
  "description": "The first professional year IPE Series is a yearlong course focusing on interprofessional education for students from local colleges (LBCC/OSU/WesternU) representing programs in medical assistant, pharmacy, nursing and osteopathic medicine. Students develop a positive perspective of working with other disciplines, enhanced understanding of their specific role and responsibilities on an interprofessional team, recognize the value of other disciplines providing patient-centered care, and develop a shared accountability for providing patients with safe, high-quality health care.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF PATIENT SAFETY AND INTERPROFESSIONAL PRACTICE",
  "course_number": "PHAR 712",
  "credits": "1",
  "description": "Techniques, best practices and opportunities for improving patient safety through interprofessional teamwork. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPANISH FOR PHARMACY PROFESSIONALS",
  "course_number": "PHAR 713",
  "credits": "2",
  "description": "For the pharmacy professional with little or no Spanish language background (those with some Spanish language skills would find it beneficial). The course is presented in a video format with in-class facilitator for discussion. Provides basic Spanish grammar instruction but the focus will be on vocabulary and communication in a community pharmacy environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPLEMENTARY MEDICINE",
  "course_number": "PHAR 714",
  "credits": "3",
  "description": "Covers vitamins and microminerals and their role in biochemical processes, maintaining health and preventing disease. The course also covers the etiology of obesity and treatment modalities. The course builds upon the general background of students in biochemistry and physiology to provide a common baseline of knowledge and allow for integration of concepts required to understand preventive medicine.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SENIOR CARE PHARMACY",
  "course_number": "PHAR 717",
  "credits": "2",
  "description": "Provides an overview of senior care pharmacy practice including an introduction to the senior patient, the senior care healthcare environment, medication-related problems in the elderly, the role of the pharmacist as a member of the interdisciplinary senior healthcare team, and employment opportunities in senior care pharmacy. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DEVELOPMENT AND MECHANISMS OF ACTION OF CANCER DRUGS",
  "course_number": "PHAR 718",
  "credits": "2",
  "description": "Analysis of the development and mechanisms of action of cancer chemotherapeutic drugs, with an emphasis on natural product sources for lead compounds and biological targets. Discussion of mainstay cancer drugs illustrates historical, current and emerging cancer drug development paradigms. Provides an understanding of how cancer therapeutic agents have evolved and how they intercept pharmacologic targets.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "POISONS AND TOXINS",
  "course_number": "PHAR 719",
  "credits": "2",
  "description": "Covers many different types of substances, including common household poisons, poisonous plants and mushrooms, toxic gases/metals, shellfish toxins, and other natural toxins. Aspects of the chemistry and pharmacology of the poisons, antidotes/treatments, and occasional case studies will be covered. Historical examples and current events will also be incorporated into the course materials.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY PRACTICE I-PRINCIPLES OF INTEGRATED PATIENT CARE",
  "course_number": "PHAR 720",
  "credits": "3",
  "description": "Focuses on self-care therapeutics, clinical data collection and documentation, prescription drug information and education, patient counseling skills, basic pharmacy calculations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY PRACTICE II",
  "course_number": "PHAR 721",
  "credits": "3",
  "description": "Pathophysiology of common conditions, self-care therapeutics, clinical data collection and documentation, prescription drug information and education, patient counseling skills, basic pharmacy calculations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY PRACTICE III: PRINCIPLES OF INTEGRATED PATIENT CARE",
  "course_number": "PHAR 722",
  "credits": "4",
  "description": "Pathophysiology of common conditions, self-care therapeutics, clinical data collection and documentation, prescription drug information and education, patient counseling skills, basic pharmacy calculations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRINCIPLES OF EVIDENCE-BASED MEDICINE II: DRUG LIT EVAL",
  "course_number": "PHAR 726",
  "credits": "3",
  "description": "Students will learn to critique and evaluate health-related scientific journal articles using valid established techniques.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY LAW",
  "course_number": "PHAR 728",
  "credits": "2",
  "description": "Introduces the student to the federal and state agencies and regulations that govern pharmacy practice and provides students with foundational knowledge and skills to comply with state and federal regulations. Emphasis will be on regulations from the Food and Drug Administration, Drug Enforcement Administration, and Oregon Board of Pharmacy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EVIDENCE-BASED PRACTICE I: DRUG INFORMATION SCIENCE",
  "course_number": "PHAR 729",
  "credits": "3",
  "description": "Identifies appropriate information resources and systematically collects, arranges, and analyzes pertinent information related to a particular patient or drug product question.",
  "prerequisites": []
}, {
  "corequisites": ["PHAR 734"],
  "course_name": "COMPOUNDING PHARMACEUTICALS",
  "course_number": "PHAR 732",
  "credits": "1",
  "description": "Introductory laboratory course that demonstrates and provides practice in techniques used in a compounding pharmacy for common pharmaceutical products.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACEUTICS I",
  "course_number": "PHAR 733",
  "credits": "3",
  "description": "Foundational perspectives in physical pharmacy with an emphasis on liquid and parenteral products. Properties and processes that influence compatibility and stability in drug formulation are discussed. Varied types of sterile and non-sterile formulations, including product optimization for drug delivery and patient specific considerations, are examined.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACEUTICS II",
  "course_number": "PHAR 734",
  "credits": "3",
  "description": "Preformulation and formulation factors affecting the development, production and use of pharmaceutical dosage forms, including ingredients in, and physical, chemical, and biological properties affecting storage, stability, and handling of dosage forms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRUG ACTION I: MEDICINAL CHEMISTRY AND PHARMACEUTICS",
  "course_number": "PHAR 735",
  "credits": "3",
  "description": "Introductory course exploring interactions of chemicals with physiological systems. Concepts encompass drug design and characterization of drug interactions with specialized cellular components, drug absorption and distribution, and drug biotransformation or excretion.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRUG ACTION III: AUTONOMIC DRUG ACTION",
  "course_number": "PHAR 736",
  "credits": "3",
  "description": "Drug actions in the autonomic nervous system (ANS) provide a template for understanding drug actions throughout the body. This course provides a complete consideration of pharmacologic and medicinal chemistry principles as they relate to drug interactions with the ANS. Treatment options for selected diseases that respond to drugs acting on the ANS are also addressed.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRUG ACTION II: PHARMACOGENOMICS",
  "course_number": "PHAR 737",
  "credits": "PHARMACOLOGY",
  "description": "Introductory course presenting actions of chemicals on physiological systems. Concepts encompass drug activation of biological response via biochemical or molecular transduction mechanisms, pharmacogenetics and pharmacogenomics, and drug-induced toxicities.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTHCARE SYSTEMS I",
  "course_number": "PHAR 738",
  "credits": "3",
  "description": "Examines the U.S. healthcare industry and how it relates to pharmacy. Emphasizes the changing relationships between healthcare systems, patients, providers of care, hospitals, insurers, employers, and the government.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTHCARE SYSTEMS II",
  "course_number": "PHAR 739",
  "credits": "2",
  "description": "Population-based strategies for improving health and wellness with an emphasis on prevention rather than treatment. We will also look at how social determinants of health affect peoples’ ability to be healthy and how the safety net seeks to close the gap for those who have limited access or resources.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY PRACTICE IV",
  "course_number": "PHAR 740",
  "credits": "3",
  "description": "Basic physical assessment skills and identification of therapeutic endpoints and monitoring parameters for drugs presented in the medicinal chemistry/pharmacology sequence. Students will gain experience in basic physical assessment skills, interviewing skills, history taking, organizing pharmacy notes, and documenting information.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY PRACTICE V",
  "course_number": "PHAR 741",
  "credits": "3",
  "description": "Basic physical assessment skills and identification of therapeutic endpoints and monitoring parameters for drugs presented in the medicinal chemistry/pharmacology sequence. Students will gain experience in basic physical assessment skills, interviewing skills, history taking, organizing pharmacy notes, and documenting information. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY PRACTICE VI",
  "course_number": "PHAR 742",
  "credits": "3",
  "description": "Basic physical assessment skills and identification of therapeutic endpoints and monitoring parameters for drugs presented in the medicinal chemistry/pharmacology sequence. Students will gain experience in basic physical assessment skills, interviewing skills, history taking, organizing pharmacy notes, and documenting information. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY PHARMACY PRACTICE EXPERIENCE: COMMUNITY III",
  "course_number": "PHAR 743",
  "credits": "2",
  "description": "Students are assigned to community, institutional and ambulatory care pharmacy settings, and experiences emphasize topics and communication methods covered in the corresponding pharmacy practice course.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY PHARMACY PRACTICE EXPERIENCE:AMBULATORY CARE I",
  "course_number": "PHAR 744",
  "credits": "2",
  "description": "Students are assigned to institutional or ambulatory care pharmacy settings, and experiences emphasize topics and communication methods covered in the corresponding pharmacy practice course.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY PRACTICE EXPERIENCES: AMBULATORY CARE II",
  "course_number": "PHAR 745",
  "credits": "2",
  "description": "Students are assigned to institutional or ambulatory care pharmacy settings, and experiences emphasize topics and communication methods covered in the corresponding pharmacy practice course. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY MANAGEMENT",
  "course_number": "PHAR 746",
  "credits": "3",
  "description": "Using a case-based format, students will work in groups to “solve” (using SOAP notes) real-world scenarios based in different pharmacy settings. The cases are organized around the major focus areas listed in the schedule. Each group will present their solution and a recap of the actual outcome will be provided whenever available.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INFECTIOUS DISEASES AND TREATMENTS",
  "course_number": "PHAR 747",
  "credits": "3",
  "description": "Introduction to infectious disease processes and antimicrobial agents, including general clinical microbiology, and structure mechanism of action of anti-bacterials and anti-fungal agents.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DRUG ACTIONS IN IMMUNOLOGY AND INFLAMMATION",
  "course_number": "PHAR 748",
  "credits": "3",
  "description": "Review of foundational concepts in immunology, inflammation and tissue repair; and modification of these processes therapeutically through an understanding and application of anti-inflammatory agents and immune system modulators.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACOKINETICS AND BIOPHARMACEUTICS",
  "course_number": "PHAR 750",
  "credits": "4",
  "description": "Pharmacokinetics and bioavailability of drugs in clinical care, including changing disease states.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTEGRATED DRUG STRUCTURE",
  "course_number": "PHAR 752",
  "credits": "ACTION",
  "description": "Drug therapy of central nervous system disorders; molecular, cellular and physiologic basis of drug action; chemical and physical properties affecting drug metabolism, action and toxicities; treatment options; patient and disease-specific therapeutic considerations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTEGRATED DRUG STRUCTURE",
  "course_number": "PHAR 753",
  "credits": "ACTION",
  "description": "Explores drug therapy of pulmonary, GI and cardiovascular disorders and cancer chemotherapy; molecular, cellular and physiologic basis of drug action; chemical and physical properties affecting drug metabolism, action and toxicities; treatment options; patient and disease-specific therapeutic considerations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTEGRATED DRUG STRUCTURE",
  "course_number": "PHAR 754",
  "credits": "ACTION",
  "description": "Drug therapy of endocrine disorders, and men's and women's health issues; molecular, cellular and physiologic basis of drug action; chemical and physical properties affecting drug metabolism, action and toxicities; treatment options; patient and disease-specific therapeutic considerations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTORY PHARMACY PRACTICE EXPERIENCES: INSTITUTIONAL",
  "course_number": "PHAR 760",
  "credits": "2",
  "description": "Students gain familiarity with the provision of patient centered care through the variety of pharmacy services within a health system. Experiences include introduction to acute care services, transitions of care, and introduction to health systems pharmacy. Emphasis is on learning how to ensure patient medication safety by understanding the process of preparing and distributing medication, collecting and analyzing relevant patient information, and providing guidance regarding medication administration and monitoring.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED INTEGRATED DRUG THERAPY I",
  "course_number": "PHAR 761",
  "credits": "8",
  "description": "Pathophysiologic basis of disease and drug therapy management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED INTEGRATED DRUG THERAPY II",
  "course_number": "PHAR 762",
  "credits": "8",
  "description": "Pathophysiologic basis of disease and drug therapy management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY PRACTICE VII",
  "course_number": "PHAR 764",
  "credits": "3",
  "description": "Development of skills for advanced drug therapy problem identification, assessment, and plan resolution for patients with diseases discussed in PHAR 752, 753, 754, 761 and PHAR 762. Students will integrate interviewing, physical assessment, and problem-solving to identify, assess, and resolve drug therapy problems and communicate findings in SOAP notes, care plans, and case presentations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY PRACTICE VIII",
  "course_number": "PHAR 765",
  "credits": "3",
  "description": "Development of skills for application of didactic learning to case-based drug therapy problem identification, assessment, and plan. Content draws on PHAR 761, and PHAR 762, as well as earlier course work. Students will integrate knowledge from multiple courses to problem-solve drug therapy concerns, and communicate findings both orally and in written format.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PRE-APPE READINESS AND COMPLEX CASE ANALYSIS",
  "course_number": "PHAR 767",
  "credits": "3",
  "description": "Confidence and competence needed for advanced practice settings are enhanced utilizing a mixture of benchmark assessment tools and small case discussions of complex patient cases. The focus is to assure readiness to integrate into inter-professional collaborative health care settings and serve diverse patient populations. Knowledge, skills, attitudes, and professional values are assessed and developed. Formative and summative feedback delivered through faculty, peer and self-evaluation help guide student preparation for advanced experiences and life-long learning. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ETHICAL AND LEGAL DECISION MAKING",
  "course_number": "PHAR 768",
  "credits": "1",
  "description": "Student understanding of pharmacy law is assessed, and discussed in the context of pharmacists’ ability to properly respond when legal concepts may not align with ethical decision making in a health profession. Students will apply a framework for ethical decision making and identify personal strategies to maintain currency in pharmacy law and applied ethical decision making.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED PHARMACOKINETICS",
  "course_number": "PHAR 770",
  "credits": "4",
  "description": "A physiologic approach to understanding advanced pharmacokinetic principles.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EVIDENCE BASED PRACTICE II: BIOMEDICAL LITERATURE APPRAISAL",
  "course_number": "PHAR 773",
  "credits": "3",
  "description": "Cover the principles required for evidence-based pharmacy practice, including interpreting and applying results from clinical, humanistic, and economic research to clinical decision-making.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "EVIDENCE BASED PRACTICE III: PRESCRIPTION DRUG POLICY",
  "course_number": "PHAR 774",
  "credits": "3",
  "description": "Develops skills that build on foundations of evidence-based practice and provides experiences related to the population level use of prescription drugs. Develops and applies critical appraisal skills to interpret and synthesize a diversity of medical literature. Explores policy approaches to manage pharmaceutical use effectively and efficiently at the population level.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACUTE MEDICAL EMERGENCIES",
  "course_number": "PHAR 777",
  "credits": "2",
  "description": "Drug therapy management in the critically ill patient. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED ADULT MEDICINE",
  "course_number": "PHAR 778",
  "credits": "2",
  "description": "Adult medicine elective utilizes actual patient cases to enhance knowledge of pharmacy and the pharmacologic basis of therapeutics in the setting of adult medicine, emphasizing application or current guidelines and major clinical trials for commonly encountered disease states. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMUNITY PHARMACY CLERKSHIP",
  "course_number": "PHAR 780",
  "credits": "8",
  "description": "Supervised advanced professional education in ambulatory care pharmacy practice environment. Emphasis is placed on the application of direct and indirect pharmaceutical patient care and direct interactions with other health care professionals. Students will evaluate, assess and monitor pharmacotherapy of acute and chronic diseases in addition to providing drug information. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AMBULATORY PRIMARY CARE CLERKSHIP",
  "course_number": "PHAR 785",
  "credits": "8",
  "description": "Supervised advanced professional education in ambulatory care pharmacy practice environment. Emphasis is placed on the application of direct and indirect pharmaceutical patient care and direct interactions with other health care professionals. Students will evaluate, assess and monitor pharmacotherapy of acute and chronic diseases in addition to providing drug information to patients and health care professionals. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GENERAL INTERNAL MEDICINE CLERKSHIP",
  "course_number": "PHAR 790",
  "credits": "8",
  "description": "Supervised advanced professional education located in internal medicine inpatient pharmacy practice environment. Emphasis is placed on the application of biomedical and pharmaceutical sciences to direct and indirect pharmaceutical patient care and direct interactions with other health care professionals. Students will evaluate, assess, and monitor pharmacotherapy involved in a wide variety of acute and chronic diseases. In addition, students will provide drug information to other health care professionals and patients. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HOSPITAL/HEALTH SYSTEMS PATIENT CARE CLERKSHIP",
  "course_number": "PHAR 792",
  "credits": "8",
  "description": "Supervised advanced professional education located in various hospital or health care systems patient care-oriented settings. Emphasis is placed on application of pharmaceutical sciences and pharmacotherapy to patient care. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PATIENT CARE ELECTIVE CLERKSHIP",
  "course_number": "PHAR 795",
  "credits": "8",
  "description": "Supervised advanced professional education located in various patient care-oriented settings. Emphasis is placed on the application of pharmaceutical sciences and pharmacotherapy to direct and indirect pharmaceutical care. Specialties include but are not limited to geriatrics, pediatrics, infectious disease, oncology, general patient care, nutrition support, nuclear pharmacy, home infusion, critical care, anticoagulation, pain management, etc.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ELECTIVE CLERKSHIP",
  "course_number": "PHAR 797",
  "credits": "8",
  "description": "Supervised advanced professional education located in various pharmacy-oriented settings. Emphasis is placed on the application of pharmaceutical sciences and pharmacotherapy to a variety of environments involving pharmacy. Specialties include but are not limited to managed care, drug information, administration, pharmaceutical research, pharmaceutical industry, professional pharmacy organizations, etc. Graded P/N.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHARMACY HEALTH ADMINISTRATION",
  "course_number": "PHAR 798",
  "credits": "8",
  "description": "Provides students the opportunity to integrate and apply leadership and business principles necessary to operate and manage a pharmacy business or department in a diverse organizational environment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS",
  "course_number": "PHAR 799",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]