[{
  "corequisites": [],
  "course_name": "*QUESTS FOR MEANING: WORLD RELIGIONS",
  "course_number": "REL 160",
  "credits": "4",
  "description": "A survey and analysis of the search for meaning and life fulfillment represented in major religious traditions of the world, such as Hinduism, Buddhism, Taoism, Zen, Confucianism, Judaism, Christianity, and Islam. CROSSLISTED as PHL 160/REL 160.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*QUESTS FOR MEANING: WORLD RELIGIONS",
  "course_number": "REL 160H",
  "credits": "4",
  "description": "A survey and analysis of the search for meaning and life fulfillment represented in major religious traditions of the world, such as Hinduism, Buddhism, Taoism, Zen, Confucianism, Judaism, Christianity, and Islam. CROSSLISTED as PHL 160/REL 160.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*THE IDEA OF GOD",
  "course_number": "REL 170",
  "credits": "4",
  "description": "Concepts and images of God and their connections to world-views, experience, science, gender, society, self-understanding, and religions. CROSSLISTED as PHL 170/REL 170. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "REL 199",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STUDY OF PEACE AND THE CAUSES OF CONFLICT",
  "course_number": "REL 201",
  "credits": "3",
  "description": "Examination of the causes of personal, social, and institutional conflict and peaceful, constructive means of dealing with conflict. The history and current status of peace movements within and outside governments; prospects for world peace. Case studies in peace and conflict. CROSSLISTED as PAX 201/REL 201. (H)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO RELIGIOUS STUDIES",
  "course_number": "REL 202",
  "credits": "4",
  "description": "An introduction to the academic study of religion. It examines the concepts of religion and the sacred, approaches to the study of religion, ubiquitous features of religious experience, including symbol, myth, ritual, and community, understandings of the human condition in diverse religious traditions, and ways religious communities address challenges of pluralism and secularization. CROSSLISTED as PHL 202/REL 202.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*RELIGIOUS ETHICS AND MORAL PROBLEMS",
  "course_number": "REL 206",
  "credits": "4",
  "description": "An examination of the practical ethics of the monotheistic religious traditions of the West--Judaism, Christianity, Islam--and their different approaches to concrete moral problems. Topics include sexuality and marriage, euthanasia, capital punishment, pacifism and just war, and environmentalism. CROSSLISTED as PHL 206/REL 206. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO BUDDHIST TRADITIONS",
  "course_number": "REL 208",
  "credits": "4",
  "description": "Survey of the historical development of Buddhism in India and its spread throughout Asia and beyond by investigating the literature, rituals, history and social structure of the Buddhist traditions of Sri Lanka and Southeast Asia, Tibet and the Himalayan region, China, Taiwan, Korea, Japan, and finally its growth in the West. CROSSLISTED as PHL 208/REL 208. (NC)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*RELIGION IN THE UNITED STATES",
  "course_number": "REL 210",
  "credits": "4",
  "description": "A thematic overview of the historical study of religion in the United States, with an eye toward ways that social and cultural contexts have shaped the religious experience of Americans in different places and times. Surveys a wide array of religious movements, groups, and individuals from the colonial period to present. CROSSLISTED as HST 210/PHL 210/REL 210. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*RELIGION IN THE UNITED STATES",
  "course_number": "REL 210H",
  "credits": "4",
  "description": "A thematic overview of the historical study of religion in the United States, with an eye toward ways that social and cultural contexts have shaped the religious experience of Americans in different places and times. Surveys a wide array of religious movements, groups, and individuals from the colonial period to present. CROSSLISTED as HST 210/PHL 210/REL 210. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO HINDU TRADITIONS",
  "course_number": "REL 213",
  "credits": "4",
  "description": "Survey of the historical development of Hinduism in India and the \"Hindu Diaspora.\" Topics will include the Indus Valley civilization, the Vedic tradition, yoga, and Hindu renunciation, \"Classical\" Hindu theism and devotion, Hindu philosophy and ritual, and modern and contemporary Hinduism. CROSSLISTED as PHL 213/REL 213. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO ISLAMIC TRADITIONS",
  "course_number": "REL 214",
  "credits": "4",
  "description": "Development of Islamic traditions in the Arab world and in the global context. Origins of Islam, the narrative of the Prophet Muhammad, the development of the Qur'an, and the central tenets of Islamic faith and practice. Transformation of Islam from a regional to a global tradition. CROSSLISTED as PHL 214/REL 214. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO JEWISH TRADITIONS",
  "course_number": "REL 215",
  "credits": "4",
  "description": "An introduction to Judaism's traditions, histories, and practices. Covers historical origins and developments from the biblical period through the Middle Ages, and considers Judaism in the modern world. Topics include the Jewish calendar (including holidays and their traditions), Jewish life cycle events, Jewish prayer, and traditional texts such as the Mishnah and Talmud. CROSSLISTED as HST 215/REL 215. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "+NEWER RELIGIONS OF THE WORLD",
  "course_number": "REL 216",
  "credits": "4",
  "description": "Offers students an opportunity to think about what constitutes “religion.” Invites students to understand and debate terminology such as “cult,” “syncretism,” and “spiritual but not religious.” Emphasizes the reality that religion has sometimes sought to reclaim an older social order and other times sought to radically reinvent the social order and create new utopias. Analyzes historical development of religious groups by using race and gender as categories of analysis. Examines at the impact of the internet and social media on religion.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*WORLD-VIEWS AND VALUES IN THE BIBLE",
  "course_number": "REL 220",
  "credits": "4",
  "description": "A study of central portions of the Bible (in the Old Testament: Torah, prophets, psalms, and wisdom; in the New Testament: Jesus, gospels, and letters) from the perspective of the academic discipline of biblical scholarship, exploring the philosophical questions of the relationships between story, myth, thought, values, and understandings of life. CROSSLISTED as PHL 220/REL 220. (H) (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEGAL PERSPECTIVES",
  "course_number": "REL 250",
  "credits": "2",
  "description": "Introduces the study of law and law’s relationship to culture, society, and a variety of adjacent disciplines, including history, philosophy, and religious studies. Familiarizes students with key theories, historical movements, and structures and philosophies of law, emphasizing both US and global contexts. Develops skills in legal modes of analysis and close reading. CROSSLISTED as HST 250/PHL 250/REL 250.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "REL 299",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO CONTEMPLATIVE STUDIES",
  "course_number": "REL 308",
  "credits": "4",
  "description": "Combines a “third-person” scholarly approach with “critical first-person” experience and reflection in the study of contemplative practices. Explores both religious and secular contemplative traditions, practices and worldviews in cultures-of-origin, and as adopted by other cultures and adapted over time. Reviews practices including yoga, movement, meditation, prayer, presence in nature, ritual, service, recitation, introspection, writing and creative expression. Analyzes practices in primary philosophical, religious, historical, cultural, and psychological contexts. Emphasizes textual study, expert dialogues, discussion and development of contemplative skills. Applies principles to social issues and integrates values and meaning-making with career development. CROSSLISTED as PHL 308/REL 308. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*CRITICS OF RELIGION",
  "course_number": "REL 310",
  "credits": "4",
  "description": "An introduction to critiques of religion by Nietzsche, Freud, Marx, and other influential thinkers. Examines the nature, scope, and effects of criticisms that challenge the psychological, moral, political, and epistemological foundations of religious belief, practice, and institutions. CROSSLISTED as PHL 310/REL 310.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*GANDHI AND NONVIOLENCE",
  "course_number": "REL 315",
  "credits": "4",
  "description": "An examination of the life and work of Mohandas K. Gandhi, the 20th century activist and author, and the theory and practice of nonviolence in his life and work. Emphasis will be placed upon Gandhi's biographical narrative, the development of satyagraha, Gandhi's nonviolent approach to social transformation, and post-Gandhian nonviolent movements. CROSSLISTED as PHL 315/REL 315. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTELLECTUAL ISSUES OF MEXICO AND MEXICAN AMERICANS",
  "course_number": "REL 316",
  "credits": "4",
  "description": "The philosophical, social, cultural, and political reality of Mexican Americans and their historical roots in Mexico since the Spanish Conquest. Analysis of internal colonialism, racism, machismo, fatalism, alienation, cultural identity, as well as more contemporary including NAFTA, immigration, and U.S.-Mexican relations. CROSSLISTED as PHL 316/REL 316. (NC)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ANCIENT JEWISH HISTORY",
  "course_number": "REL 324",
  "credits": "4",
  "description": "History of Judaism from the Second Temple through the early Rabbinic period (539 BCE--200 CE). Covers historical origins and developments of Judaism including the canonization of the Bible, Jewish life in the Persian and Greco-Roman worlds, and the beginnings of Diasporic and Rabbinic Judaism. CROSSLISTED as HST 324/REL 324. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ANCIENT JEWISH HISTORY",
  "course_number": "REL 324H",
  "credits": "4",
  "description": "History of Judaism from the Second Temple through the early Rabbinic period (539 BCE--200 CE). Covers historical origins and developments of Judaism including the canonization of the Bible, Jewish life in the Persian and Greco-Roman worlds, and the beginnings of Diasporic and Rabbinic Judaism. CROSSLISTED as HST 324/REL 324. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*EARLY CHRISTIANITY: ORIGINS TO 600",
  "course_number": "REL 325",
  "credits": "4",
  "description": "Traces early Christianity from its origins to the beginning of the Middle Ages. It deals with the origins and Jewish background of Christianity in Palestine, the ministry and teachings of Jesus, the spread of Christianity throughout the Roman Empire by his disciples and early missionaries, the formation of the New Testament canon, the development of Christian doctrine, controversies over heresy, and the origin of monasticism and the Papacy. CROSSLISTED as HST 325/REL 325. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*HISTORY OF CHRISTIANITY",
  "course_number": "REL 326",
  "credits": "4",
  "description": "Examines the history of global Christianity from the fifth through the seventeenth centuries. Themes to be investigated include the evolving relationship between the church and the state; mysticism; conversion and resistance; the emergence of Protestantism; marriage and sex, as well as women in the history of Christianity. CROSSLISTED as HST 326/REL 326.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY OF MEDIEVAL EUROPE",
  "course_number": "REL 327",
  "credits": "4",
  "description": "Cultural, political, and economic history of the European Middle Ages from the fall of the Roman Empire in the West to the Renaissance. Covers 284 A.D. to 1000. Not offered every year. CROSSLISTED as HST 327/REL 327. (H)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY OF MEDIEVAL EUROPE",
  "course_number": "REL 328",
  "credits": "4",
  "description": "Cultural, political, and economic history of the European Middle Ages from the fall of the Roman Empire in the West to the Renaissance. Covers 1000 to 1400. Not offered every year. CROSSLISTED as HST 328/REL 328. (H)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY OF EARLY MODERN EUROPE",
  "course_number": "REL 330",
  "credits": "4",
  "description": "Political, social, intellectual, and cultural history of Europe from 1400-1789. Focuses on the Reformation. Not offered every year. CROSSLISTED as HST 330/REL 330. (H)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PACIFISM",
  "course_number": "REL 344",
  "credits": "JUST",
  "description": "An examination of the philosophical and theological issues pertaining to pacifism, justified war, and forms of terrorism in Islamic and Western traditions. Special attention is given to concepts of jihad, justifications of war, and restraints on conduct in war. CROSSLISTED as PHL 344/REL 344.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*FIRST FREEDOM: RELIGIOUS LIBERTY AND INTOLERANCE",
  "course_number": "REL 345",
  "credits": "4",
  "description": "An examination of the religious, philosophical, political, and historical issues regarding religious freedom, conscience, and disestablishment as enshrined in the First Amendment and as illustrated by historical and contemporary examples of religious intolerance in the United States. CROSSLISTED as PHL 345/REL 345. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*EARLY LATIN AMERICA",
  "course_number": "REL 350",
  "credits": "4",
  "description": "History of Latin America leading up to and after Spanish and Portuguese conquest. Focus on indigenous American, European and African cultures and religions in contact under colonial government and economic systems. Covers the period from 1400 to 1810. CROSSLISTED as HST 350/REL 350. (H) (NC) (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*UNITED STATES RELIGION AND SOCIAL REFORM",
  "course_number": "REL 364",
  "credits": "4",
  "description": "Provides an awareness of how various religious groups have thought about and engaged with social change pertaining to slavery, feminism, civil rights, same-sex marriage, and immigration. Focus on reading primary sources related to each of these issues. CROSSLISTED as HST 364/REL 364. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PHILOSOPHIES OF CHINA",
  "course_number": "REL 371",
  "credits": "4",
  "description": "A study of the traditional philosophies of China, including Confucianism, Taoism, Mohism, Legalism, and Buddhism. Not offered every year. CROSSLISTED as PHL 371/REL 371. (NC) (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*AFRICAN AMERICAN RELIGION",
  "course_number": "REL 372",
  "credits": "4",
  "description": "Introduces the history of African American religious experience in the United States from the colonial era to the present. Examines African influences on black American religions and flowering of new religious movements among African Americans during the Great Migration. Explores African-American religion in the civil rights and black consciousness movements, and explores in detail the growth of the Nation of Islam during this period. Discusses recent roles of Black religions in contemporary U.S. politics and African American life. CROSSLISTED as HST 372/REL 372. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*RELIGION AND GENDER: A GLOBAL PERSPECTIVE",
  "course_number": "REL 378",
  "credits": "4",
  "description": "Introduces students to the academic study of religion, as well as the academic study of gender. In order to offer a global perspective, we will read a series of case studies that deal with the religion as a gendered experience. Students will produce two essays, one of which will be based on independent research. CROSSLISTED as HST 378/REL 378/WGSS 378.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*RELIGION AND GENDER: A GLOBAL PERSPECTIVE",
  "course_number": "REL 378H",
  "credits": "4",
  "description": "Introduces students to the academic study of religion, as well as the academic study of gender. In order to offer a global perspective, we will read a series of case studies that deal with the religion as a gendered experience. Students will produce two essays, one of which will be based on independent research. CROSSLISTED as HST 378/REL 378/WGSS 378.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ISLAMIC CIVILIZATION",
  "course_number": "REL 387",
  "credits": "4",
  "description": "Political, social, and religious developments from 600 to 1400. Early history and the formation of Islamic society to the Mongol invasion. CROSSLISTED as HST 387/REL 387. (H) (NC) (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ISLAMIC CIVILIZATION",
  "course_number": "REL 388",
  "credits": "4",
  "description": "Political, social, and religious developments from 1400 to the present. The expansion of Islam, Turkic, and Asian dynasties, impact of Western imperialism and modern Islamic world. CROSSLISTED as HST 388/REL 388. (H) (NC) (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "REL 399",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "REL 402",
  "credits": "1-12",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "REL 405",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^SEMINAR",
  "course_number": "REL 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "REL 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GREAT FIGURES IN PHILOSOPHY",
  "course_number": "REL 411",
  "credits": "4",
  "description": "Study of the works of a major philosopher such as Plato, Aristotle, Descartes, Hume, Kant, or Marx. Each course normally devoted to the work of a single figure. CROSSLISTED as PHL 411/REL 411.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SELECTED TOPICS",
  "course_number": "REL 415",
  "credits": "1-4",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*THE HOLOCAUST IN ITS HISTORY",
  "course_number": "REL 425",
  "credits": "4",
  "description": "An inquiry into the causes, course, and impact of the Holocaust. The general theme of anti-Semitism in European history is explored for background. Topics discussed for comparative purposes include anti-Semitism in American history; other episodes of mass murder in the 20th century. CROSSLISTED as HST 425/REL 425 and HST 525/REL 525.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*THE HOLOCAUST IN ITS HISTORY",
  "course_number": "REL 425H",
  "credits": "4",
  "description": "An inquiry into the causes, course, and impact of the Holocaust. The general theme of anti-Semitism in European history is explored for background. Topics discussed for comparative purposes include anti-Semitism in American history; other episodes of mass murder in the 20th century. CROSSLISTED as HST 425/REL 425 and HST 525/REL 525.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY OF BUDDHIST PHILOSOPHY",
  "course_number": "REL 430",
  "credits": "4",
  "description": "Examination of the major philosophical schools, texts, and thinkers in Buddhist history, emphasizing its Indian origins, but looking beyond to the various Buddhist traditions throughout Asia. CROSSLISTED as PHL 430/REL 430 and PHL 530/REL 530.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BUDDHISM",
  "course_number": "REL 431",
  "credits": "NON-VIOLENCE",
  "description": "Investigates the philosophical grounding of Buddhist ideas about non-violence, justice and social responsibility. Looks at broad-based Buddhist social activism movements and leaders; their methods of training, issues and types of actions taken by \"Socially Engaged Buddhists\" living Buddhist traditions. CROSSLISTED as PHL 431/REL 431 and PHL 531/REL 531.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*YOGA AND TANTRIC TRADITIONS",
  "course_number": "REL 432",
  "credits": "4",
  "description": "An examination of the theory and practice of yoga and tantra in the traditions of Hinduism, Buddhism, and Jainism, and in their contemporary popular manifestations. Emphasis on the representation of yoga and tantra in Indian literature and history, including contemplative practices, bodily disciplines, and ritual. CROSSLISTED as PHL 432/REL 432 and PHL 532/REL 532.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*THEORY AND PRACTICE OF MODERN YOGA",
  "course_number": "REL 433",
  "credits": "4",
  "description": "An examination of the phenomenon of modern yoga in theory and in practice. Emphasis on the roots of contemporary forms of yoga in the intersection between traditional Hindu and Buddhist formulations of yoga, Indian wrestling and martial arts, European gymnastics, and cosmopolitan conceptions of \"bodily culture\" of both European and Indian origins. CROSSLISTED as PHL 433/REL 433.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SPIRITUALITY AND ECOLOGY: GREEN YOGA",
  "course_number": "REL 434",
  "credits": "4",
  "description": "An exploration of the relationship between spirituality and ecological engagement in traditional contexts and in contemporary spirituality, with a global focus on contemplative practices rooted in Indian tradition, such as yoga. CROSSLISTED as PHL 434/REL 434 and PHL 534/REL 534.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SPIRITUALITY AND ECOLOGY: GREEN YOGA",
  "course_number": "REL 434H",
  "credits": "4",
  "description": "An exploration of the relationship between spirituality and ecological engagement in traditional contexts and in contemporary spirituality, with a global focus on contemplative practices rooted in Indian tradition, such as yoga. CROSSLISTED as PHL 434/REL 434 and PHL 534/REL 534.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "YOGA PHILOSOPHY",
  "course_number": "REL 435",
  "credits": "2",
  "description": "Explores selected sutras from Patanjali’s classical yogic texts through a contemporary lens. Utilizes introductory Sanskrit pronunciation and definitions. Includes an experiential component with mediation, breath, reflection and postural techniques for greater synthesis of concepts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHILOSOPHY AND RELIGION",
  "course_number": "REL 436",
  "credits": "3",
  "description": "Examination of significant philosophical issues or movements and their relationship to theology and religion. CROSSLISTED as PHL 436/REL 436 and REL 536.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED YOGA TEACHING SEMINAR I",
  "course_number": "REL 437",
  "credits": "2",
  "description": "Develops upon yoga instructional methods and applies anatomy, physiology, biomechanics, and teaching methodology in yoga sequencing with a focus on adaptations and misadaptations in the postural practice. Examines professional ethics for yoga teachers. Further develops personal teaching approach, verbal articulation, observation, and demonstration for teaching with application to both specific populations and diverse groups.",
  "prerequisites": ["PAC 204"]
}, {
  "corequisites": [],
  "course_name": "ADVANCED YOGA TEACHING SEMINAR II",
  "course_number": "REL 438",
  "credits": "2",
  "description": "Examines guiding meditation and contemplative inquiry, as well as professional ethics. Develops and applies personal teaching philosophy and approach. Emphasizes teacher qualities, theme integration, and marketing.",
  "prerequisites": ["REL 437"]
}, {
  "corequisites": [],
  "course_name": "*WORLD VIEWS AND ENVIRONMENTAL VALUES",
  "course_number": "REL 443",
  "credits": "3",
  "description": "A comparative study of world-views (secular and religious, Western and Eastern, modern and ancient) and how they affect concepts of nature, environmental values, and selected environmental issues. CROSSLISTED as PHL 443/REL 443 and PHL 543/REL 543.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*WORLD VIEWS AND ENVIRONMENTAL VALUES",
  "course_number": "REL 443H",
  "credits": "3",
  "description": "A comparative study of world-views (secular and religious, Western and Eastern, modern and ancient) and how they affect concepts of nature, environmental values, and selected environmental issues. CROSSLISTED as PHL 443/REL 443 and PHL 543/REL 543.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*BIOMEDICAL ETHICS",
  "course_number": "REL 444",
  "credits": "4",
  "description": "Application of ethical principles and decision-making processes to selected problems in medicine, health care, and biotechnology. Special attention given to end-of-life choices, reproductive rights and technologies, organ transplantation, research ethics, genetic engineering, and allocating scarce resources. An interdisciplinary focus that draws on social, legal, economic, and scientific issues in ethical decisions in medicine. CROSSLISTED as PHL 444/REL 444 and REL 544/REL 544.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*BIOMEDICAL ETHICS",
  "course_number": "REL 444H",
  "credits": "4",
  "description": "Application of ethical principles and decision-making processes to selected problems in medicine, health care, and biotechnology. Special attention given to end-of-life choices, reproductive rights and technologies, organ transplantation, research ethics, genetic engineering, and allocating scarce resources. An interdisciplinary focus that draws on social, legal, economic, and scientific issues in ethical decisions in medicine. CROSSLISTED as PHL 444/REL 444 and REL 544/REL 544.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PANDEMICS",
  "course_number": "REL 445",
  "credits": "PLAGUES",
  "description": "Examines the human experience of pandemics and plagues, with a focus on philosophical, theological, ethical, and existential issues communities confront in living through a pandemic. Highlights themes of personal freedom, community solidarity, and possibilities for personal and communal transformation in the wake of pandemics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NATIVE AMERICAN PHILOSOPHIES",
  "course_number": "REL 448",
  "credits": "4",
  "description": "Native American perspectives on ways of knowing, sources of meaning and ethics, the nature of reality, self, community, and cosmos. Includes lectures, scholarship, story-telling, poetry, theater, and music as forums for this exploration. Introduces ideas of leading Native American thinkers about the human relation to the natural world, sources of strength and wisdom, the nature of time and place and spirit, right ways of acting in communities, both civic and biotic, and the place of beauty in a well-lived life. CROSSLISTED as ES 448/PHL 448/REL 448.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DEATH AND DYING",
  "course_number": "REL 455",
  "credits": "3",
  "description": "A multidisciplinary study of cultural, philosophical, and religious perspectives on death, dying, and grieving. CROSSLISTED as PHL 455/REL 455 and PHL 555/REL 555.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RELIGION IN THE AMERICAN WEST",
  "course_number": "REL 470",
  "credits": "4",
  "description": "The history of religion in the American West. Examines four themes in the religious history of the American West: locations (the designation of particular places as special), migrations (movement in and out of the region), adaptations (changes over time, in response to changing conditions), and discrimination (recognition of difference, as well as prejudicial treatment based on difference). Engages with various primary and secondary sources, including texts, films, and photographs. CROSSLISTED as HST 470/REL 470 and HST 570/REL 570.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*HUMAN TECHNOLOGICAL ENHANCEMENT",
  "course_number": "REL 475",
  "credits": "4",
  "description": "Covers analysis and critique of the philosophical and religious implications of technologies that restore or enhance human physical and cognitive capacities. Reflects on the relationships between religion, philosophy, and technology, incorporating theories of the Social Construction of Technology (SCOT) and Science, Technology, and Society (STS). Analyzes examples of human enhancement, including the use of prosthetic limbs, sensory apparatuses, medical enhancement, cybernetics, virtual and augmented reality, nootropics and psychedelics, and life-extension technologies. Applies critical thinking to the complex historical, social, and ethical issues tied to these emergent technologies of human augmentation. CROSSLISTED as PHL 475/REL 475.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*HISTORY OF WHITE SUPREMACY & WHITE NATIONALISM IN THE US & OR",
  "course_number": "REL 476",
  "credits": "4",
  "description": "Offers insight into the development of racial categories and racial discrimination in the United States and, more specifically, Oregon. Considers how white supremacy—the idea that there is a category of people who are white and that those people are intellectually, culturally, and genetically superior to other groups of people—has informed U.S. policies (such as immigration, education, and housing policies). Examines white nationalist movements that have argued for a white ethnostate. CROSSLISTED as HST 476/REL 476 and HST 576/REL 576.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PSYCHEDELICS",
  "course_number": "REL 477",
  "credits": "SPIRITUALITY",
  "description": "Covers analysis and critique of the philosophical and spiritual implications of the use of psychoactive substances in global historical and contemporary contexts. Reflects on the larger historical role of psychoactive substances in the world’s religions and in smaller-scale spiritual movements. Investigates the contemporary global history of psychedelics, including the “first-” and “second-wave” psychedelic movements, with a special focus on the relationship between spiritual, therapeutic, and recreational applications. Analyzes the Oregon Psilocybin Initiative and its place within the larger contexts of the previous spheres of investigation. Applies critical thinking to the complex historical, social, and ethical issues tied to traditional and contemporary uses of psychoactive substances in the global context. CROSSLISTED as PHL 477/REL 477 and PHL 577/REL 577.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RELIGION AND LAW",
  "course_number": "REL 484",
  "credits": "4",
  "description": "Investigates the relationship between religion and law in Jewish, Christian, and Muslim society, as well as modern western “secular” society, considering the question from a theoretical, historical, and contemporary case-study perspective. Looks at the religious origins of legal systems, the ways in which members of religious communities engaged with their own and others’ laws, and the ways in which modern societies have used law to separate “religion” from the state.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY OF BUDDHIST PHILOSOPHY",
  "course_number": "REL 530",
  "credits": "4",
  "description": "Examination of the major philosophical schools, texts, and thinkers in Buddhist history, emphasizing its Indian origins, but looking beyond to the various Buddhist traditions throughout Asia. CROSSLISTED as PHL 430/REL 430 and PHL 530/REL 530.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BUDDHISM",
  "course_number": "REL 531",
  "credits": "NON-VIOLENCE",
  "description": "Investigates the philosophical grounding of Buddhist ideas about non-violence, justice and social responsibility. Looks at broad-based Buddhist social activism movements and leaders; their methods of training, issues and types of actions taken by \"Socially Engaged Buddhists\" living Buddhist traditions. CROSSLISTED as PHL 431/REL 431 and PHL 531/REL 531.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPIRITUALITY AND ECOLOGY: GREEN YOGA",
  "course_number": "REL 534",
  "credits": "4",
  "description": "An exploration of the relationship between spirituality and ecological engagement in traditional contexts and in contemporary spirituality, with a global focus on contemplative practices rooted in Indian tradition, such as yoga. CROSSLISTED as PHL 434/REL 434 and PHL 534/REL 534.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHILOSOPHY AND RELIGION",
  "course_number": "REL 536",
  "credits": "3",
  "description": "Examination of significant philosophical issues or movements and their relationship to theology and religion.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORLD VIEWS AND ENVIRONMENTAL VALUES",
  "course_number": "REL 543",
  "credits": "3",
  "description": "A comparative study of world-views (secular and religious, Western and Eastern, modern and ancient) and how they affect concepts of nature, environmental values, and selected environmental issues. CROSSLISTED as PHL 443/REL 443 and PHL 543/REL 543.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PANDEMICS",
  "course_number": "REL 545",
  "credits": "PLAGUES",
  "description": "Examines the human experience of pandemics and plagues, with a focus on philosophical, theological, ethical, and existential issues communities confront in living through a pandemic. Highlights themes of personal freedom, community solidarity, and possibilities for personal and communal transformation in the wake of pandemics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DEATH AND DYING",
  "course_number": "REL 555",
  "credits": "3",
  "description": "A multidisciplinary study of cultural, philosophical, and religious perspectives on death, dying, and grieving. CROSSLISTED as PHL 455/REL 455 and PHL 555/REL 555.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RELIGION IN THE AMERICAN WEST",
  "course_number": "REL 570",
  "credits": "4",
  "description": "The history of religion in the American West. Examines four themes in the religious history of the American West: locations (the designation of particular places as special), migrations (movement in and out of the region), adaptations (changes over time, in response to changing conditions), and discrimination (recognition of difference, as well as prejudicial treatment based on difference). Engages with various primary and secondary sources, including texts, films, and photographs. CROSSLISTED as HST 470/REL 470 and HST 570/REL 570.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HUMAN TECHNOLOGICAL ENHANCEMENT",
  "course_number": "REL 575",
  "credits": "4",
  "description": "Covers analysis and critique of the philosophical and religious implications of technologies that restore or enhance human physical and cognitive capacities. Reflects on the relationships between religion, philosophy, and technology, incorporating theories of the Social Construction of Technology (SCOT) and Science, Technology, and Society (STS). Analyzes examples of human enhancement, including the use of prosthetic limbs, sensory apparatuses, medical enhancement, cybernetics, virtual and augmented reality, nootropics and psychedelics, and life-extension technologies. Applies critical thinking to the complex historical, social, and ethical issues tied to these emergent technologies of human augmentation. CROSSLISTED as PHL 575/REL 575.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HISTORY OF WHITE SUPREMACY & WHITE NATIONALISM IN THE US & OR",
  "course_number": "REL 576",
  "credits": "4",
  "description": "Offers insight into the development of racial categories and racial discrimination in the United States and, more specifically, Oregon. Considers how white supremacy—the idea that there is a category of people who are white and that those people are intellectually, culturally, and genetically superior to other groups of people—has informed U.S. policies (such as immigration, education, and housing policies). Examines white nationalist movements that have argued for a white ethnostate. CROSSLISTED as HST 476/REL 476 and HST 576/REL 576.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PSYCHEDELICS",
  "course_number": "REL 577",
  "credits": "SPIRITUALITY",
  "description": "Covers analysis and critique of the philosophical and spiritual implications of the use of psychoactive substances in global historical and contemporary contexts. Reflects on the larger historical role of psychoactive substances in the world’s religions and in smaller-scale spiritual movements. Investigates the contemporary global history of psychedelics, including the “first-” and “second-wave” psychedelic movements, with a special focus on the relationship between spiritual, therapeutic, and recreational applications. Analyzes the Oregon Psilocybin Initiative and its place within the larger contexts of the previous spheres of investigation. Applies critical thinking to the complex historical, social, and ethical issues tied to traditional and contemporary uses of psychoactive substances in the global context. CROSSLISTED as PHL 477/REL 477 and PHL 577/REL 577.",
  "prerequisites": []
}]