[{
  "corequisites": [],
  "course_name": "ROBOTS AND GYROSCOPES",
  "course_number": "ROB 417",
  "credits": "4",
  "description": "Covers kinematics, dynamics, and control of robot arms, with cross-over coverage of gyroscopes for situations in which the gyroscopic dynamics help to elucidate principles of three-dimensional motion. Focuses around an integrated series of guided programming assignments in which the students construct a multi-body dynamics simulator from first principles, then use it to explore fundamental ideas in the control of robot arms.",
  "prerequisites": [["ECE 356", "ECE 451", "ME 320", "ME 320H", "ME 430", "ME 430H"]]
}, {
  "corequisites": [],
  "course_name": "APPLIED ROBOTICS",
  "course_number": "ROB 421",
  "credits": "4",
  "description": "Multidisciplinary teams of students design, build, and demonstrate a robotic system, including all sensing, computation, and actuation. The specific task, such as checkers-playing robots, changes each year, and is designed to be challenging for ambitious students. Robots will compete in a friendly competition at the end of the term.",
  "prerequisites": [["ECE 356", "ECE 451", "ME 320", "ME 320H", "ME 430", "ME 430H"]]
}, {
  "corequisites": [],
  "course_name": "INTELLIGENT ROBOTS",
  "course_number": "ROB 456",
  "credits": "4",
  "description": "Foundations of probabilistic reasoning for robotics. Topics include state estimation, robot motion, perception, localization and decision making under uncertainty.",
  "prerequisites": [["ST 314"]]
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "ROB 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "ROB 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "ROB 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "ROB 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "ROB 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO ROBOTICS",
  "course_number": "ROB 514",
  "credits": "4",
  "description": "A broad introduction to the field of robotics, and to the graduate Robotics program. The goal of the class is to take students with different backgrounds (mechanical engineering, computer science, electrical engineering, physics, etc.) and give them a common base in the fundamentals of robotics. A secondary goal is to introduce students to the Robotics program, and to give them some of the skills that will make them successful, both in the program and as a professional roboticist.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO ROBOTICS II",
  "course_number": "ROB 515",
  "credits": "4",
  "description": "Provides experience working with physical robotic systems, with the goal of giving you an understanding of the 'stack' on which higher-level robot control algorithms rest. Covers various useful tips and tricks in working with robots and computer code that often fall outside of the academic curriculum.",
  "prerequisites": [["ROB 514"]]
}, {
  "corequisites": [],
  "course_name": "RESEARCH ROBOTICS",
  "course_number": "ROB 521",
  "credits": "4",
  "description": "Multidisciplinary teams of students will use the backdrop of a robotics competition to generate a research question, then design, build, and demonstrate a robotic system that is used to answer this research question. An example may be a Jenga-playing robot, where students try a new computer vision algorithm, or test a theory on force control. This directly parallels graduate research in robotics, where systems-building is necessary, and toy problems can illustrate research results, but the important focus is a core research question. The specific competition task changes each year, and robots will compete at the end of the term.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEQUENTIAL DECISION MAKING IN ROBOTICS",
  "course_number": "ROB 534",
  "credits": "4",
  "description": "Examines sequential decision making in robotics with a focus on motion planning and related optimization problems applied to fielded systems in marine, aerial, and ground domains. Discussions regarding both fundamental background material as well as cutting edge research in the following areas: discrete planning, sampling-based planning, planning under uncertainty, multi-robot systems, optimization, and performance guarantees.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEARNING-BASED CONTROL",
  "course_number": "ROB 537",
  "credits": "4",
  "description": "Provides an introduction to learning systems and their application to the control of nonlinear systems. Covered topics include neural networks, reinforcement learning, and evolutionary algorithms. Includes project component in which students write a technical paper and give a conference style presentation based on their project.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "MULTIAGENT SYSTEMS",
  "course_number": "ROB 538",
  "credits": "4",
  "description": "Provides an introduction to multiagent systems. In particular, it focuses on how to coordinate agents using different approaches. Covered topics include multiagent learning, game theory, swarms, social choice, and auctions. Includes significant reading and critiquing of assigned papers.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GEOMETRIC MECHANICS",
  "course_number": "ROB 541",
  "credits": "4",
  "description": "An introduction to geometric methods in the analysis of dynamic systems. Using the kinematics of simple robotic systems as a motivating example, we explore topics such as manifolds and Lie groups, representations of velocity, holonomic and nonholonomic constraints, constraint curvature and response to cyclic inputs, distance metrics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACTUATOR DYNAMICS",
  "course_number": "ROB 542",
  "credits": "4",
  "description": "Focuses on how inertia, spring compliance, and other passive dynamics affect highly dynamic, software-controlled systems. Examples include robotic manipulation tasks, robot-human interaction, CNC machines, or legged locomotion. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "KINEMATICS",
  "course_number": "ROB 545",
  "credits": "DYNAMICS",
  "description": "Examines fundamental topics from robot mechanics and control, including rigid-body motion, forward and inverse kinematics, differential kinematics, robot dynamics, linear controllers, and manipulation problems such as grasping.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HUMAN CONTROL SYSTEMS",
  "course_number": "ROB 562",
  "credits": "4",
  "description": "Covers mechanisms of human motor systems and control of the neuromusculoskeletal anatomy followed by functional analysis of these system components. Then all the components are integrated to study feedback control dynamics. Covers classic to modern theories of motor control, adaptation, cognitive involvement, and rehabilitation techniques.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOFT ROBOTICS",
  "course_number": "ROB 564",
  "credits": "4",
  "description": "Soft robotics researchers propose building intelligent machines purely out of stretchable compressible soft materials. The course is centered on term-long projects that will result in real soft robots with the goal of presenting to the international community. The topics covered include rapid digital manufacturing, soft actuators, soft sensors, soft logic, soft energy, applications of soft robotics, and modeling soft mechanics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HUMAN ROBOT INTERACTION",
  "course_number": "ROB 567",
  "credits": "4",
  "description": "The field of human-robot interaction brings together research and application of methodology from robotics, human factors, human-computer interaction, interaction design, cognitive psychology, education and other fields to enable robots to have more natural and more rewarding interactions with humans throughout their spheres of functioning.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL ROBOTICS",
  "course_number": "ROB 568",
  "credits": "4",
  "description": "In-depth exploration of the leading research, design principles, and challenges in Human-Robot Interaction (HRI), with an emphasis on socially interactive robots. Topics include social embodiment, multi-modal communication, human-robot teamwork, social learning, aspects of social psychology and cognition, as well as applications and evaluation with human subjects. Requires participation, lightning talks, student-led lectures, written critiques of class readings, and a group project involving a hypothetical social robotics project.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ROBOTICS AND SOCIETY",
  "course_number": "ROB 571",
  "credits": "4",
  "description": "Examines the relationship between robotic systems (e.g., in manufacturing, military, transportation, and scientific data collection applications) and society through analyzing and discussing research papers, written media, and visual media. Discusses both fundamental background material (technical and non-technical) as well as cutting edge research in the following areas: military ethics, economic ramifications, theories of consciousness, cultural and historical perspectives, medical robotics and human augmentation, technical considerations of building ethical machines, legal implications, and privacy considerations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "ROB 599",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "ROB 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "ROB 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "ROB 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]