[{
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "SCI 004",
  "credits": "0",
  "description": "Provides basic personal and professional skills that can be used within and outside of a work setting. Through practice, this experience guides students in building and maintaining positive professional relationships, networking/mentoring relationships, and enhances students’ understanding of the connection between theory and practice in their respective disciplines.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCIENCE INTERNSHIP",
  "course_number": "SCI 410",
  "credits": "1-12",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF INNOVATION",
  "course_number": "SCI 470",
  "credits": "2",
  "description": "Learn the basic language and the initial skill set needed to address how scientific ideas and research results become innovations – solutions that address societal and market needs. Acquire the skills to become innovators and to create value for all types of academic, small-company, industrial, governmental, and non-profit research and development organizations. Students work in areas aligned with their scientific interests either individually or in a team. CROSSLISTED as CH 470/SCI 470.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH TO INNOVATION",
  "course_number": "SCI 472",
  "credits": "2",
  "description": "Produce a first-pass product-market gap analysis on one example application of a science technology platform in a given market. Define a platform in collaboration with research faculty or from work completed in CH 470/SCI 470. Assess the opportunity – if any – that a product might have for application in a chosen market before planning and conducting scientific research. CROSSLISTED as CH 472/SCI 472.",
  "prerequisites": [["SCI 470", "CH 470"]]
}, {
  "corequisites": [],
  "course_name": "INNOVATION TO IMPACT",
  "course_number": "SCI 474",
  "credits": "2",
  "description": "Build on skills gained in CH 472/SCI 472 to conduct and refine a first pass product-market gap analysis on one example application of a technology platform for a market segment selected from a defined technology platform. Investigate and determine the opportunity – if any – that a product might have in a chosen market before proposing and executing a research plan. CROSSLISTED as CH 474/SCI 474.",
  "prerequisites": [["SCI 472", "CH 472"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SCI 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO NMR THEORY",
  "course_number": "SCI 551X",
  "credits": "2",
  "description": "Examines the basic principles of NMR spectroscopy and provides the theoretical background to understand how NMR experiments work. Explores commonly used theoretical models of NMR and applies these models to analyze NMR experiments, including multidimensional experiments. Examines fundamental topics in NMR including nuclear spin quantum mechanics, the vector model, nuclear spin relaxation, product operators, Fourier transform, pulse sequence analysis, and multi-dimensional NMR.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "APPLICATION OF NMR TO BIOLOGICAL MACROMOLECULES",
  "course_number": "SCI 552X",
  "credits": "2",
  "description": "Examines the application of NMR spectroscopy to the study of protein structure and function. Topics covered include protein structure determination, protein dynamics analysis, and interaction analysis.",
  "prerequisites": [["SCI 551X"]]
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF INNOVATION",
  "course_number": "SCI 570",
  "credits": "2",
  "description": "Learn the basic language and the initial skill set needed to address how scientific ideas and research results become innovations – solutions that address societal and market needs. Acquire the skills to become innovators and to create value for all types of academic, small-company, industrial, governmental, and non-profit research and development organizations. Students work in areas aligned with their scientific interests either individually or in a team. CROSSLISTED as CH 570/SCI 570.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH TO INNOVATION",
  "course_number": "SCI 572",
  "credits": "2",
  "description": "Produce a first-pass product-market gap analysis on one example application of a science technology platform in a given market. Define a platform in collaboration with research faculty or from work completed in CH 570/SCI 570. Assess the opportunity – if any – that a product might have for application in a chosen market before planning and conducting scientific research. CROSSLISTED as CH 572/SCI 572.",
  "prerequisites": [["SCI 570", "CH 570"]]
}, {
  "corequisites": [],
  "course_name": "INNOVATION TO IMPACT",
  "course_number": "SCI 574",
  "credits": "2",
  "description": "Build on skills gained in CH 572/SCI 572 to conduct and refine a first pass product-market gap analysis on one example application of a technology platform for a market segment selected from a defined technology platform. Investigate and determine the opportunity – if any – that a product might have in a chosen market before proposing and executing a research plan. CROSSLISTED as CH 574/SCI 574.",
  "prerequisites": [["SCI 572", "CH 572"]]
}]