[{
  "corequisites": [],
  "course_name": "TECHNOLOGY APPLICATIONS IN SUPPLY CHAIN MANAGEMENT",
  "course_number": "SCLM 350",
  "credits": "4",
  "description": "Introduction to the knowledge and skills necessary to quantify the impact of supply chain management decisions on the bottom line. Basic understanding of accounting, finance, production cost, scheduling, and the link between supply chain and overall financial performance. Management of a company’s integrated supply chain using a sophisticated ERP system.",
  "prerequisites": ["BA 375", "BA 375H"]
}, {
  "corequisites": [],
  "course_name": "SUPPLY AND SOURCING MANAGEMENT",
  "course_number": "SCLM 450",
  "credits": "3",
  "description": "Use of operations and supply chain management to make sourcing and supply decisions in international business contexts. Topics include purchasing/procurement procedures and policy, supply organization, specifications, sourcing strategy, supplier evaluation, competitive bidding, and e-procurement. Global contexts and environmentally and socially responsible supply management are emphasized.",
  "prerequisites": ["BA 270", "BA 270H"]
}, {
  "corequisites": [],
  "course_name": "SERVICE OPERATIONS MANAGEMENT",
  "course_number": "SCLM 451",
  "credits": "3",
  "description": "Focus on the management of global service operations including designing and managing systems to coordinate global information and material flows within and between firms in a supply chain. Covers planning operations, evaluating system alternatives, designing and researching global supply networks, examining complex adaptive systems and evaluating value stream synchronization.",
  "prerequisites": ["BA 375", "BA 375H"]
}, {
  "corequisites": [],
  "course_name": "SUPPLY CHAIN MODELING AND DECISION ANALYSIS",
  "course_number": "SCLM 452",
  "credits": "4",
  "description": "Introduce decision modeling and analysis tools with a particular emphasis on linear programming and stochastic decision making tools for solving various business decision problems pertaining to supply chain management. The major goals are to enhance students’ ability to think, formulate and analyze business problems using optimization and stochastic simulation (Monte Carlo simulation and discrete-event simulation). The case study approach, lectures, discussions and computer-aided problem solving will be used to develop and apply the relevant concepts and methodologies.",
  "prerequisites": ["BA 375", "BA 375H"]
}, {
  "corequisites": [],
  "course_name": "SUPPLY CHAIN ANALYTICS",
  "course_number": "SCLM 453",
  "credits": "3",
  "description": "Explores modeling methods for design, analysis, execution and integration of supply chains. Introduces students to a variety of modeling and optimization techniques for the analysis of strategic, tactical and operational supply chain problems, including demand forecasting, risk analysis, revenue management, distribution and facility location.",
  "prerequisites": ["BA 357", "BA 357H", "BA 375", "BA 375H"]
}, {
  "corequisites": [],
  "course_name": "SUPPLY CHAIN STRATEGY",
  "course_number": "SCLM 457",
  "credits": "4",
  "description": "Covers tools and concepts needed to manage the supply chain effectively. Topics include negotiation, purchasing, logistics operations, and applying e-business tools. Emphasis on creating integrated supply chains.",
  "prerequisites": ["BA 357", "BA 357H"]
}, {
  "corequisites": [],
  "course_name": "SUPPLY CHAIN AND LOGISTICS MANAGEMENT CAPSTONE",
  "course_number": "SCLM 459",
  "credits": "3",
  "description": "Takes a hands-on approach to problem-solving in a real organization. Emphasizes critical problem-solving skills with a topical emphasis on forecasting, inventory management, and supply chain management using a quantitative approach. Applies analytical tools or methodologies to solve business problems solutions and evaluate practical feasibility.",
  "prerequisites": ["SCLM 453"]
}, {
  "corequisites": [],
  "course_name": "SUPPLY AND SOURCING MANAGEMENT",
  "course_number": "SCLM 550",
  "credits": "3",
  "description": "Use of operations and supply chain management to make sourcing and supply decisions in international business contexts. Topics include purchasing/procurement procedures and policy, supply organization, specifications, sourcing strategy, supplier evaluation, competitive bidding, and e-procurement. Global contexts and environmentally and socially responsible supply management are emphasized.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SERVICE OPERATIONS MANAGEMENT",
  "course_number": "SCLM 551",
  "credits": "3",
  "description": "Focus on the management of global service operations including designing and managing systems to coordinate global information and material flows within and between firms in a supply chain. Covers planning operations, evaluating system alternatives, designing and researching global supply networks, examining complex adaptive systems and evaluating value stream synchronization.",
  "prerequisites": ["SCLM 550", "BA 555"]
}, {
  "corequisites": [],
  "course_name": "SUPPLY CHAIN ANALYTICS",
  "course_number": "SCLM 553",
  "credits": "3",
  "description": "Explores modeling methods for design, analysis, execution and integration of supply chains. Introduces students to a variety of modeling and optimization techniques for the analysis of strategic, tactical and operational supply chain problems including demand forecasting, risk analysis, revenue management, distribution and facility location.",
  "prerequisites": ["BA 555"]
}, {
  "corequisites": [],
  "course_name": "GLOBAL LOGISTICS MANAGEMENT: FUNDAMENTALS AND STRATEGY",
  "course_number": "SCLM 557",
  "credits": "3",
  "description": "Learn key concepts, basic strategies, and decision-making tools relevant to logistics management, and apply them to real-world logistics problems faced by companies in the context of managing their global supply chains.",
  "prerequisites": ["SCLM 550", "BA 561"]
}, {
  "corequisites": [],
  "course_name": "SUPPLY CHAIN AND LOGISTICS MANAGEMENT CAPSTONE",
  "course_number": "SCLM 559",
  "credits": "3",
  "description": "Takes a hands-on approach to problem solving in a real organization. Emphasizes critical problem-solving skills with a topical emphasis on forecasting, inventory management, and supply chain management using a quantitative approach. Applies analytical tools or methodologies to solve business problems solutions and evaluate practical feasibility.",
  "prerequisites": ["BA 561", "SCLM 553"]
}]