[{
  "corequisites": [],
  "course_name": "INDEPENDENT PROJECT IN NATURAL RESOURCE SUSTAINABILITY",
  "course_number": "SNR 506",
  "credits": "2",
  "description": "Identifies, poses, frames, and analyzes the various components of an important natural resource sustainability problem within the country, region, or organization and, at the end of term, present a workplan for its resolution.",
  "prerequisites": [["SNR 511", "SNR 512"]]
}, {
  "corequisites": [],
  "course_name": "SUSTAINABLE NATURAL RESOURCE DEVELOPMENT",
  "course_number": "SNR 512",
  "credits": "3",
  "description": "Defines concepts of sustainability in a natural resource context and explains its ecological, social and economic dimensions. Analyzes, synthesizes and applies information and/or data integrating concepts of sustainable natural resources to prepare outline for an independent project.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL ASPECTS OF SUSTAINABLE NATURAL RESOURCES",
  "course_number": "SNR 520",
  "credits": "3",
  "description": "Explores the key principles of social sustainability and the role they play in natural resource-based sustainable communities. Highlights social sustainability indicators relevant to natural resource management.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECONOMICS OF SUSTAINABLE NATURAL RESOURCE MANAGEMENT",
  "course_number": "SNR 521",
  "credits": "3",
  "description": "Focuses on the sources of market failure, the means of correcting market failure, and the real-world examples of making progress toward sustainable resource use by means of market mechanisms.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BASIC BELIEFS AND ETHICS IN NATURAL RESOURCES",
  "course_number": "SNR 522",
  "credits": "3",
  "description": "Examines basic philosophies and ethical systems in American forestry, including Pinchot's agricultural/utilitarian approach and Leopold's biotic/ecological model, compares them to contemporary public attitudes and considers their implications for sustainability.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECOLOGICAL PRINCIPLES OF SUSTAINABLE NATURAL RESOURCES",
  "course_number": "SNR 530",
  "credits": "3",
  "description": "Focus on ecological sustainability and ecological concepts and principles, with examples drawn from forests and arid lands. Exploration of global ecosystems, ecological processes and services, factors that create and maintain diversity, ecosystem health and integrity. Principles for sustainable natural resource management and use.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PLANNING AGROFORESTRY PROJECTS",
  "course_number": "SNR 532",
  "credits": "2",
  "description": "Develop basic understanding and appreciation of agroforestry concepts, systems, technologies and practices as used and applied in tropical and temperate zones of the world.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "NONTIMBER FOREST PRODUCTS: AN INTERDISCIPLINARY INTRODUCTION",
  "course_number": "SNR 533",
  "credits": "3",
  "description": "Interdisciplinary introduction to the culture, history, economy, ecology, policy and management of nontimber forest products (NTFP), e.g., wild foods, medicines, floral greens, craft material and landscaping species. Includes domestic public and private forest and international case studies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SUSTAINABLE MANAGEMENT OF AQUATIC AND RIPARIAN RESOURCES",
  "course_number": "SNR 535",
  "credits": "3",
  "description": "Explores integrated strategies for sustainable management of watersheds, estuaries, coastal zones, and aquatic resources. Special emphasis given to links between land uses and aquatic environments.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GLOBAL ENVIRONMENTAL CHANGE",
  "course_number": "SNR 540",
  "credits": "3",
  "description": "Explore biophysical and social sciences that underlie contemporary global change issues: global biogeochemical cycles, climate system, climate change, threats to biodiversity; human dimensions of climate change, globalization, land cover and land use change, global environmental governance and management tools.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT PROJECT IN NATURAL RESOURCE SUSTAINABILITY",
  "course_number": "SNR 570",
  "credits": "2",
  "description": "Identifies, poses, frames, and analyzes the various components of an important natural resource sustainability problem within the country, region, or organization and, at the end of term, presents a workplan for its resolution. Identifies an important Independent Project within the country, region, or organization.",
  "prerequisites": [["SNR 511", "SNR 512"]]
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "SNR 808",
  "credits": "1-4",
  "description": "Describes the policies, practices, and market mechanisms that enhance ecological, economic, and social sustainability of natural resource production and natural ecosystems. Sustainable natural resource management attempts to meet the needs of the present without compromising the future of people or the ecosystems on which they depend.",
  "prerequisites": []
}]