[{
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SOC 199",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO SOCIOLOGY",
  "course_number": "SOC 204",
  "credits": "3",
  "description": "Development and application of sociological concepts and perspectives concerning human groups; includes attention to socialization, culture, organization, stratification, and societies. Consideration of fundamental concepts and research methodology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO SOCIOLOGY",
  "course_number": "SOC 204H",
  "credits": "3",
  "description": "Development and application of sociological concepts and perspectives concerning human groups; includes attention to socialization, culture, organization, stratification, and societies. Consideration of fundamental concepts and research methodology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INSTITUTIONS AND SOCIAL CHANGE",
  "course_number": "SOC 205",
  "credits": "3",
  "description": "Sociological study of the dynamic organizational nature of society through analysis of social change and major social institutions such as family, education, religion, the economy, and political systems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INSTITUTIONS AND SOCIAL CHANGE",
  "course_number": "SOC 205H",
  "credits": "3",
  "description": "Sociological study of the dynamic organizational nature of society through analysis of social change and major social institutions such as family, education, religion, the economy, and political systems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SOCIAL PROBLEMS AND ISSUES",
  "course_number": "SOC 206",
  "credits": "3",
  "description": "Examination of social problems with particular focus upon U.S. society. Sociological perspectives on definition, description, and analysis of contemporary and recurrent problems in industrialized societies. Investigation of causes and consequences of social problems considered in societal context. (SS) (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROBLEMS IN CRIME AND JUSTICE",
  "course_number": "SOC 207",
  "credits": "3",
  "description": "Analyzes contemporary issues in crime and justice, with a focus on U.S. society. Explores the causes and consequences of major problems and issues in crime and justice including gang activity, terrorism, white collar and environmental crime, gun attitudes and violence, challenges associated with policing, drug use, and mass incarceration.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO CRIME AND JUSTICE",
  "course_number": "SOC 241",
  "credits": "3",
  "description": "Provides a sociological understanding of criminal justice system institutions and processes. Emphasis is placed on understanding the criminal law; police and policing; courts and the prosecution process; and prisons, jails and corrections.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CRIME AND MEDIA",
  "course_number": "SOC 242",
  "credits": "3",
  "description": "Provides a better understanding of how the media constructs perceptions and stereotypes of crime and the criminal justice system. Emphasizes on contemporary crime topics by examining current news outlets, crime TV shows, movies, and podcasts. Provide the tools necessary to decipher fact from fiction in the media representation of crime and the criminal justice system.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO ENVIRONMENT AND SOCIETY",
  "course_number": "SOC 280",
  "credits": "3",
  "description": "Introduces the subdiscipline of environmental sociology that focuses on the relationship between society and the environment. Explores the basic concepts in sociology and applies them to a range of environment and natural resource issues. Examines social policies and actions to address environmental challenges.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SOC 299",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SOCIOLOGY OF THE FAMILY",
  "course_number": "SOC 312",
  "credits": "4",
  "description": "Survey of the family as a social institution. Addresses historical and cultural perspectives with emphasis on family diversity, variations in family form and life style, interdependence between family and other institutions, analysis of major family issues, forces for change in the family. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SOCIOLOGY OF THE FAMILY",
  "course_number": "SOC 312H",
  "credits": "4",
  "description": "Survey of the family as a social institution. Addresses historical and cultural perspectives with emphasis on family diversity, variations in family form and life style, interdependence between family and other institutions, analysis of major family issues, forces for change in the family. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF INTIMATE RELATIONSHIPS",
  "course_number": "SOC 313",
  "credits": "4",
  "description": "Examines the microsociological dynamics of intimate relationships. Perceptions and expectations of intimate relationships are explored. Specific attention will be given to issues, processes, and factors that are involved in the construction and management of intimate relationships in contemporary society.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO RESEARCH METHODS",
  "course_number": "SOC 315",
  "credits": "4",
  "description": "Introduces basic sociological research methods, including study design, measurement, sampling, surveying, and interviewing, as well as ethical and practical dilemmas in constructing sociological research. Emphasizes valuation and critique of existing research.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUANTITATIVE DATA ANALYSIS",
  "course_number": "SOC 316",
  "credits": "4",
  "description": "Provides statistical and computing skills necessary to analyze quantitative sociological data. Covers the construction and interpretation of contingency tables, basic ideas of probability and statistical inference, and an introduction to correlation and regression. Provides an opportunity to learn using at least two statistical software programs. Explores ethical considerations in data reporting.",
  "prerequisites": [["SOC 315"]]
}, {
  "corequisites": [],
  "course_name": "^QUALITATIVE RESEARCH METHODS",
  "course_number": "SOC 318",
  "credits": "4",
  "description": "Emphasizes how to read, critique, and conduct qualitative (non-numerical) social research. Builds on social research learned in SOC 315 and focuses on exploring various theories and methods unique to qualitative research. Provides exposure to examples of excellent qualitative research and writing and provides opportunities to hone research skills by engaging in various practical exercises, which may include field observations, interviews, focus groups, and content analysis. Develops writing skills by describing, comparing, and evaluating materials.",
  "prerequisites": [["SOC 315"]]
}, {
  "corequisites": [],
  "course_name": "DEVIANT BEHAVIOR AND SOCIAL CONTROL",
  "course_number": "SOC 340",
  "credits": "4",
  "description": "Current perspectives, research and theories of deviant behavior. Review and analysis of various approaches and programs designed to prevent and deal with deviant behavior.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "POLICE AND SOCIETY",
  "course_number": "SOC 341",
  "credits": "4",
  "description": "Represents a social scientific examination of the field of policing rather than methods or tactics of crime control. Explores the culture of law enforcement and how police officers perform their duties and create their own impressions of their work. Examines how the field of law enforcement is influenced by historical trends, laws, cultural & occupational values, and social institutions. Discusses stereotypes, routine duties, occupational stressors, and deadly hazards of law enforcement which provide opportunities to practice and improve interpersonal and conflict resolution skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*CRIMES AND VIOLENCE IN INTIMATE RELATIONSHIPS",
  "course_number": "SOC 345",
  "credits": "4",
  "description": "Analyzes the historical, social, political, legal, cultural, and psychological aspects of domestic violence, sexual assault, and stalking. Addresses definitions of the problem, demographics, survivors, perpetrators, witnesses, bystanders, strategies and tactics of abusers and survivors, along with strategies for prevention, intervention, treatment, and social change. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SERIAL HOMICIDE",
  "course_number": "SOC 349",
  "credits": "4",
  "description": "Examines the extent, causes, and social characteristics of serial killers. After examining general criminological theories and the characteristics of “typical murder,” investigates the popular images about serial killers, the motivations of these offenders, the distribution of their crimes over time and across geographical areas, elements surrounding these offenses, and the offenders' methods of selecting victims. Topics include homicide investigation techniques, crime profiling, and the criminal prosecution of serial killers.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEALTH",
  "course_number": "SOC 350",
  "credits": "ILLNESS",
  "description": "Social and cultural factors in the identification, course, and treatment of illness; analysis of selected health settings and professions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SOCIOLOGY OF MENTAL ILLNESS",
  "course_number": "SOC 351",
  "credits": "4",
  "description": "Focuses on how social and cultural context impact mental health, and how the very concepts of mental illness, abnormal or crazy are constructed in the first place, then applied by both “mental health” professionals and persons in their everyday lives. Examines major social models of “mental illness,” aiming to understand and evaluate their basic concepts and assumptions, as well as the response to “mental illness,” including how family, friends, troubled persons and professionals interpret, define and respond to “mental illness” and the processes shaping the policies and practices of the mental health enterprise.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DEATH AND DYING",
  "course_number": "SOC 355",
  "credits": "4",
  "description": "An overview of cross-cultural and historical attitudes and practices around end of life, death and dying. Assessment of contemporary legal, professional, cultural and technological issues surrounding end of life/death and dying.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*POPULATION TRENDS AND POLICY",
  "course_number": "SOC 360",
  "credits": "4",
  "description": "Basic socio-demographic factors affecting population size, distribution, composition and change; examination of local, national, and international trends, and demographic policy.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL MEDIA AND EVERYDAY LIFE",
  "course_number": "SOC 371",
  "credits": "4",
  "description": "Examines key concepts, themes, and theories in the study of social media in today's world. Interconnected themes include communication and the public sphere, self representation, power, and new technologies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*POPULAR CULTURE",
  "course_number": "SOC 372",
  "credits": "4",
  "description": "Critical examination of contemporary popular culture from a sociological perspective. Debates in the field of cultural sociology, including a critique of the distinction between 'high' and 'low' forms of culture, the social distinction between work and leisure time, the influence of society on individual patterns of consumption and personal taste, and the sociology of everyday life. Specific topics include mass media, sports, leisure activities, fashion, youth culture, science fiction, music, talk shows, soap operas, internet chat rooms, personal ads, home shopping, and folklore.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL DIMENSIONS OF SUSTAINABILITY",
  "course_number": "SOC 381",
  "credits": "4",
  "description": "Exploration of the social forces driving current views of sustainability. Specific attention will be given to values and belief systems, as well as social institutions in shaping sustainability issues related to ecologically sound, socially just, and economically viable outcomes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SOC 399",
  "credits": "1-16",
  "description": "Selected topics of special or current interest not covered in other courses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SOC 399H",
  "credits": "1-16",
  "description": "Selected topics of special or current interest not covered in other courses.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "SOC 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "SOC 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "SOC 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "SOC 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "SOC 407",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "SOC 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF WORK AND FAMILY",
  "course_number": "SOC 412",
  "credits": "4",
  "description": "Survey of the intersections between families and work; variations in family structure, policies and paid and unpaid work in the United States; interdependence between paid and unpaid family labor and broader social change.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGICAL THEORY",
  "course_number": "SOC 413",
  "credits": "4",
  "description": "Historical and philosophical foundations of sociological theory; major schools of thought and their major contributors.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "QUALITATIVE RESEARCH METHODS",
  "course_number": "SOC 418",
  "credits": "4",
  "description": "An introduction to the theory and methods of qualitative research. Students will be exposed to various qualitative research methods through practical field exercises. These include ethnographic field observation, content analysis, interviewing, focus groups and unobtrusive measures. Other commonly used methods of collecting qualitative data are also examined. CROSSLISTED as SOC 418 and SOC 518/PPOL 523.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL PSYCHOLOGY",
  "course_number": "SOC 424",
  "credits": "4",
  "description": "Examines individuals in social context; explores dynamics of interpersonal relationships; evaluates link between self and society, including concepts of role/status/identity. Contemporary research design, problems, and findings pertinent to social psychology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SOCIAL INEQUALITY",
  "course_number": "SOC 426",
  "credits": "4",
  "description": "Evolution of social inequality in society. Emphasis upon the causes and consequences of inequality in power, privilege, and prestige in human societies, with special attention to the United States. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GENDER AND SOCIETY",
  "course_number": "SOC 430",
  "credits": "4",
  "description": "Examination of nature and consequences of social differentiation and stratification on the basis of sex and gender. Analysis of social position of women and men in society, focusing on their positions in institutional areas such as the family, politics, work and education. Evaluation of theories of biological, psychological, and sociological bases for the behavior and characteristics of women and men.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF AGING",
  "course_number": "SOC 432",
  "credits": "4",
  "description": "Focuses on the definitions, history, experience and public policies around aging, primarily in the United States. Assesses the implications of a growing older population and explores the diversity of experience of aging across gender, race and social class. Synthesizes data, theory and observations, formulates sociological questions relevant to aging, and evaluates caregiving practices and policies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RACE AND ETHNIC RELATIONS",
  "course_number": "SOC 437",
  "credits": "4",
  "description": "Comparative/international perspective on the social construction of race and ethnicity. Social, economic and political experiences of selected groups in the U.S. and other countries are examined.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "US IMMIGRATION ISSUES IN THE 21ST CENTURY",
  "course_number": "SOC 438",
  "credits": "4",
  "description": "Provides a critical overview of immigration to the United States from a socio-historic perspective. Examines how successive waves of immigrants have influenced American society from the earliest groups of Europeans in the 19th century to the most recently arriving immigrants from Asia, Latin America and the Caribbean.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WELFARE AND SOCIAL SERVICES",
  "course_number": "SOC 439",
  "credits": "4",
  "description": "Analysis of social, political, and economic forces affecting welfare and social service systems, with overview of current programs, policy issues, public opinions, occupational aspects and societal impacts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "JUVENILE DELINQUENCY",
  "course_number": "SOC 440",
  "credits": "4",
  "description": "Contemporary research and theories of juvenile delinquency. Review and evaluation of various strategies and programs designed to prevent delinquency or for treatment of delinquents.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CRIMINOLOGY AND PENOLOGY",
  "course_number": "SOC 441",
  "credits": "4",
  "description": "Review of sociological perspectives on crime and criminal justice, with emphasis upon North America. Review of crime statistics, types of crime, theories of criminality, corrections programs and prisons, and programs to reduce crime.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF DRUG USE AND ABUSE",
  "course_number": "SOC 442",
  "credits": "4",
  "description": "Emphasizes a sociological understanding of drug use, drug problems and drug policy. In order to understand drug use and abuse it is necessary to understand the chemical properties of the substances at issue, the attributes of the people who use and abuse drugs, and the norms and characteristics of the society in which the substance use occurs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSIDE-OUT: PRISONS",
  "course_number": "SOC 444",
  "credits": "COMMUNITIES",
  "description": "Course takes place in a state correctional facility, with OSU students learning alongside \"inside\" students from the facility for a full quarter. Course content examines prisons, communities, crime, and prevention from a sociological perspective. All students participate in service-learning projects.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSIDE-OUT: PRISONS",
  "course_number": "SOC 444H",
  "credits": "COMMUNITIES",
  "description": "Course takes place in a state correctional facility, with OSU students learning alongside \"inside\" students from the facility for a full quarter. Course content examines prisons, communities, crime, and prevention from a sociological perspective. All students participate in service-learning projects.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LAW AND SOCIETY",
  "course_number": "SOC 448",
  "credits": "4",
  "description": "An introduction to social scientific approaches to law, covering major topics in the area. Topics may include disputing, legal consciousness, social movements and law, punishment, legal actors, and legal institutions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LAW",
  "course_number": "SOC 449",
  "credits": "CRIME",
  "description": "Surveys criminal justice policies aimed at enforcing laws, reducing crime, punishing violators, and rehabilitating ex-offenders. Interrogates the behavioral assumptions used in creating and evaluating policies. Examines specific crimes and the policies used to address them.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF EDUCATION",
  "course_number": "SOC 450",
  "credits": "4",
  "description": "Contemporary perspectives and research on schools, students, teachers and social forces affecting the educational system. Review of comparative and evaluation research on alternative educational strategies and programs. Overview of the literature of educational critics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF RELIGION",
  "course_number": "SOC 452",
  "credits": "4",
  "description": "Social patterns within U.S. religious groups, relation of religious groups to society, and the methodological problems in studying such groups.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF SPORT",
  "course_number": "SOC 453",
  "credits": "4",
  "description": "Critical analysis of sport. Examines sport socialization; deviance; violence; gender; race/ethnicity; professional sport careers; intercollegiate athletics; marriage/family; and the media.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEISURE AND CULTURE",
  "course_number": "SOC 454",
  "credits": "4",
  "description": "Examination of the social, cultural, and global significance of leisure activity (in particular, tourism and recreation) from a historical perspective relative to attitudes, values, behaviors, and use of natural resources.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SCIENCE AND TECHNOLOGY IN SOCIAL CONTEXT",
  "course_number": "SOC 456",
  "credits": "4",
  "description": "Study of social aspects of science and technology (values, practices, organization, impacts) by analysis of issues revealing their relationship to other social and cultural processes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE SOCIOLOGY OF GLOBALIZATION",
  "course_number": "SOC 460",
  "credits": "4",
  "description": "Examines the sociological effect of globalization on Western and non-Western societies. The course focuses on changes in the global economy and how this has influenced the social structure, patterns of change, and mutual influences among societies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COLLECTIVE BEHAVIOR",
  "course_number": "SOC 470",
  "credits": "4",
  "description": "Examines current theories; focuses on behavior in crowds and diverse social settings including fads/fashions, ecstatic crowds/miracles, natural/technological disasters, urban legends, collective delusions/mass hysteria, protest/demonstrations, riots/mobs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROTESTS AND SOCIAL CHANGE",
  "course_number": "SOC 471",
  "credits": "4",
  "description": "Introduces core theoretical and methodological issues related to social movements in the US and abroad. Emphasizes social forces giving rise to movements, tactics employed by movements, and impacts of them on society. CROSSLISTED as PPOL 471/SOC 471 and PPOL 571/SOC 571.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROTESTS AND SOCIAL CHANGE",
  "course_number": "SOC 471H",
  "credits": "4",
  "description": "Introduces core theoretical and methodological issues related to social movements in the US and abroad. Emphasizes social forces giving rise to movements, tactics employed by movements, and impacts of them on society. CROSSLISTED as PPOL 471/SOC 471 and PPOL 571/SOC 571.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RURAL SOCIOLOGY",
  "course_number": "SOC 475",
  "credits": "4",
  "description": "Helps students understand the rich diversity in rural society, with an emphasis on the interdependencies between urban and rural contexts. Current issues and social problems experienced by rural populations and how sociology is used to understand and address issues affecting rural communities are explored.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ENVIRONMENTAL SOCIOLOGY",
  "course_number": "SOC 480",
  "credits": "4",
  "description": "Explores the evolution of environmental thought, paradigm shifts, and institutional structures associated with environmental concerns, social movements, and social impacts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SOCIETY AND NATURAL RESOURCES",
  "course_number": "SOC 481",
  "credits": "4",
  "description": "Explores the complex interrelationships between humans and natural resources, emphasizing how management decisions and organizations are enmeshed in social and cultural contexts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*ENERGY",
  "course_number": "SOC 482",
  "credits": "CLIMATE",
  "description": "Explores the complex interrelationships between humans and energy, emphasizing the role of energy in critical social issues, including but not limited to: domestic and international conflict, poverty, social change, inter-generational equity, energy transitions and environmental justice. CROSSLISTED as PPOL 441/SOC 482.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SOC 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SOC 499H",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "SOC 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "SOC 502",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "SOC 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "SOC 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "SOC 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "SOC 507",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "SOC 508",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "SOC 510",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF WORK AND FAMILY",
  "course_number": "SOC 512",
  "credits": "4",
  "description": "Survey of the intersections between families and work; variations in family structure, policies and paid and unpaid work in the United States; interdependence between paid and unpaid family labor and broader social change.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGICAL THEORY",
  "course_number": "SOC 513",
  "credits": "4",
  "description": "Historical and philosophical foundations of sociological theory; major school of thought and their major contributors.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL PSYCHOLOGY",
  "course_number": "SOC 524",
  "credits": "4",
  "description": "Examines individuals in social context; explores dynamics of interpersonal relationships; evaluates link between self and society, including concepts of role/status/identity. Contemporary research design, problems, and findings pertinent to social psychology.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL INEQUALITY",
  "course_number": "SOC 526",
  "credits": "4",
  "description": "Evolution of social inequality in society. Emphasis upon the causes and consequences of inequality in power, privilege, and prestige in human societies, with special attention to the United States.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GENDER AND SOCIETY",
  "course_number": "SOC 530",
  "credits": "4",
  "description": "Examination of nature and consequences of social differentiation and stratification on the basis of sex and gender. Analysis of social position of women and men in society, focusing on their positions in institutional areas such as the family, politics, work and education. Evaluation of theories of biological, psychological, and sociological bases for the behavior and characteristics of women and men.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF AGING",
  "course_number": "SOC 532",
  "credits": "4",
  "description": "Focuses on the definitions, history, experience and public policies around aging, primarily in the United States. Assesses the implications of a growing older population and explores the diversity of experience of aging across gender, race and social class. Synthesizes data, theory and observations, formulates sociological questions relevant to aging, and evaluates caregiving practices and policies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RACE AND ETHNIC RELATIONS",
  "course_number": "SOC 537",
  "credits": "4",
  "description": "Comparative/international perspective on the social construction of race and ethnicity. Social, economic and political experiences of selected groups in the U.S. and other countries are examined.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "US IMMIGRATION ISSUES IN THE 21ST CENTURY",
  "course_number": "SOC 538",
  "credits": "4",
  "description": "Provides a critical overview of immigration to the United States from a socio-historic perspective. Examines how successive waves of immigrants have influenced American society from the earliest groups of Europeans in the 19th century to the most recently arriving immigrants from Asia, Latin America and the Caribbean.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WELFARE AND SOCIAL SERVICES",
  "course_number": "SOC 539",
  "credits": "4",
  "description": "Analysis of social, political, and economic forces affecting welfare and social service systems, with overview of current programs, policy issues, public opinions, occupational aspects and societal impacts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "JUVENILE DELINQUENCY",
  "course_number": "SOC 540",
  "credits": "4",
  "description": "Contemporary research and theories of juvenile delinquency. Review and evaluation of various strategies and programs designed to prevent delinquency or for treatment of delinquents.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "CRIMINOLOGY AND PENOLOGY",
  "course_number": "SOC 541",
  "credits": "4",
  "description": "Review of sociological perspectives on crime and criminal justice, with emphasis upon North America. Review of crime statistics, types of crime, theories of criminality, corrections programs and prisons, and programs to reduce crime.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF DRUG USE AND ABUSE",
  "course_number": "SOC 542",
  "credits": "4",
  "description": "Emphasizes a sociological understanding of drug use, drug problems and drug policy. In order to understand drug use and abuse it is necessary to understand the chemical properties of the substances at issue, the attributes of the people who use and abuse drugs, and the norms and characteristics of the society in which the substance use occurs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INSIDE-OUT: PRISONS",
  "course_number": "SOC 544",
  "credits": "COMMUNITIES",
  "description": "Course takes place in a state correctional facility, with OSU students learning alongside \"inside\" students from the facility for a full quarter. Course content examines prisons, communities, crime, and prevention from a sociological perspective. All students participate in service-learning projects.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LAW AND SOCIETY",
  "course_number": "SOC 548",
  "credits": "4",
  "description": "An introduction to social scientific approaches to law, covering major topics in the area. Topics may include disputing, legal consciousness, social movements and law, punishment, legal actors, and legal institutions.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LAW",
  "course_number": "SOC 549",
  "credits": "CRIME",
  "description": "Surveys criminal justice policies aimed at enforcing laws, reducing crime, punishing violators, and rehabilitating ex-offenders. Interrogates the behavioral assumptions used in creating and evaluating policies. Examines specific crimes and the policies used to address them.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF EDUCATION",
  "course_number": "SOC 550",
  "credits": "4",
  "description": "Contemporary perspectives and research on schools, students, teachers and social forces affecting the educational system. Review of comparative and evaluation research on alternative educational strategies and programs. Overview of the literature of educational critics.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF RELIGION",
  "course_number": "SOC 552",
  "credits": "4",
  "description": "Social patterns within U.S. religious groups, relation of religious groups to society, and the methodological problems in studying such groups.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIOLOGY OF SPORT",
  "course_number": "SOC 553",
  "credits": "4",
  "description": "Critical analysis of sport. Examines sport socialization; deviance; violence; gender; race/ethnicity; professional sport careers; intercollegiate athletics; marriage/family; and the media.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "LEISURE AND CULTURE",
  "course_number": "SOC 554",
  "credits": "4",
  "description": "Examination of the social, cultural, and global significance of leisure activity (in particular, tourism and recreation) from a historical perspective relative to attitudes, values, behaviors, and use of natural resources.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCIENCE AND TECHNOLOGY IN SOCIAL CONTEXT",
  "course_number": "SOC 556",
  "credits": "4",
  "description": "Study of social aspects of science and technology (values, practices, organization, impacts) by analysis of issues revealing their relationship to other social and cultural processes.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THE SOCIOLOGY OF GLOBALIZATION",
  "course_number": "SOC 560",
  "credits": "4",
  "description": "Examines the sociological effect of globalization on Western and non-Western societies. The course focuses on changes in the global economy and how this has influenced the social structure, patterns of change, and mutual influences among societies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COLLECTIVE BEHAVIOR",
  "course_number": "SOC 570",
  "credits": "4",
  "description": "Examines current theories; focuses on behavior in crowds and diverse social settings including fads/fashions, ecstatic crowds/miracles, natural/technological disasters, urban legends, collective delusions/mass hysteria, protest/demonstrations, riots/mobs.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROTESTS AND SOCIAL CHANGE",
  "course_number": "SOC 571",
  "credits": "4",
  "description": "Introduces core theoretical and methodological issues related to social movements in the US and abroad. Emphasizes social forces giving rise to movements, tactics employed by movements, and impacts of them on society. CROSSLISTED as PPOL 471/SOC 471 and PPOL 571/SOC 571.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RURAL SOCIOLOGY",
  "course_number": "SOC 575",
  "credits": "4",
  "description": "Helps students understand the rich diversity in rural society, with an emphasis on the interdependencies between urban and rural contexts. Current issues and social problems experienced by rural populations and how sociology is used to understand and address issues affecting rural communities are explored.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL SOCIOLOGY",
  "course_number": "SOC 580",
  "credits": "4",
  "description": "Explores the evolution of environmental thought, paradigm shifts, and institutional structures associated with environmental concerns, social movements, and social impacts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIETY AND NATURAL RESOURCES",
  "course_number": "SOC 581",
  "credits": "4",
  "description": "Explores the complex interrelationships between humans and natural resources, emphasizing how management decisions and organizations are enmeshed in social and cultural contexts.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENERGY",
  "course_number": "SOC 582",
  "credits": "CLIMATE",
  "description": "Explores the complex interrelationships between humans and energy, emphasizing the role of energy in critical social issues, including but not limited to: domestic and international conflict, poverty, social change, inter-generational equity, energy transitions and environmental justice. CROSSLISTED as PPOL 541/SOC 582.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SOC 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WORKSHOP",
  "course_number": "SOC 808",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]