[{
  "corequisites": [],
  "course_name": "LEADERSHIP",
  "course_number": "SUS 002",
  "credits": "0",
  "description": "Provides students with basic personal and interpersonal leadership skills that can be used within and outside of a work setting. Through practice, the leadership experience help students explore motivation, decision-making, time management, power, team building, conflict, ethics, dealing with change, communication skills, and diversity issues.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO ENVIRONMENTAL SCIENCE AND SUSTAINABILITY",
  "course_number": "SUS 102",
  "credits": "4",
  "description": "An introduction to the science behind critical environmental issues and the biological basis of creating and maintaining sustainable ecosystems. Focus on such questions as: how do we decide what to believe about environmental issues? How do we quantify, restore, and value biodiversity? What is valid science in the global warming debate?",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*INTRODUCTION TO CLIMATE CHANGE",
  "course_number": "SUS 103",
  "credits": "4",
  "description": "An introduction to the principles of climate change science with an emphasis on the empirical evidence for climate change. Students will learn critical thinking skills to assess such questions as: How do we determine the processes controlling global warming? How do we predict trends in climate change? How do we calculate and understand uncertainty in these predictions? What is valid science in the global warming debate?",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ORIENTATION TO SUSTAINABILITY",
  "course_number": "SUS 200",
  "credits": "2",
  "description": "Examines the relationship between environmental health and inclusive social well-being. Introduces field of sustainability and how it can complement work in other fields. Focuses on foundational concepts in the field of sustainability as well as key competencies necessary for making progress towards sustainability goals. Explores career opportunities in the field of sustainability.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SUS 299",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SUSTAINABILITY ASSESSMENT",
  "course_number": "SUS 304",
  "credits": "4",
  "description": "Explores theories and application of sustainability assessment techniques and analysis methods. Practical application of globally recognized assessment protocol, including checklists, footprinting, life-cycle analysis and the indicators used to conduct these analyses. Emphasis on ecological and social indicators, although economic indicators are explored.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^AG AND ENVIRONMENTAL PREDICAMENTS: A CASE STUDY APPROACH",
  "course_number": "SUS 325",
  "credits": "3",
  "description": "Analyze controversial agricultural and environmental issues, synthesize information from diverse sources, and apply scientific knowledge to recommend specific courses of action to solve real world problems. Develop oral and written communication skills through individual and group work. CROSSLISTED as CROP 325/SOIL 325/SUS 325.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SUSTAINABILITY",
  "course_number": "SUS 331",
  "credits": "JUSTICE",
  "description": "Many sustainability crises are local, and the people most impacted tend to be groups already experiencing difference, lack of power, and discrimination. Transformational responses led by those most affected will be examined -- responses that address the environmental problem while also building social and economic power for those affected. The tools and tactics used to achieve positive changes will be analyzed.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SUSTAINABILITY",
  "course_number": "SUS 331H",
  "credits": "JUSTICE",
  "description": "Many sustainability crises are local, and the people most impacted tend to be groups already experiencing difference, lack of power, and discrimination. Transformational responses led by those most affected will be examined -- responses that address the environmental problem while also building social and economic power for those affected. The tools and tactics used to achieve positive changes will be analyzed.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*SUSTAINABLE COMMUNITIES",
  "course_number": "SUS 350",
  "credits": "4",
  "description": "Introduction to the concept of sustainable communities from a multidisciplinary perspective. Instructors from a broad array of disciplines and professions. Development of holistic thinking skills and innovative solutions to complex problems.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "SUS 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "SUS 402",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "SUS 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SOCIAL DIMENSIONS OF SUSTAINABILITY",
  "course_number": "SUS 420",
  "credits": "3",
  "description": "Focuses on the social aspects of sustainability, including how the environment, the economy, social life interact to create the world we live in. Explores how social institutions (school, government, business, family) contribute to sustainability and promote or discourage social and environmental justice at local and global scales.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SUSTAINABLE ORGANIZATIONS",
  "course_number": "SUS 450",
  "credits": "3",
  "description": "Provides knowledge and tools to facilitate sustainability transitions at organizational and sectoral levels. Focuses on how pioneering organizations leverage technology, business and management skills, assessment tools, and stakeholder engagement and communication strategies to fully embed sustainability in their operations. Relates policy frameworks to sector-wide transformations. Develops comprehensive sustainability plans for a specific organization.",
  "prerequisites": ["SUS 304", "SUS 350"]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SUS 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "SUS 599",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]