[{
  "corequisites": [],
  "course_name": "INTRODUCTION TO WHITE WATER KAYAKING",
  "course_number": "TRAL 110",
  "credits": "2",
  "description": "Students will learn fundamentals of white water kayaking in sheltered & moving water based on the internationally recognized British Canoe (BC) and American Canoe Association (ACA) teaching and skills certification systems. Emphasis is on activity and basic skills.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO CANOEING",
  "course_number": "TRAL 111",
  "credits": "2",
  "description": "Students will learn fundamentals of canoeing in sheltered & moving water based on the internationally recognized British Canoe (BC) and American Canoe Association (ACA) teaching and skills certification systems. Emphasis is on activity and basic skills.",
  "prerequisites": []
}, {
  "corequisites": [["TRAL 118"]],
  "course_name": "OUTDOOR LIVING SKILLS",
  "course_number": "TRAL 115",
  "credits": "2",
  "description": "Educates and introduces students on how to travel safely in the backcountry through proper preparation, risk awareness, Leave No Trace ethics, terrain recognition, navigation, and camp craft. Classroom and field (lab) experience. Includes one mandatory weekend overnight outing. CROSSLISTED as PAC 115/TRAL 115.",
  "prerequisites": []
}, {
  "corequisites": [["TRAL 115"]],
  "course_name": "LABORATORY FOR OUTDOOR LIVING SKILLS",
  "course_number": "TRAL 118",
  "credits": "1",
  "description": "Practical field application of concepts learned in PAC 115/TRAL 115, Outdoor Living Skills. Field (lab) experience includes one mandatory weekend overnight. Introduces how to travel safely in the backcountry through proper preparation, risk awareness, Leave No Trace ethics, terrain recognition, navigation, and camp craft. CROSSLISTED as PAC 118/TRAL 118.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOUNDATIONS OF OUTDOOR AND ADVENTURE PROFESSIONS",
  "course_number": "TRAL 132",
  "credits": "3",
  "description": "Explores the practical and conceptual aspects of outdoor tourism, adventure, and educational careers. Examines the history, evolution, and theoretical underpinning of outdoor and adventure professions including issues of diversity, accessibility and inclusion. Develops skills and strategies towards professional development and career planning.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERMEDIATE ROCK CLIMBING",
  "course_number": "TRAL 173",
  "credits": "2",
  "description": "Introduces a variety of basic skills, gear and systems that will allow students to safely participate in a single pitch rock climbing environment based on internationally recognized teaching and skills certification systems. Explores various technical skills that will serve as a foundation for future land-based outdoor disciplines. Introduces gear, such as software (ropes, webbing, harnesses) and hardware (carabiners, friction devices); skills, such as knots, belaying, rappelling, lead climbing; and systems such as anchors and basic rescue techniques. CROSSLISTED as PAC 173/TRAL 173.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "GROUP FACILITATION",
  "course_number": "TRAL 215",
  "credits": "4",
  "description": "Introduces facilitation, leadership, and management of groups. Group facilitation theory, techniques, and models for use in a variety of environments and with different populations. Prominent personality types and how to effectively facilitate these. Determining needs, utilizing appropriate techniques, sequencing, and processing to meet specific determined needs of groups.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ROCK SITE MANAGEMENT",
  "course_number": "TRAL 218",
  "credits": "2",
  "description": "Affirms Intermediate Rock foundational skills such as proper equipment, knots, belay & lead climbing techniques, movement, rappelling, and basic climbing anchor systems based on internationally recognized teaching and skills certification systems. Focuses on building upon those foundational skills by covering more complex anchor systems, belay techniques, vertical rescues, releasable rappels and movement through various rock specific terrains.",
  "prerequisites": [["TRAL 173", "PAC 173"]]
}, {
  "corequisites": [],
  "course_name": "WILDERNESS FIRST RESPONDER",
  "course_number": "TRAL 222",
  "credits": "4",
  "description": "Develops skills for assessing and treating problems where access to medical care is delayed or communication is unreliable. Discusses the principles of wilderness medicine, how to perform a comprehensive physical exam, evaluate vital signs and gather critical patient history. Encourages the ability to think through body systems in an effort to determine the best response to traumatic, environmental or medical situations and how to navigate the nuances of medical evacuations.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WILDLAND FIREFIGHTING",
  "course_number": "TRAL 230",
  "credits": "2",
  "description": "Focuses on the fundamentals of firefighting. Provides an overview of the National Wildfire Coordinating Group S-130 firefighter training and S-190 Wildland Fire Behavior.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RECREATION RESOURCE MANAGEMENT",
  "course_number": "TRAL 251",
  "credits": "4",
  "description": "Overview of recreation resource management including study of land and water resources used for outdoor recreation. The planning and management of natural and cultural resources for long-term resource productivity, with a focus on rural and wildlife areas of the forest, range and coast.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERMEDIATE PADDLESPORT",
  "course_number": "TRAL 260",
  "credits": "2",
  "description": "Learn how to successfully paddle as a competent group member within moving water & whitewater environments up to class III. This course will emphasize that the student has a holistic approach to river running, can be an effective group member during river rescues, can contribute to the safety, group skills and leadership of a river descent and showcase the knowledge required of an intermediate whitewater paddler based on internationally recognized British Canoe (BC) and American Canoe Association (ACA) teaching and skills certification systems. Uses a variety of diverse whitewater specific kayaks and canoes.",
  "prerequisites": [["TRAL 110", "PAC 110"], ["TRAL 111", "PAC 111"]]
}, {
  "corequisites": [],
  "course_name": "PRE-INTERNSHIP SEMINAR",
  "course_number": "TRAL 270",
  "credits": "1",
  "description": "Exploration of career goals, internship opportunities, and the variety of practice areas in the tourism, recreation, and adventure leadership (TRAL) professions. Student preparation in planning, obtaining, and completing TRAL internships. The course is designed to assist undergraduate majors in TRAL prepare for the required internship.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OUTDOOR LEADERSHIP FUNDAMENTALS",
  "course_number": "TRAL 280",
  "credits": "3",
  "description": "A week-long outdoor expedition focusing on water-based and land-based skills while developing a comprehensive understanding of expedition behavior. Students will meet in the classroom to prepare for the week-long field expedition covering various topics such as risk management, expedition planning, navigation, water safety and other topics. The expedition will expose students to extended travel in the backcountry while further developing technical and interpersonal skills.",
  "prerequisites": [["TRAL 110", "PAC 110"], ["TRAL 111", "PAC 111"], ["TRAL 115"], ["TRAL 118"], ["TRAL 173"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "TRAL 299",
  "credits": "0-16",
  "description": "Topics of current importance in tourism, recreation, and/or adventure leadership education. Topics will change from term to term. May be repeated with different topics for credit.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACA LEVEL 2-4 KAYAKING INSTRUCTOR",
  "course_number": "TRAL 301",
  "credits": "2",
  "description": "Focuses on fundamentals of white water kayaking based on the internationally recognized American Canoe Association (ACA). Emphasizes safety, enjoyment and skill acquisition for entry-level through intermediate individuals.",
  "prerequisites": [["TRAL 110"], ["TRAL 260"]]
}, {
  "corequisites": [],
  "course_name": "ACA LEVEL 2-4 RAFTING INSTRUCTOR",
  "course_number": "TRAL 302",
  "credits": "2",
  "description": "Focuses on fundamentals of white-water rafting based on the internationally recognized American Canoe Association (ACA). Emphasizes safety, enjoyment and skill acquisition for entry-level through intermediate individuals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACA LEVEL 2-4 STAND UP PADDLEBOARD (SUP) INSTRUCTOR",
  "course_number": "TRAL 303",
  "credits": "2",
  "description": "Focuses on fundamentals of stand up paddleboarding (SUP) based on the internationally recognized American Canoe Association (ACA). Emphasizes safety, enjoyment and skill acquisition for entry-level through intermediate individuals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ACA LEVEL 2-4 CANOE INSTRUCTOR",
  "course_number": "TRAL 304",
  "credits": "2",
  "description": "Focuses on fundamentals of canoeing based on the internationally recognized American Canoe Association (ACA). Emphasizes safety, enjoyment and skill acquisition for entry-level through intermediate individuals.",
  "prerequisites": [["TRAL 111"], ["TRAL 260"]]
}, {
  "corequisites": [],
  "course_name": "ACA LEVEL 2-4 SWIFT WATER RESCUE",
  "course_number": "TRAL 305",
  "credits": "2",
  "description": "Focuses on fundamentals of swift water rescue (SWR) based on the internationally recognized American Canoe Association (ACA). Emphasizes safety, enjoyment and skill acquisition for entry-level through intermediate individuals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "AMGA SINGLE PITCH INSTRUCTOR",
  "course_number": "TRAL 306",
  "credits": "2",
  "description": "Focuses on fundamentals of single pitch climbing based on the internationally recognized American Mountain Guides Association (AMGA). Emphasizes safety, enjoyment and skill acquisition.",
  "prerequisites": [["TRAL 173", "PAC 173"], ["TRAL 218"]]
}, {
  "corequisites": [],
  "course_name": "PMBIA LEVEL 1 MOUNTAIN BIKE INSTRUCTOR",
  "course_number": "TRAL 307",
  "credits": "2",
  "description": "Focuses on fundamentals of mountain biking based on the internationally recognized Professional Mountain Bike Instructor Association (PMBIA). Emphasizes safety, enjoyment and skill acquisition for entry-level through intermediate individuals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERMEDIATE MOUNTAIN BIKING",
  "course_number": "TRAL 308",
  "credits": "2",
  "description": "Focuses on essentials of mountain biking. Emphasizes safety, enjoyment and skill acquisition for entry-level through intermediate individuals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PSIA-AASI LEVEL 1 SKI INSTRUCTOR",
  "course_number": "TRAL 310",
  "credits": "2",
  "description": "Focuses on fundamentals of snowsports based on the Professional Ski Instructors of America (PSIA) and American Association of Snowboard Instructors (AASI) certifications. Emphasizes safety, enjoyment and skill acquisition for entry-level through intermediate individuals.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED ROCK CLIMBING",
  "course_number": "TRAL 311",
  "credits": "2",
  "description": "Focuses on the essentials of traditional and multi-pitch rock climbing. Emphasizes safety, enjoyment and skill acquisition.",
  "prerequisites": [["TRAL 173", "PAC 173"], ["TRAL 218"]]
}, {
  "corequisites": [],
  "course_name": "OUTDOOR RECREATION MANAGEMENT ON PUBLIC LANDS",
  "course_number": "TRAL 351",
  "credits": "3",
  "description": "Explores current issues and problems in outdoor recreation management on public lands and approaches to address these. Emphasis on day-to-day, field-based management of recreation resources, rather than broad-scale planning.",
  "prerequisites": [["TRAL 251", "FES 251"]]
}, {
  "corequisites": [],
  "course_name": "NATURE",
  "course_number": "TRAL 353",
  "credits": "ECO",
  "description": "Examines natural resource-based tourism issues in both domestic and international contexts, with examples from around the world. Explores distinctions between nature-based tourism and other forms of tourism (e.g., traditional mass tourism, adventure tourism, ecotourism), positive and negative impacts of natural resource-based tourism (e.g., social, cultural, economic, environmental), and other related issues such as marketing, accreditation and certification, poverty and pro-poor tourism, and sustainable design.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMMUNITIES",
  "course_number": "TRAL 354",
  "credits": "NATURAL",
  "description": "Introduces students to macro-level community and regional issues associated with tourism in natural areas. Explores positive and negative community impacts associated with tourism, traditional government-based tourism management and policies; community-based tourism management, and partnerships and stakeholder collaboration. Domestic and international examples are used to illustrate concepts and principles.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*PARKS AND PROTECTED AREAS MANAGEMENT",
  "course_number": "TRAL 357",
  "credits": "3",
  "description": "Provides a broad yet comprehensive understanding of the theories, problems, and techniques of managing parks, wild and scenic rivers, wilderness, and other protected areas. Covers the evolution of policies and recent issues in management of these protected areas, in the United States and around the world.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "DESIGN AND MANAGEMENT OF OUTDOOR EXPERIENCES",
  "course_number": "TRAL 370",
  "credits": "4",
  "description": "Introduction to pedagogical, administrative, and organizational knowledge, skills, and dispositions for effective design and management of effective short and extended duration outdoor experiences in wilderness-like areas. Covers personnel logistics, site planning, itinerary planning, educational and skills progression, communication with volunteers and program contacts, budgets.",
  "prerequisites": [["TRAL 280", "TOL 375"]]
}, {
  "corequisites": [],
  "course_name": "OUTDOOR ADVENTURE EDUCATION",
  "course_number": "TRAL 374",
  "credits": "3",
  "description": "Rationale for and methods used in the application of outdoor adventure education programs in education, recreation, corporate and human service settings. Historical and contemporary philosophies and practices in outdoor adventure education. Explores the educational, social, and ethical consequences of outdoor adventure education programs. Examines outdoor adventure education in the context of the United States and differing paradigms informing the practice in other cultures internationally. Presents current research in outdoor adventure education.",
  "prerequisites": [["TRAL 130"], ["TRAL 132"], ["TRAL 215"]]
}, {
  "corequisites": [],
  "course_name": "^EXPERIENTIAL EDUCATION",
  "course_number": "TRAL 375",
  "credits": "4",
  "description": "Theory, techniques, and practice of experiential education. Students will define learning objectives, design curriculum, develop teaching materials, and effectively teach a variety of audiences.",
  "prerequisites": []
}, {
  "corequisites": [["TRAL 379"]],
  "course_name": "RIVER EXPEDITION",
  "course_number": "TRAL 377",
  "credits": "5",
  "description": "Develops the knowledge, skills, and dispositions needed to safely and effectively lead, and participate in, an extended water based expedition of one week or longer. Emphasizes technical skill in whitewater kayaks and/or rafts and/or canoes with an additional focus on swift water rescue skills.",
  "prerequisites": [["TRAL 370"], ["TRAL 260"]]
}, {
  "corequisites": [["TRAL 377"]],
  "course_name": "MOUNTAIN EXPEDITION",
  "course_number": "TRAL 379",
  "credits": "10",
  "description": "Develops the knowledge, skills, and dispositions needed to safely and effectively lead and participate in an extended backcountry mountain expedition. Emphasizes spring mountaineering skills and group leadership in a backcountry context.",
  "prerequisites": [["TRAL 370"]]
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "TRAL 399",
  "credits": "0-16",
  "description": "Topics of current importance in tourism, recreation, and/or adventure leadership education. Topics will change from term to term. May be repeated with different topics for credit.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "TRAL 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDEPENDENT STUDY",
  "course_number": "TRAL 402",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "TRAL 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTERNSHIP",
  "course_number": "TRAL 410",
  "credits": "1-16",
  "description": "Full-time supervised professional experience emphasizing functional proficiency under joint sponsorship of university and agency personnel.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ECONOMICS OF RECREATION AND TOURISM",
  "course_number": "TRAL 432",
  "credits": "3",
  "description": "Applications of economic theory, concepts, and methods to outdoor recreation and nature-based tourism resources, projects and plans. Key topics include analyses of economic impacts, benefits and costs, demand and supply, and non-market valuation (e.g., revealed, stated, and benefit transfer methods).",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PLANNING FOR SUSTAINABLE RECREATION",
  "course_number": "TRAL 456",
  "credits": "4",
  "description": "Concepts related to the creation and design of outdoor recreation plans. Techniques for collecting data pertaining to visitor experiences and preferences. Recreation planning at several levels, both for public and private lands, with emphasis on larger scale site planning where recreation is integrated with other resource uses.",
  "prerequisites": [["TRAL 251", "FES 251"]]
}, {
  "corequisites": [],
  "course_name": "PLANNING FOR SUSTAINABLE TOURISM",
  "course_number": "TRAL 457",
  "credits": "4",
  "description": "Examines relationships among tourists, tourism developments, and the planning of tourist attractions and services. Focuses on planning tourist resources and programs within a geographic region, as well as at both the destination and site levels. Planning tools and design concepts are reviewed, analyzed, and applied.",
  "prerequisites": [["TRAL 251", "FES 251"]]
}, {
  "corequisites": [],
  "course_name": "RISK MANAGEMENT IN TOURISM",
  "course_number": "TRAL 476",
  "credits": "RECREATION",
  "description": "Risk management in tourism and outdoor leadership from an operational perspective. Focuses on risk in tourism and outdoor education programs as a contributing factor for learning, growth, and satisfaction of client motivations. Covers the nature of accidents in outdoor settings, addresses the practitioner's perspective of risk in the field, and describes theories and methods of implementing risk management. Covers the ethics of utilizing risk and potentially dangerous activities as a basis for enhancing client education and experience.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*NATURE AND THE HUMAN EXPERIENCE",
  "course_number": "TRAL 479",
  "credits": "3",
  "description": "Examines the human experience with (and within) nature from biological, psychological, spiritual, and international/cultural perspectives. Identifies opportunities for fostering the human-nature connection to achieve organizational goals and individual and societal health. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL INTERPRETATION",
  "course_number": "TRAL 493",
  "credits": "4",
  "description": "Interpretation of natural and cultural features in parks, museums, and similar settings. Emphasis on learning and applying effective communication techniques in the development of brochures, exhibits, talks, museums, and visitor centers.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "TRAL 499",
  "credits": "1-16",
  "description": "Topics of current importance in forest resources issues, education, policies, economics, management, business, social values, silviculture, and biometrics. Topics will change from term to term. May be repeated with different topics for credit. Section 8: Social aspects of natural resource management (3 credits) graded.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "OUTDOOR RECREATION MONITORING AND MANAGEMENT",
  "course_number": "TRAL 530",
  "credits": "3",
  "description": "Explores social and ecological impacts of recreation in protected areas, presents monitoring approaches to assess impacts, and evaluates alternative mitigation measures. Covers recreation ecology, visitor use management approaches, visitor experiences, and management of resources for recreation and other uses. Evaluates strategies to manage specific issues and applies course material to specific case studies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ENVIRONMENTAL INTERPRETATION",
  "course_number": "TRAL 593",
  "credits": "4",
  "description": "Interpretation of natural and cultural features in parks, museums, and similar settings. Emphasis on learning and applying effective communication techniques in the development of brochures, exhibits, talks, museums, and visitor centers.",
  "prerequisites": []
}]