[{
  "corequisites": [],
  "course_name": "WOOD INNOVATIONS FOR SUSTAINABILITY",
  "course_number": "WSE 111",
  "credits": "2",
  "description": "Explores renewable materials and their current applications in society. Covers a breadth of renewable materials use and exposes students to life-cycle thinking.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SANDING AND FINISHING WOOD PRODUCTS",
  "course_number": "WSE 112",
  "credits": "2",
  "description": "Explores sanding and finishing techniques, grounded in a foundation of wood anatomy. Discusses changes in wood on a micro scale through sanding and application of finishes as well as reviews types of sandpaper, sanding tools, types of finishes, and basic finish chemistry. Demonstrates proper sanding techniques and how to select and apply appropriate finishes for different types of woodwork. Explains and examines health risks associated with sanding and finishing. Identifies appropriate PPE to carry out safe practices.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*BIOLOGY",
  "course_number": "WSE 210",
  "credits": "STRUCTURE",
  "description": "Recognizes common plant-based materials commonly used to meet our fiber needs and products that are manufactured from these materials. Describes their growth, the various cell types that constitute plants we frequently utilize, and their arrangements within a stem. Describes important physical and mechanical properties of renewable materials and differences among different plant-based materials, in terms of their fiber characteristics and properties. Distinguishes variety of renewable material based products are from those manufactured from wood.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WOODTURNING WITH SCIENCE I",
  "course_number": "WSE 211",
  "credits": "4",
  "description": "An introduction to scientific woodturning. Students will get a grounding in tools, lathes, sharpening, and set-up, and then will transition into turning basic forms (spindle and bowl). Particular relevance will be placed upon grain orientation, wood moisture content, wood anatomy, wood chemistry, wood species and extractive effects, and how all of these attributed affect both form and function.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BUILDING DESIGN INNOVATION WITH WOOD",
  "course_number": "WSE 225",
  "credits": "3",
  "description": "Critically examines basics of building design and the relevant technical requirements, the solutions available and the specific applications, with a focus on wood-based products and other ligno-cellulosic materials. Examines material properties and product specifications to evaluate and choose a given material for a specific application, adopting quantitative and qualitative criteria. Explores principles of sustainable design, with a focus on the impact of materials and products. Focuses on multi-disciplinary aspects of building design and construction that facilitate communication between manufacturers, architects, engineers, and clients.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FUNGAL DECAY IN YOUR WORLD",
  "course_number": "WSE 240",
  "credits": "4",
  "description": "Examines processes of fungal decay which will be used as a template to describe fundamental biological principles including transcription, translation, DNA replication and cell division, cellular energy production and metabolic pathways. Describes microscopic, molecular and biochemical processes of fungal decay of common commodities used in day-to-day life by humans. Enables the recognition of fungal processes in the human world. Analyzes real-world fungal decay phenomena encountered in day-to-day life.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "COMPUTER AIDED DESIGN OF WOOD PRODUCTS",
  "course_number": "WSE 250",
  "credits": "3",
  "description": "Provides students with the tools and techniques to design and render products, furniture, and structures using Solidworks, as well as create technical drawings that facilitate communication between designers, engineers, and clients. Develops techniques that are applicable to a wide variety of industrial CAD and product design industries worldwide.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "HEMPOLOGY: THE INDUSTRIAL HEMP STORY",
  "course_number": "WSE 266",
  "credits": "3",
  "description": "Introduces the botany, biology and agronomy of the hemp plant, and the origins, historical contexts and implications of contemporary legal and social issues surrounding its use for food, fiber, and building products.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "WSE 299",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ANATOMY OF WOODY PLANTS",
  "course_number": "WSE 320",
  "credits": "3",
  "description": "Describe the anatomy of plant-based materials commonly used by society. Recognize cell types present in the stem and bark of commercially important plants and their origins. Describe the function of cell types in hardwoods, softwoods and monocots. Identify common North American hardwoods and softwoods based on macro- and microscopic features.",
  "prerequisites": [["WSE 210"]]
}, {
  "corequisites": [],
  "course_name": "WOOD CHEMISTRY",
  "course_number": "WSE 321",
  "credits": "3",
  "description": "Emphasizes chemical structures and chemical properties of renewable plant-based materials, especially wood, at the molecular level. Covers chemical compositions of different renewable materials. Discusses chemical and biochemical modifications and applications of renewable materials.",
  "prerequisites": [["CH 122", "CH 202", "CH 232", "CH 232H"]]
}, {
  "corequisites": [],
  "course_name": "PHYSICAL AND MECHANICAL PROPERTIES OF WOOD",
  "course_number": "WSE 322",
  "credits": "4",
  "description": "Examines fundamental physics and mechanics as they apply to plant fibers, solid wood and bio-based composites, with focus on hygroscopicity, heat & mass transport, elasticity and strength of materials, and other mechanical properties. Emphasizes aspects of general physical and mechanical theories and models, less commonly covered in general physics or engineering mechanics classes, but necessary in description of complex materials obtained from forest and agricultural biomass.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PHYSICAL AND MECHANICAL PROPERTIES OF WOOD PRACTICUM",
  "course_number": "WSE 324",
  "credits": "4",
  "description": "Introduces basic lab routines, explains fundamental concepts of physical measurements and testing, relevant to integrated knowledge from WSE 321 and WSE 322. Provides fundamental lab literacy, basic understanding on practical interpretation and use of standards, provides deeper understanding of how chemistry, physics, and anatomy affect material properties of wood and wood-based materials. Uses wood and a range of wood-based materials such as hardwoods, softwoods, wood fibers, composite wood products (e.g., CLT, LVL, OSB, plywood, MDF, wood-plastic composites, paper, etc.) to examine the intricate relationships between fundamental properties and performance.",
  "prerequisites": [["WSE 321"], ["WSE 322"]]
}, {
  "corequisites": [],
  "course_name": "WOOD PRODUCTS STUDIO",
  "course_number": "WSE 350",
  "credits": "4",
  "description": "Explore fundamental woodworking from a furniture design perspective. Evaluate rough milled wood for best cuts and develop cut lists and designs for basic frame and panel furniture. Explore common joinery techniques and finishes. Analyze the relationships between wood extractives, wood grain direction, wood density, and construction techniques. Demonstrate proficiency in all major woodworking machines by squaring up stock and milling boards to precise dimensions. Demonstrate cause and effect relationships between wood and water in functional design. Design and produce a unique final furniture product.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*EVALUATING SUSTAINABILITY THROUGH LIFE CYCLE ANALYSIS",
  "course_number": "WSE 385",
  "credits": "3",
  "description": "With increased focus on sustainability, it has become important to quantify a sustainability metric of a material, process, or a system. To that end an understanding of life cycle analysis (LCA) is needed that can be used to determine a sustainability metric. This Ecampus course presents the use of LCA to gain insights on the environmental and social impacts of the choices we make. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*BAMBOOLOOZA: THE FASCINATING WORLD OF BAMBOO",
  "course_number": "WSE 392",
  "credits": "3",
  "description": "An exploration of the world of bamboo and its application to renewable products. This course provides an in-depth understanding of a renewable material bamboo from its native form to processed products. Additionally, this course discusses the utilization and perception of bamboo in different societies of the world. Taught via Ecampus only. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "WSE 399",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH",
  "course_number": "WSE 401",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "WSE 403",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "WSE 405",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "WSE 406",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WSE INTERNSHIP",
  "course_number": "WSE 410",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WOODTURNING WITH SCIENCE II",
  "course_number": "WSE 413",
  "credits": "4",
  "description": "An in-depth look at how character in wood (figure, spalting, knots, etc.) affects machinability and output in both functional and aesthetic turning. Students will work with a wide range of spalted wood types and figure across numerous species while working on advanced turning forms. Particular emphasis will be placed upon how figure affects grain orientation, how spalting affects density and stability, and how the challenges with character wood can be overcome without specialty tools.",
  "prerequisites": [["WSE 210"], ["WSE 211"]]
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO SCULPTURAL WOODTURNING",
  "course_number": "WSE 417",
  "credits": "4",
  "description": "Explore traditional woodturning styles from around the world. Synthesize styles from the North American Studio Woodturning Movement. Modify current styles with personal aesthetics to create studio woodturning work. Recognize the differences between craft, professional, and studio woodturning.",
  "prerequisites": [["WSE 211"], ["WSE 413"]]
}, {
  "corequisites": [],
  "course_name": "INTEGRATED SCULPTURAL WOODTURNING",
  "course_number": "WSE 418",
  "credits": "4",
  "description": "Synthesize personal style with historic work during object creation. Develop an independent sculptural style. Distinguish craft from sculptural work and the markets that support them. Investigate marketing opportunities based upon your style of work. Develop appropriate products for such spaces. Assemble a cohesive website and marketing plan in which you could thrive as an independent artist.",
  "prerequisites": [["WSE 417"]]
}, {
  "corequisites": [],
  "course_name": "TIMBER TECTONICS IN THE DIGITAL AGE",
  "course_number": "WSE 425",
  "credits": "4",
  "description": "An exploration of the advances in design, construction and fabrication of timber buildings. Includes experimentation with both physical and digital models and a final project, in collaboration with UO Architecture students.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FUNDAMENTALS OF ENGINEERING MECHANICS",
  "course_number": "WSE 430",
  "credits": "4",
  "description": "An introduction to fundamentals of engineering mechanics for RM students selecting Science and Engineering option. While in most aspects the course follows standard introductory mechanics courses for engineers, special attention is paid to elasticity and strength in cellular and anisotopic materials like solid wood and bio-based composites. The overall objective of this course is to provide fundamental knowledge and practical skills in the area of engineering mechanics and mechanical principles behind some of the most important methods of characterization, processing, and utilization of renewable biomaterials; commonly used today, emerging and future.",
  "prerequisites": [["MTH 254", "MTH 254H"], ["WSE 324"]]
}, {
  "corequisites": [],
  "course_name": "STRAND-BASED COMPOSITES MANUFACTURE",
  "course_number": "WSE 444",
  "credits": "1",
  "description": "The strand-based composites manufacturing process uses the results of research projects and the instructor's mill experience. All aspects of the process from wood procurement through pressing are discussed. This course will be valuable to those interested in a manufacturing career.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "^FOREST PRODUCTS BUSINESS",
  "course_number": "WSE 453",
  "credits": "3",
  "description": "Provides students with the skills necessary to operate effectively in the global forest products industry.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INDUSTRIAL MARKETING OF WOOD PRODUCTS",
  "course_number": "WSE 455",
  "credits": "3",
  "description": "Focuses on the written and oral communication skills necessary to apply basic concepts of marketing forest products. Critically examines real-world examples via guest industry speakers, relating coursework to the day-to-day work in business.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WOOD PRODUCTS SALES",
  "course_number": "WSE 457",
  "credits": "3",
  "description": "Introduces basic business practices in the wood products industry. Examines major product categories of the wood products industry and their applications. Explores the specific practices associated with selling wood products. Examines in-depth, the products and terminology unique to the sector, including export sales. Introduces the breadth of sales positions across the industry.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO WOOD PRODUCTS MANUFACTURING",
  "course_number": "WSE 461",
  "credits": "4",
  "description": "First of a three-term series exploring technologies and management practices associated with manufacturing products from wood and other renewable materials. Covers major processing steps for the conversion of raw materials into products. Emphasizes major processing steps, equipment, and the impact of material properties on processing strategies.",
  "prerequisites": [["WSE 210"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED WOOD MANUFACTURING 1",
  "course_number": "WSE 462",
  "credits": "4",
  "description": "Second of a three-term series exploring technologies and management practices associated with manufacturing products from wood and other renewable materials. Explores advanced technologies and management practices associated with wood products manufacturing processes. Emphasizes process design, quality control, and continuous process improvement.",
  "prerequisites": [["WSE 461"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED MANUFACTURING 2",
  "course_number": "WSE 463",
  "credits": "4",
  "description": "Third of a three-term series exploring technologies and management practices associated with manufacturing products from wood and other renewable materials. Subjects covered include process control, optimization, automation, and contemporary topics such as Big Data and the Internet of Things and the potential impacts of the trends on manufacturing enterprises.",
  "prerequisites": [["WSE 462"]]
}, {
  "corequisites": [],
  "course_name": "WOOD PRODUCTS FIELD SCHOOL",
  "course_number": "WSE 465",
  "credits": "2",
  "description": "Provides first-hand experience of range of diverse wood products related industrial and commercial operations representing many parts of the renewable materials value chain. Provides insight into diversity in products and services, modes and scales of manufacturing operations related to wood products. Includes daily travel to industrial plants, mills workshops, art and craft studios, or related businesses and at least one overnight stay.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "*FORESTS",
  "course_number": "WSE 470",
  "credits": "WOOD",
  "description": "Multidisciplinary examination of issues related to the roles of forests, trees, and wood in civilization, as providers of commodities, ecosystem services, and spiritual and artistic inspiration. Issues include global supply and demand, wood ownership and political power, and perceptions and uses of forest resources in different societies. (Bacc Core Course)",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESIDENTIAL BUILDING CONSTRUCTION AND MATERIALS",
  "course_number": "WSE 471",
  "credits": "3",
  "description": "Explores material selection options, applications, and performance characteristics. Covers residential construction methods, including green building concepts, building codes, and project planning. Introduces concepts and interpretation of life cycle assessment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST TO FRAME: MASS TIMBER",
  "course_number": "WSE 492",
  "credits": "3",
  "description": "Critically examines the benefits of using mass timber with particular emphasis on its raw materials, manufacturing process, and engineering properties. Applies fundamental engineering concept to design gravity and lateral systems with mass timber including new innovations like hybrid structures. Integrates durability attributes, environmental, and social impacts to holistically analyze mass timber design within entire supply chain. CROSSLISTED as CCE 492/WSE 492.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "WSE 499",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "WSE 501",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "WSE 503",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "WSE 505",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "WSE 506",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "WSE 507",
  "credits": "1",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WOODTURNING WITH SCIENCE II",
  "course_number": "WSE 513",
  "credits": "4",
  "description": "An in-depth look at how character in wood (figure, spalting, knots, etc.) affects machinability and output in both functional and aesthetic turning. Students will work with a wide range of spalted wood types and figure across numerous species while working on advanced turning forms. Particular emphasis will be placed upon how figure affects grain orientation, how spalting affects density and stability, and how the challenges with character wood can be overcome without specialty tools.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO SCULPTURAL WOODTURNING",
  "course_number": "WSE 516",
  "credits": "4",
  "description": "Explore traditional woodturning styles from around the world. Synthesize styles from the North American Studio Woodturning Movement. Modify current styles with personal aesthetics to create studio woodturning work. Recognize the differences between craft, professional, and studio woodturning.",
  "prerequisites": [["WSE 513"]]
}, {
  "corequisites": [],
  "course_name": "TIMBER TECTONICS IN THE DIGITAL AGE",
  "course_number": "WSE 525",
  "credits": "4",
  "description": "An exploration of the advances in design, construction and fabrication of timber buildings. Includes experimentation with both physical and digital models and a final project, in collaboration with UO Architecture students.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "STRUCTURAL HEALTH ASSESSMENT/MONITORING OF TIMBER BUILDINGS",
  "course_number": "WSE 526",
  "credits": "3",
  "description": "Holistic approaches for the evaluation of the performance of timber systems and structures in a building. Learn about the tools available to experts for different analysis purposes, and to understand how data acquired from different techniques can be analyzed and used to inform building management and maintenance, fabrication and construction practices, and future design.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO WOOD SCIENCE & ENGINEERING",
  "course_number": "WSE 540",
  "credits": "2",
  "description": "Explores the breadth of wood sciences by exposing students to faculty expertise on wood properties and products. Analyzes key concepts/issues associated with wood science. Examines basics of wood products in relation to markets and trade.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WOOD STRUCTURE",
  "course_number": "WSE 541",
  "credits": "3",
  "description": "Identifies and explores common North American species utilized to meet our fiber needs. Describes their growth, cell types present, and arrangements within a stem at the macro- and micro-level. Reviews the polymers (cellulose, hemicellulose and lignin) that form plant cell walls and their roles in determining wood properties. Describes various types of abnormal wood and how they influence wood and product properties. Examines the interaction of wood and water as is the impact of wood structure on properties and transport phenomena.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SCIENTIFIC METHODOLOGY IN PLANNING RESEARCH PROJECTS",
  "course_number": "WSE 542",
  "credits": "2",
  "description": "Provides basic theoretical knowledge and practical skills related to scientific methodology and planning as they apply to conduct graduate projects in technical sciences and engineering. Explains why we employ the methods that we do, why these decisions are important, and how they impact final results. Provides training in research ethics to be able to conduct scholarly and professional activities in an ethical manner.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "FOREST SECTOR BUSINESS & SUSTAINABILITY",
  "course_number": "WSE 543",
  "credits": "2",
  "description": "Explores at multiple levels the complex confluence of forests, business, and sustainability. Critically analyzes the idiosyncratic context of the forest sector, prominent pathways to managing forest-dependent businesses, and the contribution of forest sector businesses to achieving Sustainable Development Goals. Examines markets for forest products and the companies that cater to those markets.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WOOD CHEMISTRY",
  "course_number": "WSE 544",
  "credits": "2",
  "description": "Explores the chemical makeup of lignocellulosic materials with a specific focus on wood. Critically analyzes products that can be made from renewable raw materials. Examines processes required to manufacture paper and wood chemical products.",
  "prerequisites": [["WSE 541"]]
}, {
  "corequisites": [],
  "course_name": "WOOD PHYSICS",
  "course_number": "WSE 545",
  "credits": "2",
  "description": "Examines fundamental physics as applied to plant fibers, solid wood and bio-based composites, with focus on hygroscopicity, heat & mass transport, and synthesis and application of principles to practical examples such as in wood drying or hot pressing. Explores general physical and mechanical theories and models are used to describe the behavior of biomaterials to the same degree as to all other materials. Explores the complexity of materials obtained from forest and agricultural biomass, including discussion of certain aspects of physical models and theories not commonly covered in general physics classes.",
  "prerequisites": [["WSE 541"]]
}, {
  "corequisites": [],
  "course_name": "WOOD MECHANICS",
  "course_number": "WSE 546",
  "credits": "2",
  "description": "Explores at multiple levels the complex structure of wood and how it influences mechanical properties. Analyzes load response, stress, strain, and directional complexities. Critically examines mechanics of engineered wood composites, its strengths and weaknesses, in relationship to other commonly used building materials.",
  "prerequisites": [["WSE 541"]]
}, {
  "corequisites": [],
  "course_name": "WOOD BIODETERIORATION & PRESERVATION",
  "course_number": "WSE 547",
  "credits": "2",
  "description": "Examines wood biodeterioration, biodegradation, and various method for their prevention. Describes the biotic and abiotic agents of wood decay and requires students to compare and contrast them with respect to their impacts on wood. Describes the chemical properties and mode of action of common wood preservatives, wood protection systems, and wood modification technologies. Synthesizes base knowledge in wood preservative technology into novel creative methods for wood protection or environmental risk mitigation.",
  "prerequisites": [["WSE 541"]]
}, {
  "corequisites": [],
  "course_name": "WOOD IDENTIFICATION",
  "course_number": "WSE 548",
  "credits": "2",
  "description": "Explores and identifies the microanatomy of common commercial hardwoods and softwoods from around the world. Identifies key features in target wood species used in morphological identification. Evaluates the anatomy of differing wood species. Models the use of paper and digital databases for wood identification. Reviews current genetic and alternative methods wood identification.",
  "prerequisites": [["WSE 541"]]
}, {
  "corequisites": [],
  "course_name": "FOREST PRODUCTS BUSINESS",
  "course_number": "WSE 553",
  "credits": "3",
  "description": "Provides students with the skills necessary to operate effectively in the global forest products industry.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "WOOD DESIGN",
  "course_number": "WSE 558",
  "credits": "4",
  "description": "Study of basic wood properties and design considerations. Design and behavior of wood connectors, beams, columns and beam columns. Introduction to plywood and glued laminated members. Analysis and design of structural diaphragms and shear walls. CROSSLISTED as CE 584/WSE 558.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "INTRODUCTION TO WOOD PRODUCTS MANUFACTURING",
  "course_number": "WSE 561",
  "credits": "4",
  "description": "First of a three-term series exploring technologies and management practices associated with manufacturing products from wood and other renewable materials. Covers major processing steps for the conversion of raw materials into products. Emphasizes major processing steps, equipment, and the impact of material properties on processing strategies.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED WOOD MANUFACTURING 1",
  "course_number": "WSE 562",
  "credits": "4",
  "description": "Second of a three-term series exploring technologies and management practices associated with manufacturing products from wood and other renewable materials. Explores advanced technologies and management practices associated with wood products manufacturing processes. Emphasizes process design, quality control, and continuous process improvement.",
  "prerequisites": [["WSE 561"]]
}, {
  "corequisites": [],
  "course_name": "ADVANCED MANUFACTURING 2",
  "course_number": "WSE 563",
  "credits": "4",
  "description": "Third of a three-term series exploring technologies and management practices associated with manufacturing products from wood and other renewable materials. Subjects covered include process control, optimization, automation, and contemporary topics such as Big Data and the Internet of Things and the potential impacts of the trends on manufacturing enterprises.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESIDENTIAL BUILDING CONSTRUCTION AND MATERIALS",
  "course_number": "WSE 571",
  "credits": "3",
  "description": "Explores material selection options, applications, and performance characteristics. Covers residential construction methods, including green building concepts, building codes, and project planning. Introduces concepts and interpretation of life cycle assessment.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "BIOENERGY AND ENVIRONMENTAL IMPACT",
  "course_number": "WSE 573",
  "credits": "3",
  "description": "Explores world's use of woody biomass fuels, their potential to contribute to our region's energy supply, and conversion technologies such as direct combustion, pyrolysis, and thermochemical modification. Examines emissions and other environmental impacts of utilizing renewable materials to generate energy and manufacture products.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "ADVANCED WOOD DESIGN",
  "course_number": "WSE 592",
  "credits": "4",
  "description": "Study of advanced concepts in wood properties and design. Design and analysis of specialty wood connectors. Design of wood members for adverse conditions including fire design. Common failure mechanisms and forensic engineering concepts. Design for durability. Lec/lab.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "WSE 599",
  "credits": "0-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "RESEARCH AND SCHOLARSHIP",
  "course_number": "WSE 601",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "THESIS",
  "course_number": "WSE 603",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "READING AND CONFERENCE",
  "course_number": "WSE 605",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "PROJECTS",
  "course_number": "WSE 606",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SEMINAR",
  "course_number": "WSE 607",
  "credits": "1",
  "description": "Section 1: Beginning Seminar. Section 2: Graduate Seminar.",
  "prerequisites": []
}, {
  "corequisites": [],
  "course_name": "SPECIAL TOPICS",
  "course_number": "WSE 699",
  "credits": "1-16",
  "description": "",
  "prerequisites": []
}]